[
  {
    "id": 1,
    "expandedCharacterList": null
  },
  {
    "id": 2,
    "expandedCharacterList": null
  },
  {
    "id": 3,
    "expandedCharacterList": "Wings developing in <u>wing pads</u>. Mouthparts suitable for chewing. Gills <u>digitiform</u> and located near mouthparts, on neck, sides of thorax, or underside of base of abdomen, never on top or sides of abdomen. <strong>Two tarsal claws per leg. Only two tails (<u>cerci</u>)</strong>."
  },
  {
    "id": 4,
    "expandedCharacterList": "<strong><u>Glossae</u> much shorter than the <u>paraglossae</u>. Multi-branched, <u>filamentous</u> gills present <u>laterally</u> and <u>ventrally</u> on thorax, but not on abdomen.</strong>"
  },
  {
    "id": 5,
    "expandedCharacterList": "Head with three <u>ocelli</u>, brown, usually with <strong>yellow M-shaped pattern anterior to <u>median</u> <u>ocellus</u></strong>.<strong> Postocular fringe (fringe of hair around eyes) with close-set row of several thick <u>spinules</u> (small spines)</strong>. <strong><u>Occiput</u> without conspicuous <u>transverse</u> ridge or row of <u>spinules</u></strong>, except some <u>spinules</u> sparsely present near postocular fringe. Fringe along margins of <u>pronotum</u> well developed, except incomplete <u>laterally</u>. <strong>Mesal surfaces of <u>cerci</u> fringed with silky <u>setae</u>, at least <u>basally</u></strong>."
  },
  {
    "id": 6,
    "expandedCharacterList": "<strong><u>Paraglossae</u> and <u>glossae</u> about same length. Second tarsal segment of each leg about same length as first. <u>Wing pads</u> divergent, not parallel with body. </strong>Gills absent on abdominal segments. Unlike Peltoperlidae, gills, if present, not conical, and <u>thoracic</u> sterna not overlapping. Unlike Nemouridae <u>hind legs</u> not reaching end of the abdomen."
  },
  {
    "id": 7,
    "expandedCharacterList": "<strong><u>Coxa</u> each with single <u>digitiform</u>, segmented gill at mesal side of base.</strong>"
  },
  {
    "id": 14,
    "expandedCharacterList": "<u>Larvae</u>: Wings/<u>wing pads</u> absent. Eye spots present, but <u>compound eyes</u> absent. Antennae usually small, inconspicuous. Three pairs of segmented legs present on thorax.<strong> Pair of <u>anal prolegs</u>, each with single hook, located on last abdominal segment. <u>Larvae</u> can be free-living, in silken retreats attached to substrate, or in usually-portable tubes or cases made of sand, rocks, or plant material</strong>."
  },
  {
    "id": 18,
    "expandedCharacterList": "<strong><u>Pro-</u>, <u>meso</u><u>-</u>, and <u>metanota</u> entirely covered by <u>sclerites</u>. <u>Ventral</u> side of abdomen with rows of branched gills. Conspicuous tuft or fan of long hairs on each <u>anal proleg</u>. </strong>Anal claw with stout <u>apical</u> hook. <u>Larvae</u> building stationary retreats of silk, detritus, and rock fragments and add a silken net for filter feeding."
  },
  {
    "id": 19,
    "expandedCharacterList": "Mandibles not flanged. <strong><u>Frontoclypeus</u> usually notched, or <u>thoracic</u> sternum with pair of small intersegmental <u>sclerites</u> behind <u>prosternum</u>, or usually both of these characters present. </strong><u>Ventrally</u>, <u>genae</u> divided mostly by only one fine longitudinal <u>ecdysial</u><u> line</u>. Anterior <u>ventral apotome</u> without bump along the <u>distal</u> margin. Posterior <u>ventral apotome</u> small, inconspicuous, no longer than wide. <u>Foretrochantins</u> forked. Abdominal gills each with about 10 branches arising near <u>distal</u> end. Abdominal segment VIII with pair of <u>sclerites</u> <u>ventrally</u>. <u>Sclerites</u> on abdominal sternum IX each notched along posterior edge. "
  },
  {
    "id": 20,
    "expandedCharacterList": "Wings developing in <u>wing pads</u>. Mouthparts suitable for chewing. Gills present on tops and sides of abdomen. Segmented legs present.<strong> One tarsal claw per leg. Usually with 3 tails (sometimes 2).</strong>"
  },
  {
    "id": 31,
    "expandedCharacterList": "<strong><u>Femora</u> and <u>tibia</u> of <u>forelegs</u> with double rows of long <u>setae</u> along inner margins</strong>. Abdominal segment 1 with dorsolateral gills, similar in appearance other gills, each consisting of longer <u>dorsal</u> <u>lamella</u> and shorter <u>fibrilliform</u> portion. <strong><u>Nymphs</u> with streamlined, minnow-like body shape</strong>. <em>Isonychia </em>is the only genus in the family. Widespread and common."
  },
  {
    "id": 32,
    "expandedCharacterList": "<em>Isonychia </em>is the only genus in the family Isonychiidae, therefore the family level and genus level characters are the same. "
  },
  {
    "id": 33,
    "expandedCharacterList": "As in all families of superfamily Limnephiloidea, short, inconspicuous <strong>antennae are each located about midway between base of mandible and eye</strong>. <u>Prosternal</u> horn usually present. Chloride epithelia usually present on at least some abdominal segments. <strong>Otherwise distinguished from other Limnephiloidea families as follows</strong>: Mandibles usually toothed and <u>setae</u> usually absent between anterodorsal (<u>sa1</u>) <u>sclerites</u> or, if present then fewer than 25 <u>setae</u> (unlike Apataniidae). <u>Mesonotum</u> not notched along anterior margin (unlike Thremmatidae). <u>Mesopleura</u> not expanded as in Goeridae. <u>Larvae</u> usually large when mature and building tubular cases of varying materials, usually rocks or rough plant materials. Mature <u>larvae</u> 6–30 mm."
  },
  {
    "id": 35,
    "expandedCharacterList": "<u>Mesonotum</u> with <u>sclerotized</u> plates each about as long as wide. <u>Metanotal</u> <u>sa1</u> <u>sclerites</u> not fused although often touching. <strong>Abdominal segment I with one tall vertical tear-drop-shaped <u>sclerite</u> at posterior edge of base of each <u>lateral</u> hump, almost as tall as hump. Abdominal gills mostly single. Chloride epithelia are present only on abdominal sterna III–VII</strong>. Abdominal <u>tergum</u> IX with only one hair on each side of <u>sclerite</u>. Case a tube of rock fragments or plant materials, variously constructed, sometimes 3-sided in earlier instars."
  },
  {
    "id": 52,
    "expandedCharacterList": "Adults <strong>with hardened forewings (<u>elytra</u>) covering the hind wings.</strong> "
  },
  {
    "id": 53,
    "expandedCharacterList": "Wings and <u>wing pads</u> absent. Eye spots sometimes visible, but <u>compound eyes</u> absent. <strong>Segmented legs absent,</strong> but sometimes fleshy <u>prolegs</u> present. Sometimes with distinct head, often without head or with head drawn deeply into thorax. Body flattened, cylindrical, or maggot-like."
  },
  {
    "id": 54,
    "expandedCharacterList": "Adults: With or without wings. If wings present, forewings typically leathery or hard <u>basally</u> and translucent and flexible <u>apically</u>. <u>Nymphs</u>: With or without <u>wing pads</u>. Segmented legs present. Mandibles hidden within<strong> needle-like beak </strong>in adults and <u>nymphs</u>."
  },
  {
    "id": 55,
    "expandedCharacterList": "Caterpillars with wings and <u>wing pads</u> absent. Eye spots usually present, but <u>compound eyes</u> absent. <strong>Short segmented legs present on thorax</strong>, not as long as abdomen. <strong>Underside of abdomen with several pairs of <u>prolegs</u> (fleshy nubs) with tiny hooks.</strong>"
  },
  {
    "id": 56,
    "expandedCharacterList": "Larval wings/<u>wing pads</u> absent. Eye spots present, but <u>compound eyes</u> absent. Segmented legs present on thorax.<strong> Abdominal segment 9 with either one slender tail or pair of <u>anal prolegs</u>, each with two hooks. Seven or eight pairs of filaments or gills <u>laterally</u> on abdomen</strong>, with<strong> </strong>never more than one pair per segment."
  },
  {
    "id": 57,
    "expandedCharacterList": "<u>Nymph</u> with <strong>mask-like <u>labium</u> </strong>below chewing mouthparts. Wings developing in <u>wing pads</u>. Segmented legs present, each with two claws. "
  },
  {
    "id": 58,
    "expandedCharacterList": null
  },
  {
    "id": 59,
    "expandedCharacterList": null
  },
  {
    "id": 60,
    "expandedCharacterList": null
  },
  {
    "id": 61,
    "expandedCharacterList": null
  },
  {
    "id": 62,
    "expandedCharacterList": null
  },
  {
    "id": 63,
    "expandedCharacterList": null
  },
  {
    "id": 64,
    "expandedCharacterList": null
  },
  {
    "id": 65,
    "expandedCharacterList": null
  },
  {
    "id": 66,
    "expandedCharacterList": null
  },
  {
    "id": 67,
    "expandedCharacterList": null
  },
  {
    "id": 68,
    "expandedCharacterList": null
  },
  {
    "id": 69,
    "expandedCharacterList": null
  },
  {
    "id": 70,
    "expandedCharacterList": null
  },
  {
    "id": 71,
    "expandedCharacterList": null
  },
  {
    "id": 72,
    "expandedCharacterList": null
  },
  {
    "id": 73,
    "expandedCharacterList": null
  },
  {
    "id": 74,
    "expandedCharacterList": null
  },
  {
    "id": 75,
    "expandedCharacterList": null
  },
  {
    "id": 76,
    "expandedCharacterList": null
  },
  {
    "id": 77,
    "expandedCharacterList": null
  },
  {
    "id": 78,
    "expandedCharacterList": null
  },
  {
    "id": 79,
    "expandedCharacterList": null
  },
  {
    "id": 80,
    "expandedCharacterList": null
  },
  {
    "id": 81,
    "expandedCharacterList": null
  },
  {
    "id": 82,
    "expandedCharacterList": null
  },
  {
    "id": 83,
    "expandedCharacterList": null
  },
  {
    "id": 84,
    "expandedCharacterList": null
  },
  {
    "id": 85,
    "expandedCharacterList": null
  },
  {
    "id": 86,
    "expandedCharacterList": null
  },
  {
    "id": 87,
    "expandedCharacterList": null
  },
  {
    "id": 88,
    "expandedCharacterList": null
  },
  {
    "id": 89,
    "expandedCharacterList": null
  },
  {
    "id": 90,
    "expandedCharacterList": null
  },
  {
    "id": 91,
    "expandedCharacterList": null
  },
  {
    "id": 92,
    "expandedCharacterList": null
  },
  {
    "id": 93,
    "expandedCharacterList": null
  },
  {
    "id": 94,
    "expandedCharacterList": null
  },
  {
    "id": 95,
    "expandedCharacterList": null
  },
  {
    "id": 96,
    "expandedCharacterList": null
  },
  {
    "id": 97,
    "expandedCharacterList": null
  },
  {
    "id": 98,
    "expandedCharacterList": null
  },
  {
    "id": 99,
    "expandedCharacterList": null
  },
  {
    "id": 100,
    "expandedCharacterList": null
  },
  {
    "id": 101,
    "expandedCharacterList": null
  },
  {
    "id": 102,
    "expandedCharacterList": null
  },
  {
    "id": 103,
    "expandedCharacterList": null
  },
  {
    "id": 104,
    "expandedCharacterList": null
  },
  {
    "id": 105,
    "expandedCharacterList": null
  },
  {
    "id": 106,
    "expandedCharacterList": null
  },
  {
    "id": 107,
    "expandedCharacterList": "The antennules (smaller of the two pairs of antennas) are well formed, not vestigial. Dorsal body segments 8–9 are small and inconspicuous, not well pronounced in as in Stenasellidae. The uropods (pair of forked, tail-like appendages) are present terminally not lateral or ventral. "
  },
  {
    "id": 108,
    "expandedCharacterList": null
  },
  {
    "id": 109,
    "expandedCharacterList": "<strong>Abdominal segments 1–8 with paired, 2-segemented, <u>lateral</u> filaments</strong>. Abdominal segment 10 has pair of 1-segemented filaments. <strong>End of abdomen with pair of <u>anal prolegs</u>, each bearing 2 claws</strong>. Mature <u>larvae</u> 30–65 mm long."
  },
  {
    "id": 110,
    "expandedCharacterList": "Head without conspicuous color pattern.<strong> Abdominal <u>ventral</u> gill tufts absent.</strong> Last pair of <u>dorsal</u> abdominal <u>spiracles</u> positioned at <u>distal</u> ends of short respiratory tubes and are about same size as other <u>spiracles</u>; <strong>respiratory tubes much shorter than <u>anal prolegs</u></strong>."
  },
  {
    "id": 111,
    "expandedCharacterList": null
  },
  {
    "id": 112,
    "expandedCharacterList": null
  },
  {
    "id": 113,
    "expandedCharacterList": "<strong>Head usually partially contracted into thorax</strong>. <strong>Each antenna 11-segmented, usually with enlarged <u>basal</u> segment and expanded 2nd segment covering remaining antennal segments folded beneath it</strong>. <u>Prosternum</u> expanded anteriorly as prominent lobe beneath head. <u>Elytra</u> concealing entire abdomen or exposing only part of one abdominal tergite. All <u>tarsi</u> 5-segmented. <strong>Forelegs with <u>transverse</u> <u>coxae</u> and visible trochantins, unlike Elmidae</strong>. Hind <u>coxae</u> not touching. Abdomen 5- or 6-segmented."
  },
  {
    "id": 114,
    "expandedCharacterList": "Antennae widely separated at bases.<strong> 2nd antennal segment enlarged, and shield-like, protecting remaining segments which may be retracted beneath it.</strong> <u>Pronotum</u> without groove near <u>lateral</u> margin. Parts of body and legs with fine wooly hair. Hairiness of last abdominal sternite different from other sternites, often bare. "
  },
  {
    "id": 115,
    "expandedCharacterList": "<u>Ventrally</u>, <u>pronotum</u> with conspicuous curved lines near each <u>lateral</u> margin (notopleural <u>sutures</u>). <u>Metasternum</u> without <u>transverse</u> <u>sutures</u>. <u>Elytra</u> covering entire abdomen or exposing only part of 1 tergite.<strong> Hind <u>coxae</u> each with median portion extending in posterior direction, dividing abdominal segment 1 into <u>lateral</u> <u>sclerites</u>, but not expanding into broad plates. Without large spur on end of each front <u>tibia</u>. Dyticidae without broad wedge-like hind <u>coxal</u> plate. <u>Scutellum</u> usually visible; if hidden, then front and middle <u>tarsi</u> apparently 4-segmented and hind <u>tarsi</u> each with 1 claw. </strong>Hind <u>tarsi</u> and usually <u>tibiae</u> flattened, streamlined, and bearing long, stiff swimming bristles. Body usually 3–25 mm long."
  },
  {
    "id": 116,
    "expandedCharacterList": "Moderate-sized, 5 to 14 mm long, and black or brown, with <u>elytra</u> appearing leathery with small cracks or net-like. <u>Pronotum</u> margined. Males with <u>tarsi</u> of front legs swollen and bearing dense <u>setae</u> tipped with minute discs. Hind claws of equal length. <u>Meta</u>coxal lines not strongly convergent anterior of <u>meta</u>coxal lobes; <u>elytra</u> without longitudinal striae; meta<u>femora</u> with or without <u>setae</u> on postero<u>apical</u> angles."
  },
  {
    "id": 117,
    "expandedCharacterList": null
  },
  {
    "id": 118,
    "expandedCharacterList": "Smaller beetles 3.5-5.0 mm long. <u>Elytra</u> with longitudinal <u>striae</u>. <u>Meta</u>coxal lines strongly convergent and almost contacting <u>medial</u> line anterior of <u>meta</u>coxal lobes, then diverging anteriorly. Meta<u>femora</u> lacking groups of <u>setae</u> at postero<u>apical</u> angles."
  },
  {
    "id": 119,
    "expandedCharacterList": "Terminal segment of each antenna no longer than combined length of 2 preceding segments; <strong>antennae thread-like.</strong> <u>Elytra</u> concealing entire abdomen or exposing only part of 1 tergite. <strong>Each leg with 5 tarsal segments, last tarsal segment about as long as other segments combined and with big claws</strong>. Abdomen with 5 visible segments."
  },
  {
    "id": 120,
    "expandedCharacterList": null
  },
  {
    "id": 121,
    "expandedCharacterList": null
  },
  {
    "id": 122,
    "expandedCharacterList": null
  },
  {
    "id": 123,
    "expandedCharacterList": null
  },
  {
    "id": 124,
    "expandedCharacterList": null
  },
  {
    "id": 125,
    "expandedCharacterList": null
  },
  {
    "id": 126,
    "expandedCharacterList": null
  },
  {
    "id": 127,
    "expandedCharacterList": null
  },
  {
    "id": 128,
    "expandedCharacterList": null
  },
  {
    "id": 129,
    "expandedCharacterList": null
  },
  {
    "id": 130,
    "expandedCharacterList": null
  },
  {
    "id": 131,
    "expandedCharacterList": null
  },
  {
    "id": 132,
    "expandedCharacterList": "Antennae filiform, 10-11 segmented. <u>Pronotum</u> with <u>lateral</u> serrations, small teeth on <u>basal</u> margin, and short longitudinal <u>basal</u> <u>carinae</u>. Fore<u>tibiae</u> each with fringe of <u>tomentum</u>. Tarsal claws not unusually long or prominent. Hind <u>coxae</u> <u>transverse</u>. Pair of teeth arising from <u>lateral</u> margins of abdominal sternum IV clasping their respective epi<u>pleura</u> of the <u>elytra</u>."
  },
  {
    "id": 133,
    "expandedCharacterList": null
  },
  {
    "id": 134,
    "expandedCharacterList": null
  },
  {
    "id": 135,
    "expandedCharacterList": "Short antennae with clubbed <u>apices</u>. <strong><u>Compound eyes</u> divided into separate <u>dorsal</u> and <u>ventral</u> portions (\"4-eyed\" appearance). </strong>"
  },
  {
    "id": 136,
    "expandedCharacterList": null
  },
  {
    "id": 137,
    "expandedCharacterList": null
  },
  {
    "id": 138,
    "expandedCharacterList": "<u>Dorsal</u> and <u>ventral</u> <u>compound eyes</u> divided (“four-eyed” appearance). Upper eyes are separated from <u>lateral</u> margin of head by a distance equal to half the width of eye or more. <u>Pronotum</u> and <u>elytron</u> entirely <u>glabrous</u> (without hair). Each <u>elytron</u> with 11 conspicuous <u>striae</u>. <u>Scutellum</u> exposed, not covered or obscured. <u>Meso-</u> and <u>meta</u>tarsal segments 2, 3, and 4 are much wider than long. Body relatively small, about 4-7 mm in length."
  },
  {
    "id": 139,
    "expandedCharacterList": "<strong>The nasale (anterior most margin of the face) has 2-4 teeth measly along its margin.</strong> The head is elongate, with the <strong>collum (neck) nearly as wide as rest of the head.</strong>"
  },
  {
    "id": 140,
    "expandedCharacterList": "<u>Elytra</u> concealing entire abdomen. <strong>Hind <u>coxae</u> (first segment of the last leg) expanded into a broad, flat, plates, <u>ventrally</u> covering the first 2 or 3 abdominal segments and most of hind <u>femora</u></strong>. Adult beetles &gt; 3 mm long. "
  },
  {
    "id": 141,
    "expandedCharacterList": null
  },
  {
    "id": 142,
    "expandedCharacterList": "<strong><u>Pronotum</u> rounded with distinct black blotch on each side of middle near posterior margin</strong>. Last segment of both <u>maxillary</u> and <u>labial</u> <u>palps</u> cone-shaped, as long as or longer than next to last segment. <u>Elytra</u> with fine <u>sutural</u> <u>striae</u> in at least <u>apical</u> half. <strong>Hind coxal plates large, covering all of abdomen <u>ventrally</u> except last abdominal sternite</strong>."
  },
  {
    "id": 143,
    "expandedCharacterList": "<strong><u>Maxillary</u> <u>palpi</u> usually longer than antennae. Antennae about as long as head, with 2nd segment attached at <u>apex</u> of 1st (<u>basal</u>-most) segment; usually with 5 segments before <u>cupule</u> (cup-shaped, hairless, segment 6); segments 7–9 clubbed</strong>. <u>Pronotum</u> usually not narrower than <u>elytra</u>; if narrower, then <u>scutellum</u> long and triangular. <u>Elytra</u> concealing entire abdomen or exposing only part of 1 segment. Hind <u>coxae</u> not extending in the posterior direction to divide abdominal sternite 1. <u>Metacoxae</u> nearly touching. <u>Ventrally</u>, longitudinal <u>keel</u> narrow between <u>coxae</u>. <u>Tarsal formula</u>: 5-5-5 or 5-4-4. <u>Ventrally</u>, abdomen with 5 visible segments."
  },
  {
    "id": 144,
    "expandedCharacterList": null
  },
  {
    "id": 145,
    "expandedCharacterList": null
  },
  {
    "id": 146,
    "expandedCharacterList": null
  },
  {
    "id": 147,
    "expandedCharacterList": null
  },
  {
    "id": 148,
    "expandedCharacterList": null
  },
  {
    "id": 149,
    "expandedCharacterList": null
  },
  {
    "id": 150,
    "expandedCharacterList": null
  },
  {
    "id": 151,
    "expandedCharacterList": "Adults are usually less than 12 mm in length. The <u>prosternum</u> has a small longitudinal groove. The <u>meso</u><u>-</u> and <u>metasternum</u> has a long, continuous, sharp spine extending between the hind <u>coxae</u>."
  },
  {
    "id": 152,
    "expandedCharacterList": "The antenna are short, with 2-3 segments. The labrum and clypeus are separated by a suture. The legs (visible ventrally) are suitable for walking, and are 3-4 segmented with only a single tarsal claw. The abdomen has 9 segments, with the 8th or 9th sometimes bearing immovable paired projections. Abdominal tergites do not have dorsal lobes. <strong>The body is dorsoventrally flattened, with thoracic and abdominal tergites expanded laterally as a thin shield covering the head and legs from above.</strong>"
  },
  {
    "id": 153,
    "expandedCharacterList": "<strong>Ventrally, the abdomen has 5 paired tufts of thread-like gills.</strong> Lateral expansions of each abdominal segment fit together tightly at the margin, but segment 8 without lateral expansions. Abdominal segment 9 without small ventral flap-like lid (operculum) closing the caudal chamber."
  },
  {
    "id": 154,
    "expandedCharacterList": null
  },
  {
    "id": 155,
    "expandedCharacterList": null
  },
  {
    "id": 156,
    "expandedCharacterList": null
  },
  {
    "id": 157,
    "expandedCharacterList": null
  },
  {
    "id": 158,
    "expandedCharacterList": null
  },
  {
    "id": 159,
    "expandedCharacterList": null
  },
  {
    "id": 160,
    "expandedCharacterList": "Mandibles move against each other along a horizontal or oblique plane. <strong>Head complete and fully exposed.</strong> <u>Spiracles</u> absent (apneustic). <u>Thoracic</u> segments individually distinguishable. Thorax and abdomen similar in diameter or abdomen wider. <strong>If <u>pro</u>thorax without <u>prolegs</u>, body usually smooth, shiny, and cream-colored, usually without any surface features except few <u>setae</u>, especially posteriorly</strong>, and sometimes single retractile <u>anal proleg</u> bearing few hooks. <strong>If <u>pro</u>thorax with pair of <u>ventral</u> <u>prolegs</u>, then <u>pro</u>thoracic and <u>anal prolegs</u> usually paired (even if divison slight and only at <u>apex</u>) and distinct <u>dorsal</u> fleshy projections and/or <u>setae</u> along body</strong>. Mature <u>larvae</u> approximately 2–15 mm long. "
  },
  {
    "id": 161,
    "expandedCharacterList": "<u>Larva</u> long, slender, shiny, almost featureless. Head capsule <u>sclerotized</u>, more than 1.8–2.0 times as long as wide, and conspicuously constricted anteriorly. <u>Sclerotized</u> posterior collar of head with half-circle expansion. <u>Dorsal</u> <u>tubercles</u> and <u>setae</u> absent. <u>Setae</u> of last abdominal segment (anal division) about 1/3 length of segment.  <u>Anal proleg</u> absent."
  },
  {
    "id": 162,
    "expandedCharacterList": "Mandibles move against each other along horizontal or oblique plane. <strong>Head complete and fully exposed</strong>. <strong>Hook-bearing <u>pro</u>thoracic and <u>anal prolegs</u> paired</strong>, though division may be slight and only at <u>apex</u>. <u>Spiracles</u> absent (apneustic). Body segments usually without conspicuous <u>dorsal</u> <u>tubercles</u> and <u>setae</u> as in some Ceratopogonidae."
  },
  {
    "id": 163,
    "expandedCharacterList": null
  },
  {
    "id": 164,
    "expandedCharacterList": null
  },
  {
    "id": 165,
    "expandedCharacterList": null
  },
  {
    "id": 166,
    "expandedCharacterList": null
  },
  {
    "id": 167,
    "expandedCharacterList": null
  },
  {
    "id": 168,
    "expandedCharacterList": null
  },
  {
    "id": 169,
    "expandedCharacterList": null
  },
  {
    "id": 170,
    "expandedCharacterList": null
  },
  {
    "id": 171,
    "expandedCharacterList": null
  },
  {
    "id": 172,
    "expandedCharacterList": null
  },
  {
    "id": 173,
    "expandedCharacterList": null
  },
  {
    "id": 174,
    "expandedCharacterList": null
  },
  {
    "id": 175,
    "expandedCharacterList": "Mandibles moving against one another along an horizontal or oblique plane. <strong>Hardened head capsule always deeply retracted inside thorax</strong>; often with length-wise incisions of varying depths beginning at posterior margin of head, and extending forward; in extreme cases head consisting of only several slender rods (visible only via disection of thorax). <u>Spiracles</u> absent (apneustic) or with 1 pair at posterior end of body (<u>meta</u>pneustic); <strong>posterior <u>spiracles</u> rimmed by 2–7 (usually 5) lobes</strong> often fringed with hair. Mature <u>larvae</u> usually 10–25 mm long. "
  },
  {
    "id": 176,
    "expandedCharacterList": null
  },
  {
    "id": 177,
    "expandedCharacterList": null
  },
  {
    "id": 178,
    "expandedCharacterList": null
  },
  {
    "id": 179,
    "expandedCharacterList": null
  },
  {
    "id": 180,
    "expandedCharacterList": null
  },
  {
    "id": 181,
    "expandedCharacterList": null
  },
  {
    "id": 182,
    "expandedCharacterList": null
  },
  {
    "id": 183,
    "expandedCharacterList": null
  },
  {
    "id": 184,
    "expandedCharacterList": null
  },
  {
    "id": 185,
    "expandedCharacterList": null
  },
  {
    "id": 186,
    "expandedCharacterList": "Mandibles move against each other along a horizontal or oblique plane. <strong>Head complete, fully exposed</strong>, distinct from thorax, and usually without lengthwise incisions.<strong> Head capsule usually with pair of conspicuous fans</strong>. <u>Pro</u>thorax with single <u>proleg</u> <u>ventrally</u>. <u>Thoracic</u> segments usually individually distinguishable. <strong>Posterior abdominal segments 5–8 swollen,</strong> <strong>with ballooned or bowling-pin appearance</strong>. Last abdominal segment ringed with several radiating rows of small hooks. Mature <u>larvae</u> usually 3–8 mm long, or greater."
  },
  {
    "id": 187,
    "expandedCharacterList": null
  },
  {
    "id": 188,
    "expandedCharacterList": "Fans of <u>setae</u> present on <u>labrum</u>, if closed, stalks still conspicuous. Head nearly parallel-sided. Antenna with proximal and/or <u>medial</u> segments lightly to darkly pigmented or, if colorless, then post<u>genal</u> cleft (<u>median</u> notch in postero<u>ventral</u> margin of head) extended anteriorly to, or beyond, <u>hypstomal</u><u> groove</u> (<u>transverse</u> line in exoskeleton between <u>ventral</u> bases of mandibles). Remaining characters needing study of slide-mounted <u>hypostoma</u> (jagged projection below mandibles): <u>Hypostoma</u> without intermediate teeth; paralateral teeth present. <u>Hypostoma</u> with <u>lateral</u> and sublateral teeth not clustered on prominent, common lobes (<u>median</u> and <u>lateral</u> teeth can be extended beyond sublateral teeth, but not prominent lobes). <u>Hypostoma</u> with <u>apex</u> of <u>median</u> tooth extended anteriorly to, or beyond <u>apices</u> of <u>lateral</u> teeth; sublateral teeth variously but distinctly posterior to <u>median</u> and <u>lateral</u> teeth. "
  },
  {
    "id": 189,
    "expandedCharacterList": null
  },
  {
    "id": 190,
    "expandedCharacterList": null
  },
  {
    "id": 191,
    "expandedCharacterList": null
  },
  {
    "id": 192,
    "expandedCharacterList": null
  },
  {
    "id": 193,
    "expandedCharacterList": "<u>Larvae</u> lacking fleshy projections on <u>thoracic</u> and abdominal segments.<strong> Posterior <u>spiracular disc</u> bordered by 6 (rarely 8) lobes (2 <u>dorsal</u>, 2 dorsolateral, 2 <u>ventral</u>)</strong>; lobes usually subconical, sometimes short and blunt. As for all crane flies, adults usually large, with long legs and V-shaped <u>sutures</u> on top of <u>meso</u>thorax, but terminal segment of each <u>maxillary</u> <u>palp</u> longer than previous 2 segments combined and antennae each 13-segmented."
  },
  {
    "id": 194,
    "expandedCharacterList": "Body with short hairs evenly distributed. Lobes of spiracular disk short, rarely more than twice their <u>basal</u> width, with sparse or short hairs. Distance between posterior <u>spiracles</u> as great or greater than diameter of one <u>spiracle</u>."
  },
  {
    "id": 195,
    "expandedCharacterList": "Body not flat. <u>Labrum</u> without notched <u>distal</u> margin and <strong><u>maxillae</u> each with row of golden pectinate spines</strong>. Tusks absent. Antennae shorter than twice width of head. <u>Thoracic</u> <u>notum</u> not turtle-shell-shaped. Abdominal <u>terga</u> usually without paired <u>tubercles</u>. Abdominal segment 2 with gills similar to those on other segments but NOT <u>operculate</u>/semioperculate; with single <u>lamellae</u> more or less oval and with <u>sclerotized</u> band along <u>lateral</u> margin and usually with a similar <u>sclerotized</u> band on or near mesal margin; gills usually not fringed; never ending in filaments or points. <u>Forelegs</u> without long hairs. <u>Tibiae</u> and <u>tarsi</u> not bowed; claws usually not long and slender. Claws of all legs similar, usually sharply pointed, variable in length. Three tails of about equal length."
  },
  {
    "id": 196,
    "expandedCharacterList": "Body not flat. <u>Labrum</u> with notched <u>distal</u> margin and <strong><u>maxillae</u> each with row of golden <u>pectinate</u> spines</strong>. Tusks absent. <u>Thoracic</u> <u>notum</u> not turtle-shell-shaped. Abdominal <u>terga</u> usually without paired <u>tubercles</u>. Abdominal segment two with gills similar to those on other segments but NOT <u>operculate</u>/semioperculate; with single <u>lamellae</u> more or less oval and with a <u>sclerotized</u> band along <u>lateral</u> margin and usually with a similar <u>sclerotized</u> band on or near mesal margin; usually not fringed; never ending in filaments or points. <u>Forelegs</u> without long hairs. <u>Tibiae</u> and <u>tarsi</u> not bowed; claws usually not long and slender. Claws of all legs similar, usually sharply pointed, variable in length. Three tails about same length."
  },
  {
    "id": 197,
    "expandedCharacterList": "<strong><u>Labrum</u> usually with <u>median</u> notch and antennae usually long (at least two or three times the width of the head). </strong>If <u>median</u> notch absent, then antennae long; if antennae shorter, then <u>distal</u> margin of the <u>labrum</u> always notched. Claws of all legs similarly shaped, usually pointed, rarely broad at the <u>apex</u>; claws of varying lengths, if claws of middle and <u>hind legs</u> long and slender, they are usually shorter than <u>tibiae</u>, except for few rare genera. Abdominal gills roughly oval or heart-shaped. Gill <u>lamellae</u> either single, double, or triple folded; rarely with fringe on inner margins, never with terminal filaments or pointed ends. Mature <u>larvae</u> 3-12 mm long."
  },
  {
    "id": 198,
    "expandedCharacterList": null
  },
  {
    "id": 199,
    "expandedCharacterList": "From among those of many genera of Baetidae, larvae distinguished by presence of <strong>well-developed <u>medial</u> corner of <u>maxillary</u> <u>palp</u> segment 2</strong>, villopore present on <u>ventral</u> base of some or all <u>femora</u>, tarsal claws each less than half as long as its <u>tarsus</u> and with single row of <u>denticles</u>, absence or presence of tiny hind <u>wing pads</u>, gills on abdominal segment 1-7 and simple (not folded on themselves), <strong><u>median</u> <u>caudal filament</u> (middle tail) longer than abdominal segment 10 but shorter than <u>cerci</u> (<u>lateral</u> tails)</strong>."
  },
  {
    "id": 200,
    "expandedCharacterList": null
  },
  {
    "id": 201,
    "expandedCharacterList": null
  },
  {
    "id": 202,
    "expandedCharacterList": null
  },
  {
    "id": 203,
    "expandedCharacterList": null
  },
  {
    "id": 204,
    "expandedCharacterList": "<u>Mesonotum</u> without anterolateral lobes of Neoephemeridae. Hind <u>wing pads</u> absent. <strong>Paired gills on abdominal segment 2 nearly square, and meeting or almost meeting <u>medially</u> (but NOT fused), at least partially covering succeeding pairs (semi-<u>operculate</u>)</strong>. Plate-like gills on abdominal segments 3–6 with fringed borders. Mature <u>larvae</u> 2–8 mm long, not including tails."
  },
  {
    "id": 205,
    "expandedCharacterList": "<u>Maxillary</u> and <u>labial</u> <u>palps</u> three-segmented. Segments 2 and 3 of <u>labial</u> <u>palps</u> about same length or 3 shorter than 2, with few long <u>setae</u> and spines. <u>Ocelli</u> without neighboring <u>tubercles</u>. All legs subequal in length. Fore<u>tibiae</u> and <u>tarsi</u> each with row of stout spines along inner margin. Outer margins of <u>operculate gills</u> fringed with long <u>setae</u>."
  },
  {
    "id": 206,
    "expandedCharacterList": "Gills on abdominal segment 1 rudimentary or absent.<strong> Abdominal segment 2 without gills</strong>. Gills on abdominal segments 3 (if present) and 4–7 have two layers: a top layer that is oval and plate-like and a bottom layer that is multi-lobed; in preserved specimens these gills lying in paired <u>dorsal</u> depressions and camouflaged, not readily seen by novices. Abdominal <u>terga</u> often with paired <u>tubercles</u>. Mature <u>larvae</u> 5–15 mm long, not including tails."
  },
  {
    "id": 207,
    "expandedCharacterList": null
  },
  {
    "id": 208,
    "expandedCharacterList": null
  },
  {
    "id": 209,
    "expandedCharacterList": "<strong><u>Maxillary</u> <u>palps</u> well developed. </strong>Fore<u>femora</u> thicker than fore<u>tibiae</u>, lacking conspicuous anterior <u>tubercles</u>, spurs, or spines, but almost always with some bristle-like or robust <u>setae</u> on top. <strong>Gills arising from posterior margins of abdominal segments 3-7. </strong>Main part of <u>ventral</u> <u>lamella</u> of each abdominal gill 6 entire, not cleft. <strong><u>Caudal</u> filaments (tails) with many interfacing fine <u>setae</u> (at least 3 or 4 on a side of each segment)</strong>."
  },
  {
    "id": 210,
    "expandedCharacterList": null
  },
  {
    "id": 211,
    "expandedCharacterList": null
  },
  {
    "id": 212,
    "expandedCharacterList": "<strong>Large tusks</strong> project forward anteriorly from the face and are visible <u>dorsally</u>, when viewed <u>laterally</u> they curve upward. <strong>Fore<u>tibiae</u> are fossorial </strong>(modified for burrowing: expanded or with <u>tubercles</u>). <strong><u>Ventral</u> <u>apex</u> of each hind <u>tibia</u> acutely pointed</strong>. <strong>Abdominal gills on segments 2–7 are conspicuous <u>dorsally</u>, forked and elongate-lancolate, with fringed margins</strong>, giving the animal a fluffy appearance."
  },
  {
    "id": 213,
    "expandedCharacterList": null
  },
  {
    "id": 214,
    "expandedCharacterList": "<strong>Frontal process of head rounded or truncate</strong>, never forked or pointed. Most antennal segments with whorls of <u>setae</u>, much longer than an antennal segment. Abdominal segment 1 with pair of small, forked, unfringed gills. "
  },
  {
    "id": 215,
    "expandedCharacterList": "<strong>Head and body dorsoventrally flattened (depressed)</strong>. Eyes and antennae positioned <u>dorsally</u>. <strong><u>Lateral</u> margins of head visible beside the eyes</strong>. Mandibles not visible from <u>dorsal</u> side. Claws much shorter than <u>tarsi</u>. <u>Tibiae</u> and <u>tarsi</u> straight. Abdominal gills on segments 2–7 variably shaped depending on genus and species."
  },
  {
    "id": 216,
    "expandedCharacterList": null
  },
  {
    "id": 217,
    "expandedCharacterList": null
  },
  {
    "id": 218,
    "expandedCharacterList": null
  },
  {
    "id": 219,
    "expandedCharacterList": "<u>Maxillary</u> <u>palps</u> rarely protrude at sides of head. Second segment of each <u>maxillary</u> palp is short and inconspicuous. <strong>Gills on abdominal segments 1–6 have truncated <u>distal</u> ends, each with at least part of <u>apical</u> edge straight</strong>. <u>Fibrilliform</u> portion of gills on abdominal segments 2–6 each with many conspicuous filaments. Gills on abdominal segments 4–6 positioned <u>laterally</u>, and usually with broad <u>lamellae</u> (flat plate-like portion of gills). <strong>Gills on abdominal segment 7 reduced to slender filaments,</strong> and <u>trachea</u> absent or with few or no <u>lateral</u> branches. Posterior end of abdomen with three well-developed tails."
  },
  {
    "id": 220,
    "expandedCharacterList": null
  },
  {
    "id": 221,
    "expandedCharacterList": null
  },
  {
    "id": 222,
    "expandedCharacterList": "<strong>The gills on abdominal segment 2 are <u>operculate</u> or semioperculate, roughly triangular or oval,</strong> <strong>and not touching or fusing <u>medially</u></strong>. Abdominal segments 3–6 with <u>lamelliform</u> (plate-like) portion of gills simple or with two lobes, never with fringed margins."
  },
  {
    "id": 223,
    "expandedCharacterList": "<strong>Head not wider than <u>pronotum</u>, without <u>frontoclypeal</u> or <u>genal</u> projections, males with small eyes. </strong>Submentum outer <u>apical</u> margins with long <u>setae</u>. <strong><u>Dorsal</u> surfaces of <u>femora</u> without <u>spatulate</u> <u>setae</u>. </strong><strong>Tarsal claws with many tiny teeth</strong> in one row along <u>basal</u> edge. <strong>Length of hind <u>femora</u> only about 1/2 to 3/4 the length of hind <u>tibiae</u> and <u>tarsi</u></strong>. <strong>Hind <u>wing pads</u> absent</strong>. <strong><u>Dorsally</u>, abdominal segments 1–6 without little spines along posterior edges</strong>."
  },
  {
    "id": 224,
    "expandedCharacterList": "Mandibular tusks absent. Gills on abdominal segment 1 with single or double <u>lamellae</u> (plates) or forked. <strong>Gills on segments 2–7 double-layered lamellate (plate-like) and terminated in filaments or points and without fringe, or oval with fringe.</strong>"
  },
  {
    "id": 225,
    "expandedCharacterList": null
  },
  {
    "id": 226,
    "expandedCharacterList": null
  },
  {
    "id": 227,
    "expandedCharacterList": "<u><strong>Labrum</strong></u> <strong>with shallow, <u>median</u> notch along <u>distal</u> margin</strong>. <strong>Abdominal gills on segments 1–7 of similar shape, forked, but those on first segment slightly smaller. </strong>Tusks absent. <u>Mesonotum</u> without anterolateral lobes of Neoephemeridae. Hind <u>wing pads</u> absent. Gills on abdominal segment 2 four-sided, and meeting or almost meeting <u>medially</u> (but NOT fused), and at least partially covering succeeding pairs (semi<u>operculate</u>). Plate-like gills on abdominal segments 3–6 with fringed borders. Mature <u>larvae</u> 2–8 mm in length, not including tails."
  },
  {
    "id": 228,
    "expandedCharacterList": null
  },
  {
    "id": 229,
    "expandedCharacterList": null
  },
  {
    "id": 230,
    "expandedCharacterList": null
  },
  {
    "id": 231,
    "expandedCharacterList": null
  },
  {
    "id": 232,
    "expandedCharacterList": null
  },
  {
    "id": 233,
    "expandedCharacterList": null
  },
  {
    "id": 234,
    "expandedCharacterList": null
  },
  {
    "id": 235,
    "expandedCharacterList": null
  },
  {
    "id": 236,
    "expandedCharacterList": "Depressed (flattened dorsoventrally), with elongate-oval shape in dorsal view. Eyes bulging from sides of head. Antennae shorter than head, usually hidden beneath eyes. Beak cylindrical and 3-segmented. Front legs <u>raptorial</u>, with <u>tibiae</u> and <u>femora</u> fitting tightly together to grasp prey. All legs flattened and equipped for <u>swimming</u>, mostly in short bursts. Pair of flat, retractile air straps in posterior end of abdomen for occasional respiration at water surface."
  },
  {
    "id": 237,
    "expandedCharacterList": null
  },
  {
    "id": 238,
    "expandedCharacterList": "Generally smaller bugs, nearly parallel-sided in <u>dorsal</u> view, slightly <u>convex</u> <u>dorsally</u>. <strong><u>Rostrum</u> (beak) uniquely triangular</strong> (not extended as slender needle). Antennae shorter than head and hidden in <u>dorsal</u> view."
  },
  {
    "id": 239,
    "expandedCharacterList": null
  },
  {
    "id": 240,
    "expandedCharacterList": "Antennae longer than head and conspicuous in <u>dorsal</u> view. If wings present, membrane without distinct, similar cells defined by wing veins. <strong>Claws of at least front <u>tarsi</u> arising before tarsal <u>apices</u>. Hind <u>femora</u> much longer than abdomen.</strong>"
  },
  {
    "id": 241,
    "expandedCharacterList": null
  },
  {
    "id": 242,
    "expandedCharacterList": "<strong>Similar in appearence to Belostomatidae (giant water bugs) except that margins of eyes are contiguous with anterior margin of head and retractile breathing straps absent from end of abdomen</strong>. Beak cylindrical and 3- or 4-segmented. Antennae shorter than head and located beneath eyes, not readily visible <u>dorsally</u>. Middle and <u>hind legs</u> with fringe like hairs, useful for swimming. <strong>Legs are <u>raptorial</u> (suitable for use in predation) with broad <u>femora</u>, and weakly <u>convex</u> <u>dorsally</u>.</strong>"
  },
  {
    "id": 243,
    "expandedCharacterList": "<strong>Similar in appearence to Belostomatidae (giant water bugs) except that margins of eyes are contiguous with anterior margin of head in Naucoridae</strong>. Beak cylindrical and 3- or 4-segmented. <u>Gula</u> present. Antennae shorter than head and located beneath eyes, not readily visible <u>dorsally</u>. Middle and <u>hind legs</u> have fringe-like hairs, useful for swimming. <strong>Legs are <u>raptorial</u>, suitable for use in predation, with broad <u>femora</u>, and weakly <u>convex</u> <u>dorsally</u>.</strong>"
  },
  {
    "id": 244,
    "expandedCharacterList": null
  },
  {
    "id": 245,
    "expandedCharacterList": null
  },
  {
    "id": 246,
    "expandedCharacterList": null
  },
  {
    "id": 247,
    "expandedCharacterList": null
  },
  {
    "id": 248,
    "expandedCharacterList": "Head with visible <u>gula</u> (suborder Heteroptera). <strong>Antennae longer than head</strong>, positioned anterior to eyes, clearly visible from <u>dorsal</u> side. <u>Dorsum</u> of head typically with <u>median</u> longitudinal <u>sulcus</u> or smooth stripe. <strong>At least front <u>tarsi</u> with ante-<u>apical</u> claws (claws protruding from leg before <u>apex</u>)</strong>. <u>Meso</u>thoracic legs about equidistant between front and <u>hind legs</u>, if NOT, then middle <u>tarsi</u> with feather-like or blade-like structures. <strong>Hind <u>femora</u> short (shorter than abdomen, or just barely longer)</strong>. <u>Laterally</u>, <u>metasternum</u> with pair of scent grooves anterior to hind <u>coxae</u>."
  },
  {
    "id": 249,
    "expandedCharacterList": null
  },
  {
    "id": 250,
    "expandedCharacterList": "<strong><u>Meso</u>thoracic <u>tarsi</u> deeply cleft, with flattened leaf-like claws, and <u>plumose</u> swimming hairs fanning from base of cleft</strong>. Hind <u>tarsi</u> each 2- or 3-segmented."
  },
  {
    "id": 251,
    "expandedCharacterList": "<u>Ventral</u> <u>prolegs</u> present on abdominal segments 3, 4, 5, 6, and 10. Segmented <u>thoracic</u> legs present. Gills sometimes present on sides of abdomen. <strong><u>Prolegs</u> with crochets (tiny hooks) in <u>transverse</u> ellipses or bands</strong>."
  },
  {
    "id": 252,
    "expandedCharacterList": "<strong>Body with <u>filamentous</u> gills, all branched.</strong>"
  },
  {
    "id": 253,
    "expandedCharacterList": "Suborder Anisoptera (i.e., dragonflies: with stout body shape, head more narrow than thorax and abdomen; end of abdomen with 5 short pointed projections, external gills absent).<strong> <u>Labial mask</u> (including its palm and pair of <u>apical</u> lobes) flat or nearly so.</strong> <u>Setae</u> absent from inside palm of <u>mask</u> (pre-mental <u>setae</u>). <u>Ligula</u> (<u>distal</u> margin of the <u>labial mask</u>) with <u>median</u> notch. <strong>Antennae usually slender or bristle-like, with 6- or 7-segments</strong>. <strong>Fore- and middle <u>tarsi</u> each 3-segmented</strong>. Mature <u>larvae</u> 31–50 mm long."
  },
  {
    "id": 254,
    "expandedCharacterList": "<strong>Lobes at <u>apical</u> end of <u>labial</u> mask squarely truncated</strong>. Head roughly trapezoidal and strongly tapered posteriorly; with posterior corners of head, though somewhat rounded, roughly forming right angles. <u>Dorsal</u> side of abdomen rounded, without a <u>median</u> ridge. <strong><u>Dorsal</u> side of abdominal segment 8 usually with conspicuous pale spot</strong>. Paraprocts (ventrolateral pair of spine-like projections at the end of the abdomen) about as long as combined length of abdominal segments 9 and 10. Epiproct (dorsomedian spine-like projection at end of abdomen) tapering to pointed or cleft <u>apex</u>."
  },
  {
    "id": 255,
    "expandedCharacterList": "Suborder Zygoptera (i.e., damselflies: as shown by slender body shape, head wider than thorax and abdomen; 3 long feather-like gills present at posterior end of abdomen). <strong>First antennal segment long, each subequal to length of rest of its antenna.</strong> <u>Labial mask</u> with deep, open, diamond-shaped, <u>median</u> cleft at <u>apex</u>. <u>Lateral</u> gills at posterior end of abdomen triangular in cross section."
  },
  {
    "id": 256,
    "expandedCharacterList": "<strong><u>Labial mask</u> with cleft reaching nearly halfway to base</strong>. Abdominal segments 9 and 10 without spines on postero<u>lateral</u> margins.<strong> <u>Lateral</u> <u>caudal</u> gills flat, not conspicuously triangular in cross-section.</strong>"
  },
  {
    "id": 257,
    "expandedCharacterList": "Zygoptera (slender body shape with head wider than thorax and abdomen, and with 3 long feather-like gills at posterior end). <strong>Antennal segment 1 much shorter than rest of its antenna</strong>. Pair of lobes at <u>distal</u> end of <u>labral</u> mask each with 0–6 setae, but attached moveable hook without <u>setae</u>.<strong> <u>Ligula</u> (<u>distal</u> part of palm of mask) usually without <u>median</u> cleft, mask roughly triangular or square</strong> (not stalked as in Lestidae). Each side of <u>median</u> line with either 0, 1, or 3–5, <u>dorsal</u> premental <u>setae</u> (hairs inside the palm of the mask). Mature <u>larvae</u> 13–25 mm long."
  },
  {
    "id": 258,
    "expandedCharacterList": "<u>Setae</u> absent from <u>dorsal</u> palm of <u>labium</u>. <strong>Lobes at end of <u>labium</u> each with 2 <u>distal</u> hooks, both pointed.</strong> <u>Caudal</u> gills at least 2/3 as broad as long, sometimes thick and triangular in cross-section near base."
  },
  {
    "id": 259,
    "expandedCharacterList": null
  },
  {
    "id": 260,
    "expandedCharacterList": null
  },
  {
    "id": 261,
    "expandedCharacterList": null
  },
  {
    "id": 262,
    "expandedCharacterList": null
  },
  {
    "id": 263,
    "expandedCharacterList": "Suborder Anisoptera (i.e., dragonflies: with stout body shape, head more narrow than thorax and abdomen; end of abdomen with 5 short pointed projections, external gills absent). <strong><u>Labial mask</u> spoon-shaped, usually with hairs inside palm of mask (<u>dorsal</u> premental <u>setae</u>) and along margins of <u>palpal</u> lobes (at end of mask)</strong>. <strong><u>Ventrally</u>, <u>median</u> groove extending from <u>basal</u> hinge of mask to about 1/3 to 1/2 way to <u>distal</u> margin of mask, often faint.</strong> <u>Distal</u> margin of each <u>palpal</u> lobe scalloped, with each <u>crenulation</u> rounded and separated by deep notches, usually ¼ to ½ as high as long, each bearing at least 1 <u>seta</u>. Frontal horn usually absent. Paraprocts (ventrolateral pair of posterior spines) usually less than twice as long as <u>cerci</u> (dorsolateral pair of posterior spines). Mature <u>larvae</u> 13-28 mm long."
  },
  {
    "id": 264,
    "expandedCharacterList": "<u>Distal</u> margin of <u>labial</u> mask scalloped, each notch shallow, so that lobes each less than half-circle. <u>Dorsal</u> midline of abdomen with well-developed <u>dorsal</u> hooks on some segments, best viewed <u>laterally</u>. <strong><u>Lateral</u> spines on abdominal segments 8 and 9, those on segment 9 at least twice as long as those on segment 8, at least as long as middorsal length of segment 9.</strong>"
  },
  {
    "id": 265,
    "expandedCharacterList": "Suborder Anisoptera (i.e., Dragonflies: stout body shape, head more narrow than thorax and abdomen, end of abdomen with 5 short pointed projections, external gills absent). <strong><u>Labial mask</u> flattened</strong>, without hair on palm of inside of mask (premental <u>setae</u>) or usually without <u>setae</u> along margins of <u>palpal</u> lobes at end of mask. <u>Ligula</u> (<u>distal</u> margin of <u>labial</u><u> mask</u>) without <u>median</u> cleft. <strong>Antennae each 4-segmented, although 4th segment usually small</strong>. Fore- and middle <u>tarsi</u> each 2 segmented. Mature <u>larvae</u> 23–40 mm long, rarely to 65 mm."
  },
  {
    "id": 266,
    "expandedCharacterList": null
  },
  {
    "id": 267,
    "expandedCharacterList": null
  },
  {
    "id": 268,
    "expandedCharacterList": null
  },
  {
    "id": 269,
    "expandedCharacterList": null
  },
  {
    "id": 270,
    "expandedCharacterList": "Suborder Anisoptera (i.e., Dragonflies: stout body shape, head more narrow than thorax and abdomen, end of abdomen with 5 short pointed projections, external gills absent). <strong><u>Labial mask</u> spoon-shaped</strong>, usually with hair inside palm of mask and along margins. <strong><u>Distal</u> margin of each <u>palpal</u> lobe regularly and finely scalloped, each scallop 1/10 to 1/6 as high as long</strong>, each bearing at least 1 <u>seta</u>, and usually separated by shallow notches.<strong> Prementum without <u>ventral</u> <u>medial</u> groove</strong> at base. Hind <u>femora</u> usually not extending to posterior margin of abdominal segment 8. Abdomen elongate in <u>dorsal</u> view. Paraprocts (ventrolateral pair of spines) usually more than twice as long as <u>cerci</u> (dorsolateral pair of spines). Mature <u>larvae</u> 8–28 mm long."
  },
  {
    "id": 271,
    "expandedCharacterList": "<strong>Anterior margin of prementum pointed in center, with straight oblique sides finely scalloped (only visible under microscope at &gt;15X); small spine-like <u>setae</u> not originating from between each scallop.</strong> <strong>Eyes raised above <u>dorsal</u> surface of head</strong>, and situated on anterior fourth of head, covering the anterior corners. Abdomen tapering to sharp point."
  },
  {
    "id": 272,
    "expandedCharacterList": null
  },
  {
    "id": 273,
    "expandedCharacterList": null
  },
  {
    "id": 274,
    "expandedCharacterList": null
  },
  {
    "id": 275,
    "expandedCharacterList": null
  },
  {
    "id": 276,
    "expandedCharacterList": null
  },
  {
    "id": 277,
    "expandedCharacterList": null
  },
  {
    "id": 278,
    "expandedCharacterList": null
  },
  {
    "id": 279,
    "expandedCharacterList": null
  },
  {
    "id": 280,
    "expandedCharacterList": null
  },
  {
    "id": 281,
    "expandedCharacterList": "Body long and slender, abdomen roughly cylindrical. <u>Paraglossae</u> and <u>glossae</u> about same length, suitable for shredding. <strong>Postmentum large, covering bases of <u>maxillae</u>. Hind <u>wing pads</u> more or less parallel with body axis, and typically longer than wide</strong>. First tarsal segment of each leg much longer than second. <strong>When extended, <u>hind legs</u> not reaching end of abdomen</strong>. Membranous <u>pleural</u> folds occur on no more than abdominal segments 1–7."
  },
  {
    "id": 282,
    "expandedCharacterList": "Body long and narrow (length greater than 8 times width). Abdomen almost completely hairless or with variable coverage of curved <u>setae</u>. Abdominal <u>terga</u> with posterior fringe of short <u>setae</u>, but last few segments with 2–4 long <u>setae</u>. <strong>Abdominal segments 1–4 divided ventrolaterally by membranous <u>pleural</u> folds that are often inconspicuous</strong>."
  },
  {
    "id": 283,
    "expandedCharacterList": "<u>Larvae</u> generally small (less than 12 mm long), robust, and hairy. <strong><u>Paraglossae</u> and <u>glossae</u> about same length</strong>, suitable for shredding. <strong>Hind <u>wing pads</u> conspicuously divergent from body axis</strong>. First tarsal segment of each leg much longer than second. <strong>When extended, <u>hind legs</u> reach beyond end of abdomen</strong>."
  },
  {
    "id": 284,
    "expandedCharacterList": "A pair of gills emerge from the cervical <u>sclerites</u>;<strong> each cervical gill has 5 or more <u>filamentous</u> branches of about the same length</strong>, and all originating at the same place on the base of the gill."
  },
  {
    "id": 285,
    "expandedCharacterList": null
  },
  {
    "id": 286,
    "expandedCharacterList": null
  },
  {
    "id": 287,
    "expandedCharacterList": "<strong><u>Paraglossae</u> and <u>glossae</u> about same length</strong>. Second tarsal segment of each leg about same length as first. <u>Wing pads</u> divergent, not parallel with body.<strong> Gills absent from <u>thoracic</u> and abdominal segments </strong>of eastern species. <u>Hind legs</u> do not reach end of abdomen.<strong> Tails are subequal to the length of abdomen or longer.</strong> <u>Thoracic</u> <u>nota</u> usually with distinct pigment pattern."
  },
  {
    "id": 288,
    "expandedCharacterList": null
  },
  {
    "id": 289,
    "expandedCharacterList": null
  },
  {
    "id": 290,
    "expandedCharacterList": "<u>Lacinia</u> usually each with two <u>apical</u> teeth, mesal tooth shorter and inner margin of <u>lacinia</u> without low knob. <strong>Abdomen often with dark longitudinal pigment bands</strong>. If abdominal pigment bands absent, triangular region among 3 <u>ocelli</u> completely covered by dark pigment, <u>occiput</u> (posterodorsal region of head) without pair of oval markings bordered by short thick <u>setae</u> and <u>occiput</u> and/or <u>pro</u>thoracic margin with <u>transverse</u> row of short stout <u>setae</u>, submental gills absent or barely projecting beyond sides of submentum, <u>mesosternal</u> Y-arms meeting or approaching posterior corners of furcal pits and no other <u>sutures</u> between furcal pits, and <u>femora</u> or <u>tibiae</u> or both with fringes of long <u>setae</u>.<br />\n "
  },
  {
    "id": 291,
    "expandedCharacterList": null
  },
  {
    "id": 292,
    "expandedCharacterList": null
  },
  {
    "id": 293,
    "expandedCharacterList": null
  },
  {
    "id": 294,
    "expandedCharacterList": null
  },
  {
    "id": 295,
    "expandedCharacterList": null
  },
  {
    "id": 296,
    "expandedCharacterList": null
  },
  {
    "id": 297,
    "expandedCharacterList": null
  },
  {
    "id": 298,
    "expandedCharacterList": null
  },
  {
    "id": 299,
    "expandedCharacterList": null
  },
  {
    "id": 300,
    "expandedCharacterList": null
  },
  {
    "id": 301,
    "expandedCharacterList": null
  },
  {
    "id": 302,
    "expandedCharacterList": null
  },
  {
    "id": 303,
    "expandedCharacterList": null
  },
  {
    "id": 304,
    "expandedCharacterList": null
  },
  {
    "id": 305,
    "expandedCharacterList": null
  },
  {
    "id": 306,
    "expandedCharacterList": "<strong>Large <u>spinneret</u>, half as long as head</strong>. <u>Labrum</u> <u>sclerotized</u>, never withdrawn or T-shaped. Antenna tiny and inconspicuous. <u>Pronotum</u> without anterolateral lobes. <strong><u>Meso-</u> and <u>metanota</u> membranous with large hump between them</strong>. <strong><u>Tarsi</u> flattened and longer than <u>tibiae</u>.</strong> Abdominal <u>tergum</u> IX without <u>sclerite</u>. <u>Larvae</u> <strong>living in branching tube-like retreats</strong> buried in sand or soft sediment, except tips of branches sticking above sediment."
  },
  {
    "id": 307,
    "expandedCharacterList": "Because <em>Phylocentropus </em>is the only genus in the family Dipsudopsidae, the genus-level and family-level diagnostic characters are the same."
  },
  {
    "id": 308,
    "expandedCharacterList": null
  },
  {
    "id": 309,
    "expandedCharacterList": null
  },
  {
    "id": 310,
    "expandedCharacterList": null
  },
  {
    "id": 311,
    "expandedCharacterList": null
  },
  {
    "id": 312,
    "expandedCharacterList": null
  },
  {
    "id": 313,
    "expandedCharacterList": null
  },
  {
    "id": 314,
    "expandedCharacterList": null
  },
  {
    "id": 315,
    "expandedCharacterList": null
  },
  {
    "id": 316,
    "expandedCharacterList": "<u>Labrum</u> usually with only 6 <u>setae</u> arranged <u>transversely</u> across central area. <strong>Antennae small, always situated directly next to eyes</strong>. <u>Pronotum</u> and <u>mesonotum</u> <u>sclerotized</u>. <u>Pronotum</u> sometimes with distinct lobes at anterior corners. <u>Metanotum</u> mostly membranous; pair of anteromesal (<u>sa1</u>) <u>sclerites</u> <u>dorsally</u> with several <u>setae</u>, but each always with at least 1 <u>seta</u>. <u>Lateral</u> humps always present on abdominal segment I, but not always conspicuous. <strong><u>Median</u> <u>dorsal</u> hump absent from abdominal segment I.</strong> <u>Larval</u> cases varying in architecture and materials. "
  },
  {
    "id": 317,
    "expandedCharacterList": "Antero<u>ventral apotome</u> subequal to or longer than posteroventral <u>ecdysial</u><u> line</u> separating <u>genae</u>. <strong><u>Larval</u> case usually rectangular in cross section, constructed of rectangular pieces of leaves or bark</strong>, pieces may be in varying shapes or case may be of sand grains."
  },
  {
    "id": 318,
    "expandedCharacterList": "<strong>Antennae usually long for caddisflies, at least 6 times as long as thick</strong>. <u>Mesonotum</u> light in color, <strong>except sometimes with pair of dark curved lines; these lines present in species with short antennae</strong>. <u>Metanotum</u> membranous. <u>Larvae</u> constructing portable tube-shaped cases of various materials and shapes."
  },
  {
    "id": 319,
    "expandedCharacterList": "<u>Maxillary</u> <u>palps</u> extend little past <u>labrum</u>. Mandibles short and wide, with teeth clustered near <u>apices</u>. <strong><u>Mesonotum</u> with pair of dark, reverse parenthesis</strong> (<u>concave</u> <u>laterally</u>); abdomen broad <u>basally</u> but tapering toward <u>apex</u>. <u>Meso</u>thoracic legs with slightly curved and slender tarsal claws. <u>Tarsi</u> straight. Anal opening sometimes with patches of spines or hair. Abdominal gills clustered in groups of 2 or more. Cases of various shapes and materials, sometimes with spicules and pieces of freshwater sponges. "
  },
  {
    "id": 320,
    "expandedCharacterList": null
  },
  {
    "id": 321,
    "expandedCharacterList": null
  },
  {
    "id": 322,
    "expandedCharacterList": null
  },
  {
    "id": 323,
    "expandedCharacterList": null
  },
  {
    "id": 324,
    "expandedCharacterList": null
  },
  {
    "id": 325,
    "expandedCharacterList": null
  },
  {
    "id": 326,
    "expandedCharacterList": null
  },
  {
    "id": 327,
    "expandedCharacterList": "<strong><u>Labrum</u> membranous and T-shaped</strong>, in preserved specimens often sucked into mouth and hidden from view. Antennae small, nub-like, and inconspicuous. <u>Pronotum</u> <u>sclerotized</u>, but without anterolateral lobes. <u>Meso-</u> and <u>metanota</u> membranous. Abdominal <u>tergum</u> 9 entirely membranous. <u>Larvae</u> spinning stationary sac-shaped silken nets for filter feeding on undersides of rocks."
  },
  {
    "id": 328,
    "expandedCharacterList": "<strong><u>Frontoclypeus</u> with conspicuous, jagged asymmetrical notch on anterior margin</strong>. <strong><u>Seta</u> no. 18 on <u>ventral</u> surface of head positioned level with posterior point of <u>ventral apotome</u></strong>. <u>Foretrochantins</u> small and barely projecting away from body. <strong>Long, slender, <u>setae</u>-bearing process positioned sub<u>apically</u> on each <u>pro</u>thoracic <u>coxa</u></strong>."
  },
  {
    "id": 329,
    "expandedCharacterList": null
  },
  {
    "id": 330,
    "expandedCharacterList": null
  },
  {
    "id": 331,
    "expandedCharacterList": null
  },
  {
    "id": 332,
    "expandedCharacterList": null
  },
  {
    "id": 333,
    "expandedCharacterList": null
  },
  {
    "id": 334,
    "expandedCharacterList": null
  },
  {
    "id": 335,
    "expandedCharacterList": "Antennae small, nub-like, and inconspicuous.<strong> <u>Foretrochantin</u> broad and hatched-shaped. </strong><u>Meso-</u> and <u>metanota</u> membranous. Abdominal <u>tergum</u> IX membranous. <u>Larvae</u> creating stationary retreats composed of sand and detritus, usually built on rocks or large woody debris."
  },
  {
    "id": 336,
    "expandedCharacterList": null
  },
  {
    "id": 337,
    "expandedCharacterList": "On the head, when looking <u>ventrally</u>, <strong><u>labium</u> with pair of <u>sclerites</u> each longer than broad</strong>. <strong>Teeth absent along <u>concave</u>, <u>ventral</u> edge of each anal claw</strong>. <u>Larvae</u> constructing silken tubular cases, covered in sand, usually several millimeters in length, and found on rocks."
  },
  {
    "id": 338,
    "expandedCharacterList": "Antenna small and inconspicuous. <u>Pronotum</u> without lobes in anterior corners.<strong> <u>Meso-</u> and <u>metanota</u> membranous. </strong><u>Metanotum</u> with <u>lateral</u> setal areas (<u>sa3</u>) each with only a single <u>seta</u>, with or without a <u>sclerite</u>. <strong>Abdominal <u>tergum</u> IX with a <u>sclerite</u>,</strong> sometimes inconspicuous or retracted under intersegmental fold of abdominal <u>tergum</u> VIII. <strong><u>Anal prolegs</u> free,</strong> not closely fused to segment IX. Anal claw without <u>dorsal</u> <u>accessory</u> hook; however, sometimes with a secondary <u>lateral</u> claw and sometimes with <u>ventral</u> teeth.<strong> <u>Larvae</u> are free-living until pupation.</strong>"
  },
  {
    "id": 339,
    "expandedCharacterList": "<em>Rhyacophila </em>is the only genus from the family Rhyacophilidae in the United States east of the Rocky Mountains, so family-level and genus-level diagnostic characters are the same except eastern species lack <u>filamentous</u> gills. Mature <em>Rhyacophila</em> <u>larvae</u> are less than 25 mm (1 inch) long. Widespread."
  },
  {
    "id": 340,
    "expandedCharacterList": null
  },
  {
    "id": 341,
    "expandedCharacterList": null
  },
  {
    "id": 342,
    "expandedCharacterList": "Antennae small, nub-like, and inconspicuous, positioned approximately equidistant between anterior margin of head and eyes.<strong> <u>Pro-</u> and <u>mesonota</u> <u>sclerotized</u>, but <u>metanotum</u> mostly membranous, with some small <u>sclerites</u>.</strong> <u>Pronotum</u> broadest at middle when viewed <u>dorsally</u>. <u>Prosternal</u> horn usually present, sometimes short. <strong><u>Mesonotum</u> with double notch <u>medially</u> along anterior margin</strong>. <u>Metanotal</u> anteromesal setal areas (<u>sa1</u>) each usually with tiny <u>sclerite</u> and 1 or 2 <u>setae</u>. First abdominal segment always with <u>lateral</u> humps and <u>median</u> <u>dorsal</u> hump. At least some abdominal segments with chloride epithelia (each evident as oval area surrounded by very fine dark line). <u>Larvae</u> building stout cases from pieces of rock, usually with small ballast stones arranged along sides. "
  },
  {
    "id": 343,
    "expandedCharacterList": "<u>Pronotum</u> without prominent longitudinal ridges as seen in western <em>Oligophlebodes</em>. <strong>Pair of small notches present <u>medially</u> along anterior margin of <u>mesonotum</u></strong>. <u>Larvae</u> constructing stout coarse rock cases, often with several small ballast stones attached <u>laterally</u>."
  },
  {
    "id": 344,
    "expandedCharacterList": null
  },
  {
    "id": 345,
    "expandedCharacterList": null
  },
  {
    "id": 346,
    "expandedCharacterList": "<strong><u>Palpal</u> lobes (<u>distal</u> end of <u>labial</u><u> mask</u>) rounded, without <u>apical</u> hooks and usually bearing only microscopic teeth on inner margins.</strong> <strong>Large antennal segment 3 nearly oval, inner margin <u>convex</u>, </strong>about 2/3 as wide as long, widest in proximal half. Antennal segment 4 small, rounded, knob-like, much less that 1/4 as long as segment 3. Middle legs not closer together at base than <u>forelegs</u>. Fore- and middle legs usually with at least vestigial burrowing hooks on <u>tibiae</u>. <strong><u>Wing pads</u> parallel along midline.</strong> Abdomen much longer than broad, not flat (as in <em>Hagenius</em>). Middorsal hooks/knobs absent from abdominal segments. Abdominal segment 7 without <u>lateral</u> spines, segments 8 and 9 with very short <u>lateral</u> spines. <strong><u>Distal</u> margin of prementum usually with 4 <u>denticles</u></strong>; sides of prementum parallel toward base. Abdominal segment 9 with long, slender, claw-like <u>lateral</u> spines. Abdominal segment 10 much less than twice as long as any preceding segment."
  },
  {
    "id": 347,
    "expandedCharacterList": null
  },
  {
    "id": 348,
    "expandedCharacterList": "The larvae may be 5-70 mm in length. The legs are each 5 segmented, excluding the pair of claws on each tarsus. The abdomen is 8 segmented, usually does not have gills, and lacks hooks on the terminal segment. The cerci are usually slender and longer than abdominal segment 1, however, if stout, short, inconspicuous, or absent, then with the following characters: a roughly cylindrical thorax and abdomen; long slender swimming legs; sickle-shaped mandibles without a large molar."
  },
  {
    "id": 349,
    "expandedCharacterList": "The head is NOT produced as a beak as in Curculionidae. The terminal segment of each antenna is no longer than the combined length of the 2 preceding segments; they can be filiform, or the apical segments are sometimes fused into a globular or elongate clubs. The compound eyes are NOT divided as in Gyrinidae. The notopleural sutures (ventrally, a line near the lateral margin of the prothorax) are almost always absent. The elytra cover the whole abdomen or expose only part of one abdominal tergite. Hind coxae not extending posteriorly to divide abdominal sternite 1, and never expanded as large plates. The tarsal formula is 5-5-5; the last tarsal segment of each leg is usually long, with big claws. The abdomen has 5–6 visible segments."
  },
  {
    "id": 350,
    "expandedCharacterList": "The legs each have 5 segments plus 2 tarsal claws.<strong> Lateral gills are present on abdominal segments 1-9. Abdominal segment 10 has 2 pairs of stout hooks.</strong>"
  },
  {
    "id": 351,
    "expandedCharacterList": "This family includes over 70 North American Species. Both the larvae and adults of this family are aquatic, they can be found in lentic-littoral habitats, but some species can be found in lotic-depositional habitats as well. They are good climbers among the rooted plants found in their habitats, adults can be strong swimmers as well. Both life stages have similar feeding habits, they tend to be shredding or piercing herbivores, but some are engulfing predators. The larvae sometimes overwinter in moist soil before molting into adults. The adults must frequently resurface for air, however the larvae get all of their oxygen from the water."
  },
  {
    "id": 352,
    "expandedCharacterList": "Hydrophilidae is the second largest family of North American aquatic beetles, including roughly 200 species. The larvae and adults are aquatic or semiaquatic; the pupae are terrestrial. They prefer lentic waters such as ponds and shallow lakes, or sometimes in pools at edges of streams. Unlike most beetles, the adults of this family tend to swim by alternating strokes with their hind legs, rather than moving them in unison. Also atypical, they have a habit of surfacing for air head first. The adults have a well-developed plastron to hold air underwater, in well oxygenated water it serves as a gill. Larvae frequently surface to take in air from the end of the abdomen. Larvae are usually predators of other invertebrates, and can even break snail shells with their strong jaws. However, only a small number of adults are predators, most are omnivores or detritivores."
  },
  {
    "id": 537,
    "expandedCharacterList": "External sclerotized portions of head absent, leaving only internal skeleton. Integument of posterior abdominal segments covered with setae or spinules or seta-bearing tubercles on some segments. Anal division somewhat tapered, usually ending in one or two elongate retractile respiratory tubes lacking dorsal tubercles, with spiracular plates distinctly separated."
  },
  {
    "id": 727,
    "expandedCharacterList": "<u>Larvae</u>:<strong> Usually without <u>lateral</u> abdominal gills</strong>. If gills present, then 4 hooks clustered on segment 10. <strong><u>Thoracic</u> legs each usually with 4 or 5 segments and with 1 or 2 claws</strong>; if without legs, head distinctly <u>sclerotized</u> and posterior body (thorax and abdomen) simple, without gills, hair brushes, suckers, or breathing tube.<strong> Eye spots usually present</strong>, but <u>compound eyes</u> absent."
  },
  {
    "id": 728,
    "expandedCharacterList": "<u>Larvae</u> approximately 5–70 mm long. <strong>Sickle-shaped mandibles</strong> without <u>mola</u> (grinding surface). Long, slender swimming legs <strong>5-segmented, excluding 2 claws</strong>.<strong> Abdomen 8-segmented</strong>, lacking hooks on terminal segment, usually without gills. Roughly cylindrical thorax and abdomen tapered to anterior and posterior ends. <u>Cerci</u> (<u>urogomphi</u>) usually 2-segmented, slender and longer than abdominal segment 1, but can be stout, short, inconspicuous, or absent. "
  },
  {
    "id": 729,
    "expandedCharacterList": "Mandibles without large and distinct teeth along inner margins. <u>Maxillary</u> galea finger-like. <u>Urogomphi</u> each usually 2-segmented. <u>Tibiae</u> and <u>tarsi</u> with or without <u>swimming</u> hairs."
  },
  {
    "id": 732,
    "expandedCharacterList": "<u>Labrum</u> and <u>clypeus</u> separated by distinct <u>suture</u>. Antennae 2–3 segmented. Head with <u>ocelli</u> in groups of 5. Legs adapted for walking, sometimes small, each 3–4 segmented and with single claw. <u>Thoracic</u> tergites clearly defined. Abdomen 9-segmented, <u>ventral</u> gills absent from segments 1–8.<strong> Segment 9 (posterior-most segment) with <u>ventral</u> lid-like flap (<u>operculum</u>) concealing thread-like gills and pair of hooks</strong>. <strong>Body strongly <u>sclerotized</u> (hardened), dark brown or red-brown, roughly cylindrical or spindle-shaped,</strong> with head and legs visible in <u>dorsal</u> view."
  },
  {
    "id": 733,
    "expandedCharacterList": "<strong><u>Pro</u>thorax with <u>lateral</u> postpleurites each composed of two parts, without posterior sternum</strong>. <strong><u>Meso</u>pleuron composted of one part</strong>. Abdominal <u>terga</u> without <u>median</u> and sub<u>lateral</u> humps or small <u>median</u> humps present, <strong><u>pleura</u> present on segments I-VII</strong>."
  },
  {
    "id": 739,
    "expandedCharacterList": "<strong>Legs 5-segmented plus 2 tarsal claws. Abdominal segments 1–9 with <u>lateral</u> gills. Abdominal segment 10 (posterior-most segment) with 4 stout hooks.</strong>"
  },
  {
    "id": 740,
    "expandedCharacterList": "<strong><u>Nasale</u> (anterior most margin of the face) with 2-4 teeth measly along margin</strong>. Head elongate, with the <strong><u>collum</u> (neck) nearly as wide as rest of head</strong>."
  },
  {
    "id": 743,
    "expandedCharacterList": "Mandibles with groove along the internal margin. <strong>Legs 5-segmented and with single claw</strong>. <strong>Mature <u>larvae</u> usually with long, slender, stiff, needle-like <u>dorsal</u> projections from <u>thoracic</u> and abdominal segments.</strong> Abdomen 9–10 segmented; hooks absent from terminal segments."
  },
  {
    "id": 744,
    "expandedCharacterList": "<strong>Body segments each with 2 or more erect, segmented, hollow, spine-tipped filaments half as long as body</strong>. <u>Forelegs</u> designed for grasping plants and prey."
  },
  {
    "id": 745,
    "expandedCharacterList": "Each mandible with 1 to 3 teeth along inner margin. <strong><u>Labrum</u> and <u>clypeus</u> not separated by distinct <u>suture</u></strong>. Antennae each 2- or 3-segmented. Head with simple-eyes in groups of 5. <strong>Legs each 3- or 4-segmented, with single claw</strong>; legs adapted for walking, sometimes small. <u>Thoracic</u> tergites clearly defined. Abdominal tergites without <u>dorsal</u> lobes. <strong>Abdomen usually 8-segmented</strong>. Body roughly cylindrical or spindle-shaped, not markedly thick. Head and legs visible in <u>dorsal</u> view."
  },
  {
    "id": 746,
    "expandedCharacterList": "<strong>Head subquadrangular or subrectangular</strong>; frontal <u>sulci</u> V-shaped. <strong>Antennae further than mandibles from antero<u>lateral</u> angles of head</strong>; uniramal, without finger-like antennal appendage. <u>Apex</u> of <u>ligula</u> not bifid. <u>Pronotum</u> entirely <u>sclerotized</u>. Mentum with sides almost straight, its antero<u>lateral</u> angles very prominent. <strong><u>Mesonotal</u> and <u>metanotal</u> <u>sclerites</u> much reduced, triangular</strong>. <u>Femora</u> each with fringe of long swimming hairs. Eight complete abdominal segments, with segments IX and X reduced and forming stigmatic atrium or cavity. <strong>One pair of rudimentary, <u>tubercular</u>, <u>lateral</u> gills on each abdominal segment, each with several terminal <u>setae</u></strong>, those of segment IX short."
  },
  {
    "id": 747,
    "expandedCharacterList": "Short 2–3 segmented antenna. <u>Labrum</u> and <u>clypeus</u> separated by <u>suture</u>. Legs (visible <u>ventrally</u>) 3–4 segmented with only single tarsal claw, suitable for walking. Abdomen 9-segmented. Abdominal tergites without <u>dorsal</u> lobes.<strong> Body dorsoventrally flattened, with <u>thoracic</u> and abdominal tergites expanded <u>laterally</u>, collectively forming thin shield covering head and legs from above</strong>."
  },
  {
    "id": 748,
    "expandedCharacterList": "<strong><u>Ventrally</u>, abdomen with 5 paired tufts of thread-like gills.</strong> <u>Lateral</u> expansions of each abdominal segment fitting together tightly at margin, but segment 8 without <u>lateral</u> expansions. Abdominal segment 9 without small <u>ventral</u> flap-like lid (<u>operculum</u>) closing <u>caudal</u> chamber."
  },
  {
    "id": 751,
    "expandedCharacterList": null
  },
  {
    "id": 752,
    "expandedCharacterList": null
  },
  {
    "id": 753,
    "expandedCharacterList": null
  },
  {
    "id": 754,
    "expandedCharacterList": null
  },
  {
    "id": 755,
    "expandedCharacterList": null
  },
  {
    "id": 756,
    "expandedCharacterList": null
  },
  {
    "id": 757,
    "expandedCharacterList": null
  },
  {
    "id": 758,
    "expandedCharacterList": "Mandibles with large and distinct teeth along inner margins. <u>Maxillary</u> galea hooked. <u>Urogomphi</u> each 1-segmented. <u>Tibiae</u> and <u>tarsi</u> without <u>swimming</u> hairs."
  },
  {
    "id": 761,
    "expandedCharacterList": null
  },
  {
    "id": 764,
    "expandedCharacterList": null
  },
  {
    "id": 767,
    "expandedCharacterList": null
  },
  {
    "id": 770,
    "expandedCharacterList": null
  },
  {
    "id": 773,
    "expandedCharacterList": null
  },
  {
    "id": 776,
    "expandedCharacterList": null
  },
  {
    "id": 779,
    "expandedCharacterList": null
  },
  {
    "id": 782,
    "expandedCharacterList": null
  },
  {
    "id": 783,
    "expandedCharacterList": null
  },
  {
    "id": 784,
    "expandedCharacterList": null
  },
  {
    "id": 787,
    "expandedCharacterList": null
  }
]