[
  {
    "id": 1,
    "description": null
  },
  {
    "id": 2,
    "description": null
  },
  {
    "id": 3,
    "description": "Stoneflies include over 3,500 species globally. They’re <u>hemimetabolous</u>, lacking a pupal stage. Eggs and <u>larvae</u> are aquatic, and most adults are terrestrial. <u>Larvae</u> are typically found in cold, clean streams, such that presence of <u>larvae</u> is indicative of good water quality. <u>Larvae</u> sometimes diapause (similar to hibernation), especially if living in an intermittent stream, where water levels may drop very low. There is a wide range of feeding strategies among the different species, but most start as <u>collecting-gatherers</u> and shift to <u>shredding-detritivores</u> or omnivorous-predators. Microhabitats where they live can be very specific as each genus is adapted to particular environmental conditions. Unlike mayfly <u>larvae</u>, stonefly <u>larvae</u> have two claws per foot, never have gills on the top of the abdomen, and never have more than two <u>cerci</u> (tails). Adults rarely fly far from the <u>larval</u> habitat."
  },
  {
    "id": 4,
    "description": "This is the world's most species-rich stonefly family including 84 North America species and almost 1,000 worldwide. The generally black-and-yellow-striped <u>larvae</u> are often found <u>clinging</u> to substrate in riffles and other <u>lotic-erosional</u> habitats. Young <u>larvae</u> tend to <u>collect and gather</u> small amounts of food until they are large enough to <u>engulf</u> their prey, including caddisflies, midges, and other small invertebrates. Some of the <u>larvae</u> are territorial, swinging their <u>cerci</u> (tails) at other animals that get too close. If not enough oxygen is present in the water, they can be seen doing strange push-up-like movements in order to move more water across the gills. A life cycle can require from 1–3 years, depending on environmental conditions. They emerge as flying adults in spring and summer, and can often be drawn to lights at night."
  },
  {
    "id": 5,
    "description": "At least 18 species of <em>Acroneuria </em>occur in North America, living in small streams to large rivers. Mature <u>larvae</u> are <u>engulfing predators</u>, feeding mainly on Chironomidae (Diptera), Ephemeroptera, Plecoptera, and Trichoptera. Adults are unusually vagile, capable of flying long distances, so that they are widely distributed. This is a genus that is often imitated as wet or dry artificial flies by fly fishers."
  },
  {
    "id": 6,
    "description": "<u>Larvae</u> are usually found in <u>lotic-erosional</u> habitats with coarse sediments, debris accumulations, <u>leaf packs</u>, and in quieter water at the edges of streams, and also are frequently found in large rivers. <u>Larvae</u> can be difficult to spot as they are often slow-moving and covered in debris. Similar to other shredders, these <u>larvae</u> have <u>paraglossae</u> and <u>glossae</u> about the same length. These <u>larvae</u> can be easily confused with Nemouridae as they both have <u>wing pads</u> divergent (not parallel with the body axis) but can be distinguished because the second tarsal segment of each leg of Taeniopterygidae is about the same length as the first."
  },
  {
    "id": 7,
    "description": "The genus Taeniopteryx includes 11 known North American species. <u>Larvae</u> can be found in very diverse habitats ranging from cool or warm springs, rock or sand-bottomed streams, and sometimes even in intermittent streams; usually they are in fast water, but sometimes in depositional areas at stream margins. Typically they are <u>clingers</u> and <u>sprawlers</u> in coarse sediments, wood, <u>leaf packs</u>, or other debris. Sometimes they allow algae, fungus, and other debris to build up on their back to aid in camouflage, giving them a dirty appearance."
  },
  {
    "id": 10,
    "description": "Always with two tarsal claws per leg."
  },
  {
    "id": 11,
    "description": "foot, most distal leg region (last part of a leg before the claw), often divided into subsegments. Plural form is tarsi."
  },
  {
    "id": 12,
    "description": "Always only two tails (cerci)."
  },
  {
    "id": 13,
    "description": "pair of tails"
  },
  {
    "id": 14,
    "description": "Caddisflies constitute the 7th largest order of insects, with over 16,000 species globally and 1.887 species in North America. They’re holometabolous, having egg, <u>larval</u>, pupal, and adult life stages. They spend most of their lives as <u>larvae</u> and can be found in almost all freshwater habitats. Collectively the species of the order are ecologically diverse. Different species are <u>scrapers</u>, detritivores, herbivores, <u>filterers</u>, and predators. Most <u>larvae</u> construct portable tube-like cases or fixed retreats, although some are free-living. The cases and retreats are made from rock or plant fragments glued together with silk from their mouth. Both cases and retreats are used for camouflage and physical protection as well as for improving efficiency of respiration by channeling oxygenated water across the undulating animal. <u>Larvae</u> can be identified by the usually-inconspicuous antennae and the pair of <u>anal prolegs</u> each bearing a single hook."
  },
  {
    "id": 15,
    "description": "Larvae with pair of anal prolegs (fleshy nubs), each with single hook, located on last abdominal segment."
  },
  {
    "id": 16,
    "description": "Larvae can be free-living, in fixed retreats, or in cases made of sand, rocks, or plant material."
  },
  {
    "id": 17,
    "description": "fleshy unsegmented nub, often paired, used for movement (e.g., on the abdomen of most caterpillars and some flies; on the thorax of some fly larvae)."
  },
  {
    "id": 18,
    "description": "There are 47 genera in the family globally, with about 13 found in the US, including more than 155 species. <u>Larvae</u> build stationary retreats of silk, detritus and rock fragments. A part of the entrance of a retreat has a silken filter net protruding into the current to strain food from the water. This is how they earned the common name, “net spinners”. The mesh size of the filter net varies among hydropsychid species, corresponding with the current speed of their optimal habitat and the size of the food particles on which they specialize. They spend most of their life hiding in their retreats, waiting for food to get caught in their nets, mostly tiny bits of organic debris, but occasionally small animals; they sometimes also <u>scrape</u> algae from the surfaces of the rocks or other substrates to which their retreats are attached. Members of this family are often thought to be tolerant of pollution, but this is a misconception as tolerance varies greatly among the different species."
  },
  {
    "id": 19,
    "description": "This common and widespread genus includes more than 40 species in North America. Like other members of the Hydropsychidae, they build fixed retreats with attached nets for filter feeding. Food includes algae, detritus, and some small invertebrate animals. They prefer streams with lots of riffles, especially warmer streams and rivers. Physically, they are similar in appearance to other hydropsychids, but can be distinguished because their <u>frontoclypeus</u> is usually notched; if it isn’t, the pair of intersegmental <u>sclerites</u> behind the <u>prosternum</u> are small, or both of these characters are usually present. "
  },
  {
    "id": 20,
    "description": "Mayflies, with over 3,400 species, make up one of the oldest orders of insects, with the first fossils dating to about 275 million years ago. They are <u>hemimetabolous</u>, without a pupal stage; however, they are unique in that they have a <u>subimago</u> stage, an extra life stage between the <u>larva</u> and the adult in which the insect has wings, but is still sexually immature. Most of their life is spent as aquatic <u>larvae</u> and most species spend only a few hours to no more than 3 days as flying adults. Different families and genera can be found in a variety of flowing-water and some still-water habitats. They can be <u>burrowers</u> in loose sediments, flat-bodied sprawlers on rocks, or fish-like and very streamlined in shape, making good swimmers. <u>Larvae</u> can be easily identified by having only a single claw on each foot, gills on the top or sides of the abdomen, and the presence of two or three slender tails."
  },
  {
    "id": 21,
    "description": "Usually with three tails (two cerci and one caudal filament, but sometimes without caudal filament)."
  },
  {
    "id": 22,
    "description": "Always with only one tarsal claw per leg."
  },
  {
    "id": 23,
    "description": "tail, when there is only one, or the middle tail when there are three (the other two being cerci)."
  },
  {
    "id": 24,
    "description": "Pro-, meso-, and metanota entirely covered by sclerites (i.e. the dorsal side of all 3 thoracic segments is hardened)."
  },
  {
    "id": 25,
    "description": "Abdomen with rows of branched gills ventrally."
  },
  {
    "id": 26,
    "description": "Base of each anal proleg (fleshy nubs at end of body) with conspicuous tuft or fan of long hairs ."
  },
  {
    "id": 27,
    "description": "Larvae build stationary retreats of silk, detritus and rock fragments, often used for filter feeding. These usually fall apart when removed from the water, but you may see some rements when flping over rocks to search for larvae, it will look like a clup of loose slime (silk) and small rock pieces."
  },
  {
    "id": 28,
    "description": "dorsal (top) side of a given thoracic segment. Plural form is nota."
  },
  {
    "id": 29,
    "description": "Frontoclypeus is usually notched, and usually with a scalloped appearance. In the rare case that the frontoclypeus is not notched, the intersegmental sclerites will be small. "
  },
  {
    "id": 30,
    "description": "These sclerites are usually small in this genus. In the rare case that they are large, the frontoclypeus will be notched. Look for the pair of intersegmental sclerites underneath the intersegmental fold (“fat roll” between segments) on the ventral side between the first two sets of legs. Try gently arching the specimen’s back, and they should “pop” out.  "
  },
  {
    "id": 31,
    "description": "<em>Isonychia </em>is the only genus in the family Isonychiidae. There are about 15 known North American species. They have a widespread distribution east of the Rocky Mountains, and tend to be found <u>swimming</u> in fast-flowing water. They have a <u>fusiform</u>, minnow-like body shape, making them strong <u>swimmers</u> and <u>clingers</u>. Long <u>setae</u> (hair) on the inner margins of the <u>femora</u> and <u>tibia</u> of <u>forelegs</u> are used for filter feeding, a trait almost unique to this group of mayflies (also occurring in the rare family Oligoneuriidae). They are important in the trout and fly fishing community as \"Slate Drakes\" due to their frequent but periodic hatches (emergence of <u>subimagos</u> or \"<u>duns</u>\") and return to the water surface as spent adults (<u>imagoes</u> or \"<u>spinners</u>\") in June–October."
  },
  {
    "id": 32,
    "description": "<em>Isonychia </em>is the only genus in the family Isonychiidae. There are about 15 known North American species. They have a widespread distribution east of the Rocky Mountains, and tend to be found swimming in fast flowing water. They have a <u>fusiform</u>, minnow-like body shape, making them strong <u>swimmers</u> and <u>clingers</u>. Long <u>setae</u> (hair) on the inner margins of the <u>femora</u> and <u>tibia</u> of <u>forelegs</u> are used for filter feeding, a trait unique to this group of mayflies. They are important in the trout and fly fishing community due to their frequent but periodic hatches (emergence of <u>subimagos</u>) in June–October.    "
  },
  {
    "id": 33,
    "description": "This is one of the more diverse familes in northern latitudes, including 252 species in 41 genera in North America. Only a few species of this group live in the Midwest and South, which is why they are often called \"Northern Caddisflies.\" They can be found in a variety of <u>lotic</u> and <u>lentic</u> habitats and have varying habits which become more specific at the genus and species levels of taxonomic refinement. Most are <u>shredding</u> or <u>scraping</u> herbivores or <u>detritivores</u>. This group is well known for their diversity in cases materials and architecture, which at the genus or species level can often be used to aid in identification."
  },
  {
    "id": 34,
    "description": "As in all families of superfamily Limnephiloidea, the short, inconspicuous antennae are each located about midway between the base of the mandible and the eye. "
  },
  {
    "id": 35,
    "description": "<em>Pycnopsyche </em>includes about 18 species, mostly from eastern North America. <u>Larvae</u> can be relatively large, up to 29 mm. The case may be made of plant or rock material, often a combination of the two. Species in this genus tend to prefer cool shaded streams, or small rivers, typically in wooded areas. <u>Larvae</u> are <u>scrapers</u> and <u>shredding detritivores</u>, ecologically important for breaking down leaf litter in the stream throughout the fall and winter. <u>Larvae</u> can be identified by the following characters: abdominal segment I with one tall vertical tear-drop-shaped <u>sclerite</u> at posterior edge of base of each <u>lateral</u> hump, almost as tall as hump. Abdominal gills mostly single. Chloride epithelia, each recognizable as oval region outlined with very fine dark line, are present only on abdominal sterna III–VII."
  },
  {
    "id": 36,
    "description": "Abdominal segment I with one tall vertical tear-drop-shaped sclerite at posterior edge of base of each lateral hump, almost as tall as hump. The sclerite is not necessarily symmetrical, but is narrower at one end than the other, like a tear-drop. It may be light in color and hard to see, look for a shiny surface. "
  },
  {
    "id": 37,
    "description": "Paraglossae and Glossae extend to about the same length. This type of arrangement is associated with shredders."
  },
  {
    "id": 38,
    "description": "The first and second segment of the tarsus on all legs are the same length. The tarsus is the, most distal leg region (last part of a leg before the claw), often divided into subsegments. When counting tarsal segments, start with the semgent closest to the body. "
  },
  {
    "id": 39,
    "description": "Wingpads are not parallel with body, angled away from the midline of the body."
  },
  {
    "id": 40,
    "description": "Each coxa (most basal leg segment) with a single finger-like, segmented gill."
  },
  {
    "id": 41,
    "description": "Each coxa (most basal leg segment) with a single finger-like, segmented gill."
  },
  {
    "id": 43,
    "description": "Each coxa (most basal leg segment) with a single finger-like, segmented gill."
  },
  {
    "id": 44,
    "description": "Paraglossae and Glossae extend to about the same length. This type of arrangement is associated with shredders."
  },
  {
    "id": 45,
    "description": "The tarsus is the, most distal leg region (last part of a leg before the claw), often divided into subsegments. When counting tarsal segments, start with the semgent closest to the body. In Taeniopterigidae, the first and second segment of the tarsus on all legs are the same length."
  },
  {
    "id": 46,
    "description": "In Taeniopterigidae, the first and second segment of the tarsus on all legs are the same length. The tarsus is the, most distal leg region (last part of a leg before the claw), often divided into subsegments. When counting tarsal segments, start with the semgent closest to the body."
  },
  {
    "id": 47,
    "description": "Wingpads are not parallel with body, angled away from the midline of the body."
  },
  {
    "id": 48,
    "description": "Always with to tarsal claws per leg."
  },
  {
    "id": 49,
    "description": "Always with to tarsal claws per leg."
  },
  {
    "id": 50,
    "description": "Always only two tails (cerci)."
  },
  {
    "id": 51,
    "description": "Always only two tails (cerci)."
  },
  {
    "id": 52,
    "description": "Beetles are the most diverse group of plants or animals on earth, with over 300,000 species. More than 16,000 of these species live in water for at least part of their lives. Beetles have egg, <u>larval</u>, pupal, and adult life stages. For different species, one or all of egg, <u>larval</u>, or adult life stages live in the water, but usually the pupae are terrestrial. Some <u>larvae</u> have slender gills for breathing underwater, others simply take oxygen through the soft cuticle or pierce stems or roots of aquatic plants. Adults do not have gills, but have various other strategies--Some hold an air bubble against breathing holes on the sides of their bodies and replenish the bubble periodically at the water surface; others maintain a thin layer of permanently trapped air over those breathing holes. Aquatic beetles can be found in water that is either flowing or still, and some even thrive in brackish environments."
  },
  {
    "id": 53,
    "description": "The Diptera are holometabolous, meaning they have egg, <u>larval</u>, pupal, and adult life stages. For aquatic species, all life stages except the adult usually are aquatic. Greater than 51,000 species are known to be aquatic or semiaquatic; this is more than the number of aquatic species in all other insect orders combined. <u>Larvae</u> in this order are often maggot-like and never have segmented legs. Adults can be readily recognized by the absence of hind wings; they have front wings, but instead of hind wings they have club-like appendages (halteres) used for balance during flight. Adult flies are often thought of as pests because some bite, some vector diseases such as malaria, or swarm in high numbers. However, both <u>larvae</u> and adults are important links in aquatic and terrestrial food webs."
  },
  {
    "id": 54,
    "description": "Commonly all insects are called “bugs”; however, the term “bug” actually refers to a specific order of insects, the Hemiptera, or so-called “true bugs.” Not all members of the group are aquatic, however there are nearly 5,000 aquatic or semiaquatic species worldwide. They are <u>hemimetabolous</u>, meaning that the life cycle does not have a pupal stage, and adults and <u>larvae</u> look very similar, except for the lack of wings when immature (<u>wing pads</u> may be present). True bugs can almost always be distinguished from other insects by the presence of a pointed beak or <u>rostrum</u>; this is a set of piercing-sucking mouthparts, usually long, that is held beneath the body (<u>ventrally</u>) when not feeding. These insects are often herbivores, feeding on plant fluids, or <u>predators</u> that inject their prey with digestive enzymes which liquefy the tissues so that they can be easily sucked back up through the straw-like mouth."
  },
  {
    "id": 55,
    "description": "Most moths are terrestrial, however a few of the caterpillars of the family Crambidae are truly aquatic (about 740 species worldwide, 160 in North America). They are holometabolous, meaning they have egg, <u>larval</u>, pupal, and adult stages. They can be found in a variety of <u>lentic</u> and <u>lotic</u> habitats. Most <u>larvae</u> feed on floating plants or algae on rock surfaces. Often, first instar <u>larvae</u> are <u>hydrophilic</u> (water-loving) and absorb oxygen directly from the water. As the <u>larvae</u> become larger some species become <u>hydrophobic</u> (water-resistant) with a layer of air held against the body. This is advantageous, as oxygen diffuses more rapidly through air than water. Similar to the closely related Trichoptera (caddisflies), some species make cases or tents out of plant material and silk. They often have a close relationship with a host plant on which they both live and feed; these plant feeders often cover themselves with pieces of leaf or they <u>burrow</u> in the stem. The algal-feeding species of genus <em>Petrophila </em>live in streams and spin a silk tent on a rock or other solid substrate from beneath which they graze on the algae. The caterpillars pupate in or beneath the plant or silk material, and emerge as terrestrial moths."
  },
  {
    "id": 56,
    "description": "The members of this group are holometabolous, meaning that they have egg, <u>larval</u>, pupal, and adult life stages, but only the <u>larval</u> life stage is aquatic. <u>Larvae</u> of some genera can be quite large and all are predators of smaller invertebrates. They can be found in still or flowing water habitats; however, at the genus and species levels their habitat preferences are more particular. <u>Larvae</u> can be readily identified by the presence of paired <u>lateral</u> filaments or gills along the sides of the abdomen. Eggs are laid on plants or other objects overhanging the water, from where the young <u>larvae</u> drop into the water after hatching from their eggs. Pupae are in chambers dug in the soil or under soft rotting shoreline logs or stumps or in dry streambeds. Adults are aerial, flying in the day or night; with many nocturnal and most active at dusk; they can be quite large but likely do not feed."
  },
  {
    "id": 57,
    "description": "The order Odonata is composed of two groups, the true dragonflies (Anisoptera) and the damselflies (Zygoptera). American damselfly <u>nymphs</u> have leaf- or feather-like gills on the posterior end of the abdomen; dragonfly <u>nymphs</u> have 5 tightly grouped spikes instead. These are <u>hemimetabolous</u> insects, and so do not have a pupal stage. Adults and <u>nymphs</u> are <u>engulfing predators</u>, feeding mainly on small invertebrates. <u>Larvae</u> capture their prey by either stealth or by ambush, snatching them with their <u>labial mask</u>, an arm-like extremity that extends rapidly from below the face and brings the food to their chewing mandibles. As adults, dragonflies are often thicker bodied than damselflies and hold their wings to the sides when at rest. Damselflies have more slender abdomens and their eyes appear more widely separated than eyes of true dragonflies; when at rest, damselflies usually hold their wings together vertically above their bodies. Adults are strong flyers, often found near the water, where they capture flying insects in the air. Eggs are laid in plant tissues or other substrates above or below the water surface."
  },
  {
    "id": 58,
    "description": null
  },
  {
    "id": 59,
    "description": null
  },
  {
    "id": 60,
    "description": null
  },
  {
    "id": 61,
    "description": null
  },
  {
    "id": 62,
    "description": null
  },
  {
    "id": 63,
    "description": null
  },
  {
    "id": 64,
    "description": null
  },
  {
    "id": 65,
    "description": null
  },
  {
    "id": 66,
    "description": null
  },
  {
    "id": 67,
    "description": null
  },
  {
    "id": 68,
    "description": null
  },
  {
    "id": 69,
    "description": null
  },
  {
    "id": 70,
    "description": null
  },
  {
    "id": 71,
    "description": null
  },
  {
    "id": 72,
    "description": null
  },
  {
    "id": 73,
    "description": null
  },
  {
    "id": 74,
    "description": null
  },
  {
    "id": 75,
    "description": null
  },
  {
    "id": 76,
    "description": null
  },
  {
    "id": 77,
    "description": null
  },
  {
    "id": 78,
    "description": null
  },
  {
    "id": 79,
    "description": null
  },
  {
    "id": 80,
    "description": null
  },
  {
    "id": 81,
    "description": null
  },
  {
    "id": 82,
    "description": null
  },
  {
    "id": 83,
    "description": null
  },
  {
    "id": 84,
    "description": null
  },
  {
    "id": 85,
    "description": null
  },
  {
    "id": 86,
    "description": null
  },
  {
    "id": 87,
    "description": null
  },
  {
    "id": 88,
    "description": null
  },
  {
    "id": 89,
    "description": null
  },
  {
    "id": 90,
    "description": null
  },
  {
    "id": 91,
    "description": null
  },
  {
    "id": 92,
    "description": null
  },
  {
    "id": 93,
    "description": null
  },
  {
    "id": 94,
    "description": null
  },
  {
    "id": 95,
    "description": null
  },
  {
    "id": 96,
    "description": null
  },
  {
    "id": 97,
    "description": null
  },
  {
    "id": 98,
    "description": null
  },
  {
    "id": 99,
    "description": null
  },
  {
    "id": 100,
    "description": null
  },
  {
    "id": 101,
    "description": null
  },
  {
    "id": 102,
    "description": null
  },
  {
    "id": 103,
    "description": null
  },
  {
    "id": 104,
    "description": null
  },
  {
    "id": 105,
    "description": null
  },
  {
    "id": 106,
    "description": "Isopods are a type of non-insect arthropod, or crustacean. Most isopods live on land, however there are approximately 100 North American aquatic species, mostly belonging to the family Asellidae. They tend to be rather flat from top to bottom (depressed), not laterally. They often have mottled coloring. These are usually bottom dwelling sprawlers, found in shallow, freshwater habitats. Usually they are omnivores or detritivores."
  },
  {
    "id": 107,
    "description": "Isopods are a type of non-insect arthropod, or crustacean. Most isopods live on land, however there are approximately 100 North American aquatic species, mostly belonging to the family Asellidae. They tend to be rather flat from top to bottom, not laterally. They often have mottled coloring. These are usually bottom dwelling sprawlers, found in shallow, freshwater habitats. Usually they are omnivores or detritivores. Asellus communis is sometimes used for fly fishing in slow water areas with lots of plant growth."
  },
  {
    "id": 108,
    "description": null
  },
  {
    "id": 109,
    "description": "There are 6 genera in this family including about 20 species. The <u>larvae</u> are <u>engulfing predators</u> actively search for food, mostly small invertebrates. Members of this family tend to be found in the fastest part of the riffle, among the rocks; however, some species can be found in still water as well. The <u>larvae</u> (hellgrammites) are often preferred as live bait by fishermen due to their high activity and long life on a hook, making them more likely to attract fish. Adults probably do not feed. Males of some species have very long sword-like mandibles used in mating rituals. (Females prefer males with large jaws.)"
  },
  {
    "id": 110,
    "description": "The genus <em>Nigronia </em>includes two North American species, <em>N</em>. <em>fasciata </em>and <em>N. serricornis</em>. They are found in <u>lotic-erosional</u> and -<u>depositional</u> habitats, usually in streams with coarse sediments and detritus, often <u>clinging</u>/<u>climbing</u> under or on rocks, especially under bark or in crevices of woody debris. Like other hellgrammites, they are <u>engulfing predators</u>. These species are found throughout eastern and central United States and Canada."
  },
  {
    "id": 111,
    "description": null
  },
  {
    "id": 112,
    "description": null
  },
  {
    "id": 113,
    "description": "This family is relatively small, with only 5 North American genera, including 13 species. Unlike most water beetles, the <u>larvae</u> of this family are terrestrial <u>burrowers</u> and only the adults are aquatic, usually found in riffles, although some less-common species can be <u>lentic</u> as well. They are <u>shredding herbivores</u> and <u>scrapers</u>. The long claws of the adults make them good clingers and climbers on woody debris and other substrates. Similar to the Elmidae, these adult beetles use a plastron (thin layer of air held against the spiracles) to obtain oxygen from the water and usually don’t need to surface for air. These adult beetles can have a fairly long life-span, with the life cycle taking up to two years in some cases."
  },
  {
    "id": 114,
    "description": "This is a widespread genus with 7 North American species. Adults are <u>clingers</u> in fast water, feeding generally as <u>scrapers</u> and <u>shredders-herbivores</u>."
  },
  {
    "id": 115,
    "description": "This is the largest North American family of aquatic beetles, including over 400 species in about 35 genera. Both adults and <u>larvae</u> can be found in almost any aquatic habitat, even in brackish water; however, they are most often found in <u>lentic</u> freshwater systems. The <u>larvae</u> tend to be climbers on rooted plants and swimmers; adults are swimmers and divers. Both <u>larvae</u> and adults are <u>engulfing predators</u> of small invertebrates and fish, and are sometimes cannibalistic. Some <u>larvae</u> have a channel along the inner margin of each mandible to help them ingest fluids from their prey. Their bite is quite painful. Despite living in the water, adults and <u>larvae</u> of most species must regularly resurface for air."
  },
  {
    "id": 116,
    "description": "There are at least 106 species of this genus in North America. Adults and <u>larvae</u> inhabit both fast and slow streams and <u>littoral</u> zones of <u>lentic</u> habitats. They are <u>piercing predators</u>. Adults are <u>climbers</u> on rooted plants and efficient <u>swimmers</u>."
  },
  {
    "id": 117,
    "description": null
  },
  {
    "id": 118,
    "description": "<u>Larvae</u> and adults occur in slow-moving streams and among rooted plants of <u>lentic</u> habitats; both life stages are <u>piercing predators</u>. Adults are efficient <u>swimmers</u> and <u>divers</u>."
  },
  {
    "id": 119,
    "description": "This is a large family, including 24 genera and close to 100 species. They are known as riffle beetles, due to their common occurrence in habitats with fast-flowing water and high oxygen levels. Both <u>larvae</u> and adults are slow-moving <u>clingers</u> that feed by <u>scraping</u> or <u>collecting and gathering</u> <u>periphyton</u> and detritus from surfaces of rocks and other substrates. The <u>larvae</u> get their oxygen directly from gills that can be retracted into the end of the abdomen. Adults have an effective plastron and usually do not need to surface for air. Elmid <u>larvae</u> are unusual in that they have up to 8 instars, whereas most beetle <u>larvae</u> molt only 3 times."
  },
  {
    "id": 120,
    "description": null
  },
  {
    "id": 121,
    "description": null
  },
  {
    "id": 122,
    "description": null
  },
  {
    "id": 123,
    "description": null
  },
  {
    "id": 124,
    "description": null
  },
  {
    "id": 125,
    "description": null
  },
  {
    "id": 126,
    "description": null
  },
  {
    "id": 127,
    "description": null
  },
  {
    "id": 128,
    "description": null
  },
  {
    "id": 129,
    "description": null
  },
  {
    "id": 130,
    "description": null
  },
  {
    "id": 131,
    "description": null
  },
  {
    "id": 132,
    "description": "This is a widespread genus with 13 North American species. <u>Larvae</u> and adults live in fast and slow portions of streams, <u>clinging</u> to substrate. Adults are <u>collectors-gatherers</u> of fine organic particles."
  },
  {
    "id": 133,
    "description": null
  },
  {
    "id": 134,
    "description": null
  },
  {
    "id": 135,
    "description": "Adult members of the family Gyrinidae are unique in that their <u>compound eyes</u> are divided into separate <u>dorsal</u> and <u>ventral</u> portions, giving them a \"four-eyed\" appearance. This allows them to see both above and below the water at the same time. Their nickname, “whirligig beetles” was given to the adult beetles due to their behavior of zipping around in swirling motions along the surface of the water, although they are also good <u>divers</u>. Both the <u>larvae</u> and adults of this family are aquatic, typically found in quiet water of <u>lentic</u> or <u>lotic</u> habitats. The pupae are terrestrial. Both adults and <u>larvae</u> are <u>engulfing predators</u> of small invertebrates, but the adults may also be surface film scavengers. <u>Larvae</u> live and feed on the bottom or climb on rooted plants."
  },
  {
    "id": 136,
    "description": null
  },
  {
    "id": 137,
    "description": null
  },
  {
    "id": 138,
    "description": "This is a large and widespread genus with 41 species in North America. Adults are <u>swimmers</u> on the water surface (<u>neuston</u>) and <u>divers</u> in <u>lentic</u> habitats and slower parts of streams, scavengers and predators of small insects."
  },
  {
    "id": 139,
    "description": "This genus includes about 42 species in North America North of Mexico, and is widespread across the Eastern United States. Gyrinus includes most of the smaller species in the Gyrinidae family, while Dineutus contains the larger species. In order to deter predators, members of the genus Gyrinus often give off a foul smell and taste when disturbed. Adults and larvae prefer lotic-depositional habitats, along the margins and pools of flowing water. Both larvae and adults are engulfing predators, and scavengers of small organisms, however, unlike the larvae, the adults tend to hunt at the water’s surface."
  },
  {
    "id": 140,
    "description": "This family includes over 70 North American species. Both the <u>larvae</u> and adults of this family are aquatic. They can be found in <u>lentic</u>-<u>littoral</u> or <u>lotic-depositional</u> habitats. They are good <u>climbers</u> among the rooted plants found in their habitats. Adults can be strong swimmers as well. Both life stages have similar feeding habits; they tend to be <u>shredding</u> or <u>piercing herbivores</u>, but some are <u>engulfing predators</u>. The <u>larvae</u> sometimes overwinter in moist soil before molting into pupae and then adults. The adults must frequently resurface for air; however, the <u>larvae</u> get all of their oxygen from the water."
  },
  {
    "id": 141,
    "description": null
  },
  {
    "id": 142,
    "description": "This widespread genus includes 18 North American species. Adults and <u>larvae</u> live mostly among rooted plants in <u>lentic</u> habitats, although some occur in fast-flowing streams. Adults are <u>swimmers</u>, <u>climbers</u>, and <u>clingers</u> that <u>pierce</u> and <u>shred</u> living plant tissue and prey on other insects."
  },
  {
    "id": 143,
    "description": "Hydrophilidae is the second largest family of North American aquatic beetles, including roughly 200 species. The <u>larvae</u> and adults are aquatic or semiaquatic; the pupae are terrestrial. They prefer <u>lentic</u> waters such as ponds and shallow lakes, or sometimes in pools at edges of streams. Unlike most beetles, the adults of this family tend to swim by alternating strokes with their <u>hind legs</u>, rather than moving them in unison. Also atypical, they have a habit of surfacing for air head-first, breaking the water surface tension with a clubbed antenna, the <u>apical</u> segments of which are covered with dense water-repelling (<u>hydrophobic</u>) hairs. The adults have a well-developed plastron to hold air underwater; in well-oxygenated water, it serves as a gill. <u>Larvae</u> frequently surface to take in air from the end of the abdomen. <u>Larvae</u> are usually predators of other invertebrates, and can even break snail shells with their strong jaws. However, only a small number of adults are predators, most are omnivores or detritivores. "
  },
  {
    "id": 144,
    "description": null
  },
  {
    "id": 145,
    "description": null
  },
  {
    "id": 146,
    "description": null
  },
  {
    "id": 147,
    "description": null
  },
  {
    "id": 148,
    "description": null
  },
  {
    "id": 149,
    "description": null
  },
  {
    "id": 150,
    "description": null
  },
  {
    "id": 151,
    "description": "This widespread genus includes 14 North American species. Adults and <u>larvae</u> occur in slow streams and <u>lentic</u> habitats. Adults are <u>swimmers</u>, <u>divers</u>, and <u>climbers</u> that feed as <u>piercing herbivores</u> and as <u>collectors-gatherers</u> of small bits of organic matter."
  },
  {
    "id": 152,
    "description": "In North America North of Mexico this family includes 6 genera and about 16 species. Adults and pupae of this family are terrestrial, except for females enter the water to lay eggs. The larvae, however are fully aquatic. They are very distinctive, flat, shield-shaped larvae, almost trilobite-like in appearance, with the legs only visible from the ventral side. They are almost always found stuck (suction cup like) to the sides and tops of rocks, where they feed by scraping periphyton and other food off of the substrate."
  },
  {
    "id": 153,
    "description": "The larvae of this genus are aquatic. They are almost always found stuck (suction cup like) to the sides and tops of rocks, where they feed by scraping periphyton and other food off of the substrate. They are very distinctive, flat, shield-shaped larvae, almost trilobite-like in appearance, with the legs only visible from the ventral side Psephenus and Ecopria are the two most common genera in Psephenidae, and can be easily confused, however, they can be readily separated by the presence of abdominal gills ventrally on Psephenus."
  },
  {
    "id": 154,
    "description": null
  },
  {
    "id": 155,
    "description": null
  },
  {
    "id": 156,
    "description": "The aquatic fly genus Atherix includes 3 North American species. Aquatic snipe flies usually prefer streams and rivers with lots of dissolved oxygen, such as in <u>lotic-erosional</u> or <u>depositional</u> habitats. They can be found <u>sprawling</u> or <u>burrowing</u> in the substrate. Though they might not look like it, the <u>larvae</u> are <u>piercing predators</u> with strong hooks in the narrow head. To the novice, a <u>larva</u> looks much like a caterpillar, with <u>ventral</u> <u>prolegs</u> and terminal appendages that appear to be antennae. However, those appendages are at the wrong end of the body: their “antennae” are actually long posterior <u>tubercles</u>, divergent terminal fringed processes that help with locomotion and serve as backend \"feelers.\""
  },
  {
    "id": 157,
    "description": null
  },
  {
    "id": 158,
    "description": null
  },
  {
    "id": 159,
    "description": null
  },
  {
    "id": 160,
    "description": "This fly family includes approximately 34 North American genera, encompassing over 100 species; though not all are aquatic, most genera have at least a few aquatic species. Aquatic/semiaquatic larvae can be found <u>burrowing</u> in damp sand along beaches, <u>swimming</u> and <u>sprawling</u> among plants in both flowing and still water habitats, sometimes even in water-filled tree holes or pitcher plants. Feeding habits vary greatly depending on the species and maturity of the <u>larvae</u>, they are often predators of aquatic insect eggs, others are <u>collector-gatherers</u> or grazers on <u>periphyton</u> and detritus. Aquatic pupae do not make cocoons; they stay near the water surface and use snorkel-like structures that protrude from the thorax to breathe air. Many adult females bite and feed on blood; they need the protein to produce eggs. The bites of most species cause an annoying itch; some terrestrial species are considered pests and can transmit human filarial worms and diseases of other birds and mammals."
  },
  {
    "id": 161,
    "description": "This widespread genus of biting midges includes 24 North American species. It is found in lakes near sandy shores, among rooted plants, and swimming in open water."
  },
  {
    "id": 162,
    "description": "This group is estimated to include up to 2,000 North American species. It is the most widespread and often most abundant aquatic insect family. The <u>larvae</u> and pupae can be found in almost any aquatic habitat. They live on the bottom, sometimes within slender tubes of silk and detritus. The <u>larvae</u> must be slide-mounted in order to be identified to genus. Different species vary greatly in pollution tolerance. Shed pupal skins can be collected from surface water and identified, sometimes more easily than for <u>larvae</u> or adults. <u>Larval</u> feeding strategies vary greatly, ranging from <u>collector-gatherers</u>, to predators. <u>Larvae</u> are often abundant and an important link of the food web, as most aquatic predatory species use them as a primary food resource at some point during their life cycle. The <u>larvae</u> pupate on the bottom, and then the pupae swim to the surface to emerge as adults, which usually survive for only a few days to mate and lay eggs."
  },
  {
    "id": 163,
    "description": null
  },
  {
    "id": 164,
    "description": null
  },
  {
    "id": 165,
    "description": null
  },
  {
    "id": 166,
    "description": null
  },
  {
    "id": 167,
    "description": null
  },
  {
    "id": 168,
    "description": null
  },
  {
    "id": 169,
    "description": null
  },
  {
    "id": 170,
    "description": null
  },
  {
    "id": 171,
    "description": null
  },
  {
    "id": 172,
    "description": null
  },
  {
    "id": 173,
    "description": null
  },
  {
    "id": 174,
    "description": null
  },
  {
    "id": 175,
    "description": "Limoniidae, previously a subfamily of Tipulidae (Limoniinae), are now considered their own family. Both Limoniidae and Tipulidae are part of the larger group of crane flies, Tipulomorpha. Often these are relatively large, grey or white, soft-bodied, legless <u>larvae</u>. The head is inconspicuous, mostly retracted into the thorax and almost completely hidden from view. They are often sold in bait shops, or used as models for tied flies, especially for bass fishing. Usually, <u>larvae</u> are found <u>burrowing</u> in soft sediment of streams, often near algae or woody debris; but some <u>larvae</u> are terrestrial. They vary in feeding strategy, some are predators while others are <u>shredding detritivores</u> and <u>herbivores</u>. Most species have only 1 generation per year. Pupa usually are found in marginal habitats. Adults resemble giant mosquitoes, with long, delicate legs; however, they do not bite."
  },
  {
    "id": 176,
    "description": null
  },
  {
    "id": 177,
    "description": null
  },
  {
    "id": 178,
    "description": null
  },
  {
    "id": 179,
    "description": null
  },
  {
    "id": 180,
    "description": null
  },
  {
    "id": 181,
    "description": null
  },
  {
    "id": 182,
    "description": null
  },
  {
    "id": 183,
    "description": null
  },
  {
    "id": 184,
    "description": null
  },
  {
    "id": 185,
    "description": null
  },
  {
    "id": 186,
    "description": "There are over 255 North American species in this family. The genera <em>Simulium </em>and <em>Prosimulium </em>include most of these. <u>Larvae</u> spin a pad of silk and glue it it to the substrate, then use hooks on the posterior end to grasp the silk pad and suspend themselves in the current, where they feed. If a <u>larva</u> is disturbed by a predator it uses a strand of silk from their mouth that is tethered to the substrate to climb back to their rock once the predator has left. They use comb-like fanning structures on their head to filter food from the water. Generally, this group is considered tolerant to pollution, however, they can be found only in clean water as well, depending on the species. Adult black flies are terrestrial, and the females are biting pests. The bites can cause allergic reactions in some people, and in cases where the numbers are high can cause blood loss and become dangerous for some mammal species. In the tropics, flies in this family can transmit diseases such as river blindness. Fly fishermen often refer to members of this group as smuts, and sometimes use <u>larvae</u> or pupae in their fly patterns."
  },
  {
    "id": 187,
    "description": null
  },
  {
    "id": 188,
    "description": "This widespread genus includes at least 154 North American species. <u>Larvae</u> need moving water to feed with the filtering fans on their heads, either in streams or in wave-washed shores of lakes."
  },
  {
    "id": 189,
    "description": null
  },
  {
    "id": 190,
    "description": null
  },
  {
    "id": 191,
    "description": null
  },
  {
    "id": 192,
    "description": null
  },
  {
    "id": 193,
    "description": "Until recently, Tipulidae included all species of \"crane flies.\" As now more strictly defined, this widespread family includes at least 53 species in North America. <u>Larvae</u> of some species are terrestrial, but aquatic <u>larvae</u> inhabit quiet areas of streams and shores of lakes, <u>burrowing</u> in the soil, often among roots, <u>shredding</u> living and dead plant material."
  },
  {
    "id": 194,
    "description": "This widespread genus includes more than 30 North American species in freshwater habitats. <u>Larvae</u> of aquatic species live in both fast- and slow-flowing portions of streams and in the weedy edges of lakes, where they <u>burrow</u> in detritus. There they usually shred dead plant material, but can also <u>shred</u> living plant tissue and gather tiny bits of organic matter. Some may also eat algae or small animals that are on the plant material they are shredding."
  },
  {
    "id": 195,
    "description": "<em>Ameletus </em>was previously included among genera of the Siphloneuridae, but is now the only genus in the family Ameletidae. There are 34 known species in North America, most from west of the Rocky Mountains. <u>Larvae</u> are <u>fusiform</u> or streamlined in body shape, making them strong swimmers and <u>clingers</u>. They are <u>collector-gatherers</u> or <u>scraper-grazers</u>, feeding on fine detritus and diatoms. They tend to be found in cold, fast-flowing mountain streams, especially along edges, undercut banks, and in root masses. The family can often be confused with Isonychiidae or Baetidae, but can be distinguished by its <u>maxillae</u>, each with a row of golden pectinate spines."
  },
  {
    "id": 196,
    "description": "<em>Ameletus </em>was previously included among genera of the Siphloneuridae, is now the only genus in the family Ameletidae. There are 34 known species in North America, most from west of the Rocky Mountains. <u>Larvae</u> are <u>fusiform</u> or streamlined in body shape, making them strong <u>swimmers</u> and <u>clingers</u>. They are <u>collector-gatherers</u> or <u>scraper-grazers</u>, feeding on detritus and diatoms. They tend to be found in cold, fast-flowing mountain streams, especially along edges, beneath undercut banks, and in root masses. The genus can often be confused with <em>Isonychia</em> or <em>Baetis</em>, but can be distinguished by its <u>maxillae</u>, each with a row of golden <u>pectinate</u> spines."
  },
  {
    "id": 197,
    "description": "This family includes roughly 152 North American species. The <u>larvae</u> of this family are usually found in <u>lotic-erosional</u> or <u>lotic-depositional</u> habitats. They tend to be <u>clingers</u> and strong <u>swimmers</u> due to their streamlined, minnow-like body shape. They feed by <u>collecting and gathering</u> food, or by <u>scraping</u> algae and <u>periphyton</u> from rocks and detritus. Adults tend to swarm nearby in open areas after emergence. <u>Duns</u> and <u>spinners</u> of this group are frequently used as models for tied flies in the fly-fishing community. <u>Larvae</u> in this group can be tricky to identify and can be easily mistaken for other families such as the Siphlonuridae and Isonychidae; however, with careful attention to detail and patience, they can be separated."
  },
  {
    "id": 198,
    "description": null
  },
  {
    "id": 199,
    "description": "This common and widespread genus includes at least 21 North American species. The <u>larvae</u> live in both rapid and quiet stretches of streams and among rooted plants at the edges of ponds and lakes. They have streamlined bodies that enable them to swim rapidly through the water; when resting, they <u>cling</u> or <u>climb</u> on rocks and other stable substrates. Mainly, they feed as <u>collectors-gatherers</u> of diatoms and tiny bits of organic detritus, occasionally <u>scraping</u> these materials from rock surfaces."
  },
  {
    "id": 200,
    "description": null
  },
  {
    "id": 201,
    "description": null
  },
  {
    "id": 202,
    "description": null
  },
  {
    "id": 203,
    "description": null
  },
  {
    "id": 204,
    "description": "This family includes over 30 North American species in 4 genera. They prefer slow-moving or stagnant water where there is an abundance of silt and loose sediment and are often found sprawled on/in the silt or climbing among the plants. They tend to be slow-moving and often partially cover themselves in sediment, making them difficult to spot. They feed by <u>filtering</u> or <u>collecting and gathering</u> tiny bits of food or by <u>scraping</u> algae and <u>biofilm</u> from rocks and other substrate in their habitat. Several genera in this group can be useful to fly-fishermen, but due to the short life-span, it can be difficult to time your fishing trip just right or you will miss the \"hatch\" (<u>eclosion</u> or emergence as adults).  "
  },
  {
    "id": 205,
    "description": "<u>Larvae</u> of the 12 North American species of this genus prefer slow-moving or stagnant water where there is an abundance of silt, and loose sediment, and are often found <u>sprawled</u> on/in the silt or <u>climbing</u> among the plants. They feed by <u>collecting and gathering</u> tiny bits of organic matter or by <u>scraping</u> algae and <u>biofilm</u> from rocks and other substrates in their habitat. The adults and <u>subimagos</u> of this group are short-lived and hatch (molt into adults) in large numbers. They are imitated by fly fishermen; however, you must time your fishing trip just right or you will miss the \"hatch.\" In addition, during the hatch, fish often feed almost exclusively on these insects, so fly-fishermen without matching tied-flies, are not likely to be successful."
  },
  {
    "id": 206,
    "description": "This common and widespread group includes roughly 80 North American species in 9 genera. <u>Larvae</u> can be readily identified, as this is the only mayfly group with gills absent on abdominal segment 2. They tend to be found in <u>lotic-erosional</u> or <u>depositional</u> habitats, often among the rooted aquatic plants, moss, root masses, or woody debris. They usually are poor <u>swimmers</u>, swimming with a floppy motion, and instead <u>sprawl</u> or <u>cling</u> to the plants or other substrates in their habitat. The family has a variety of feeding strategies, differing among species, including <u>collector-gatherers</u>, <u>scrapers</u>, some shredders of <u>detritus</u> or <u>algae</u>, and even one predator. When a <u>larva</u> is disturbed it sometimes raises its tail over its head like a scorpion, possibly as an adaptation to fend off predators; however, they cannot sting. After emergence, adults sometimes swarm atypically high, even above tree tops. This group is one of the most important for the fly-fishing community, with at least 30 different species being used as models for tied flies."
  },
  {
    "id": 207,
    "description": null
  },
  {
    "id": 208,
    "description": null
  },
  {
    "id": 209,
    "description": "There are 18 species of this common and widespread genus known in North America; in the East, adults of some of these are called Hendricksons or Sulphurs by fly fishers. <u>Larvae</u> inhabit all types of streams, where they <u>cling</u> to the substrate while collecting small particles of organic matter or <u>scraping</u> diatoms and algae and other <u>biofilm</u> from rocks and other surfaces."
  },
  {
    "id": 210,
    "description": null
  },
  {
    "id": 211,
    "description": null
  },
  {
    "id": 212,
    "description": "<u>Larvae</u> of the mayfly family Ephemeridae have large, distinct mandibular tusks projecting forward from the head, used to help <u>burrow</u> in soft silty sand or marl along the edges of still-water habitats or along the quiet parts of streams. They react negatively to light and immediately <u>burrow</u> back into the sediment if removed. <u>Larvae</u> also have feathery gills along the abdomen, giving them a rather “fluffy” appearance from the <u>dorsal</u> side. They are able to undulate these gills in order to increase flow of water for oxygen intake, which is especially important in the burrows where there is little water flow. The adults of this group are popular for fly-fishing enthusiasts because they are relatively large, and the <u>duns</u> (flying subadults) emerge in large numbers. The <u>larvae</u> are also sometimes used as bait."
  },
  {
    "id": 213,
    "description": null
  },
  {
    "id": 214,
    "description": "There are at least 7 species of this genus in North America, of which <em>Hexagenia limbata</em> is the most widespread and most famous among fly fishers, who eagerly anticipate a large \"Hex hatch\" of <u>subimagoes</u> (\"<u>duns</u>\") in <u>lotic-depositional</u> stretches of rivers and lakes with the appropriate marl substrate. The consistency of the sand-silt marl must be loose enough for <u>larvae</u> to burrow but dense enough for the walls of the burrow not to collapse. Undulation of a <u>larva</u>'s body and the feathery gills on its back moves oxygenated water and fine particles of food through the U-shaped burrow. The food is gathered from the sides of the burrow or filtered from the water."
  },
  {
    "id": 215,
    "description": "There are over 100 North American species in 11 genera in the mayfly family Heptageniidae. They are found in <u>lotic</u> or <u>lentic</u> erosional habitats, often among rocks. They are sometimes <u>collector-gatherers</u> of fine organic particles; however, they typically feed by <u>scraping</u> algae and <u>periphyton</u> from rocks and other substrates at the bottom of the stream. They have a flattened head and body, which allows them to <u>cling</u> to the tops of the rocks, even in fast flowing water, without being swept away, or to squeeze among rocks. This flat body shape makes them great at <u>clinging</u> to surfaces, but fairly poor, floppy <u>swimmers</u>. The emerging <u>duns</u> (sub-adults) are important in the fly-fishing community, with several genera in the family serving as models for tied flies."
  },
  {
    "id": 216,
    "description": null
  },
  {
    "id": 217,
    "description": null
  },
  {
    "id": 218,
    "description": null
  },
  {
    "id": 219,
    "description": "There are at least 16 species with <u>larvae</u> found in both fast and slow <u>lotic</u> (flowing water) habitats of North America. Fly fishers know the <u>duns</u> of various species as \"March Browns\" and \"Light and Dark Cahills.\" <u>Larvae</u> are <u>clingers</u> in these streams and feed primarily as <u>scrapers</u> of attached algae, diatoms, and other <u>biofilm</u>, although they may simply collect fine organic particles facultatively."
  },
  {
    "id": 220,
    "description": null
  },
  {
    "id": 221,
    "description": null
  },
  {
    "id": 222,
    "description": "<u>Larval</u> members of this family tend to be found in small streams and rivers in areas of slow flow; however, they can be found in <u>lentic</u>-<u>littoral</u> habitats as well. They are often found <u>sprawling</u> on many different substrates, such as sand, silt, or even gravel, as well as <u>clinging</u> to root masses, woody debris, or among various plants. They usually <u>collect and gather</u> small bits of organic particles for food, or some taxa also filter feed. The <u>larvae</u> in this family have gills well-adapted to their environment; the gills on abdominal segment 2 are <u>operculate</u>, covering the rest of the abdominal gills to prevent them from getting damaged by sediment. <u>Larvae</u> also fan their gills in order to increase the flow of water across their surface area, increasing the amount of oxygen they can absorb. Adults and <u>duns</u> (sub-adults) in the genus <em>Trycorythodes </em>(Dark Brown Spinner, Pale Olive Dun, and Reverse Jenny Spinner) are especially important to the fly-fishing community due to their extremely large emergences."
  },
  {
    "id": 223,
    "description": "There are 13 North American species in this genus. <u>Larvae</u> and adults are small, requiring fly fishers to tie their imitations of \"trichos\" on small hooks (size 22–26, depending on the species). <u>Larvae</u> sprawl on sediments in <u>lotic-depositional</u> and <u>lentic</u>-<u>littoral</u> habitats, or <u>cling</u> to stable substrates in those habitats. They feed as <u>collectors-gatherers</u> of tiny fragments of organic matter, occasionally <u>scraping</u> algae, diatoms, and other <u>biofilm</u> from stable substrates."
  },
  {
    "id": 224,
    "description": "There are about 70 North American species in this family. <u>Larvae</u> tend to be found in gravel-bottomed streams, with woody debris, or among roots along banks; however, some can be found in <u>lentic</u> situations. Mature <u>larvae</u> are 4–15 mm long. They tend to be <u>clingers</u> and moderately fast <u>swimmers</u>. Most feed by <u>collecting and gathering</u> food, however, some <u>scrape</u> <u>periphyton</u> from rocks or gather particles of detritus, others filter particles from the water. The gills are often forked, giving them the name “Pronggills”. We like to refer to their gills as <u>deciduous</u>, because they are extremely fragile and fall off the insect readily, like autumn leaves. They have relatively flat bodies, and thus can be easily mistaken for Heptageniidae, however, they can be distinguished because the mandibles protrude at the side of the face making them visible <u>dorsally</u>."
  },
  {
    "id": 225,
    "description": null
  },
  {
    "id": 226,
    "description": null
  },
  {
    "id": 227,
    "description": "This common and widespread genus includes about 39 species in North America. <u>Larvae</u> live on sediments and detritus in <u>lotic-erosional</u> (fast-water) habitats, where they are efficient <u>swimmers</u> and are <u>clingers</u> and <u>sprawlers</u> on the substrate. The feed as <u>collectors-gatherers</u> on coarse detritus and diatoms, occasionally shredding larger <u>detritus</u>. Fly fishers know different species as Blue Quills and Mahogany Duns."
  },
  {
    "id": 228,
    "description": null
  },
  {
    "id": 229,
    "description": null
  },
  {
    "id": 230,
    "description": null
  },
  {
    "id": 231,
    "description": null
  },
  {
    "id": 232,
    "description": null
  },
  {
    "id": 233,
    "description": null
  },
  {
    "id": 234,
    "description": null
  },
  {
    "id": 235,
    "description": null
  },
  {
    "id": 236,
    "description": "The Belostomatidae, or giant water bugs, include 19 species in 4 genera in North America. Other common names include toe-biters, electric-light bugs (because they often fly to lights at night), or alligator ticks/fleas (in Florida). Some species are among the largest insects. Both <u>larvae</u> and adults live usually among rooted plants in quieter water such as ponds and slowly flowing streams. Both <u>larvae</u> and adults are <u>piercing predators</u>, either stalking or ambushing their prey. Once captured, the prey are injected with salivary secretions to dissolve soft tissue and then the resulting liquid is sucked back through their sharp beaks. Younger <u>larvae</u> and small adults eat mainly other macroinvertebrates, but larger species eat larger crustaceans and small fish and amphibians. There are reports of the largest species consuming baby turtles and water snakes. They are known to feign death, lying still while secreting a fluid from the anus. Even small specimens should be handled carefully because they can inflict a very painful bite; fortunately, the effects soon wear off with no lasting consequences. Males of many species tend the clutch of eggs laid by the female either on the male's back or on vegetation while the male stands guard nearby. Giant water bugs are eaten for food and are considered a delicacy especially by people in eastern and southern Asia."
  },
  {
    "id": 237,
    "description": null
  },
  {
    "id": 238,
    "description": "The Corixidae, or water boatmen, include about 130 species in 20 genera in North America, making it the most species-diverse family of freshwater Hemiptera. They are very efficient <u>swimmers</u>, moving quickly near the bottom of weedy, quieter water habitats (ponds and slowly flowing streams). They feed mostly on the sap of freshwater plants, but occasionally prey on small macroinvertebrates or even eat small particles of detritus. Eggs are laid on solid objects under water. The front <u>tarsi</u> of males are usually equipped with tiny pegs that can be rubbed across the triangular, grooved <u>rostrum</u> to make sound under water. Both males and females are often attracted to lights at night."
  },
  {
    "id": 239,
    "description": null
  },
  {
    "id": 240,
    "description": "There are about 46 North American species of water striders in 9 genera. Using water-repelling hairs on their <u>tarsi</u> (feet) to stay on top of the water and water-surface-penetrating claws to gain purchase in the water-surface tension, these familiar insects skate rapidly on the surface of open water of <u>lentic</u> habitats and slowly flowing areas of streams. Their movements are clumsy on shore. Because adults often lack wings, distinguishing <u>nymphs</u> from adults requires careful examination of genital structures. Both <u>larvae</u> and adults feed on living and dead insects trapped on the water surface."
  },
  {
    "id": 241,
    "description": null
  },
  {
    "id": 242,
    "description": "The family Naucoridae includes 5 North American genera with roughly 20 species. However, <em>Pelocoris </em>is the only genus found in the eastern United States. <em>Pelocoris </em>typically inhabits weedy ponds or quiet water. They are generally <u>clingers</u>, but are good <u>swimmers</u> as well. They are <u>piercing predators</u>, with strong grasping <u>forelegs</u> to capture their prey (other small invertebrates). Be careful when handling them; their bite is painful! Fortunately, the pain soon dissipates and leaves no lasting consequences. Some adults in this family have up to four million tiny <u>hydrophobic</u> hairs per square mm that help hold a layer of air (plastron) against the ventrolateral <u>spiracles</u> while underwater so that they do not need to come to the water surface to breathe. Some species also fan this plastron with their hind legs, to increase the current moving across it, and thus increase the diffusion of oxygen from the water."
  },
  {
    "id": 243,
    "description": "The family Naucoridae includes 5 North American genera with roughly 20 species. However, <em>Pelocoris </em>is the only genus found in the East. <em>Pelocoris </em>typically inhabits ponds or quiet water. They are generally thought as <u>clingers</u>, but are good <u>swimmers</u> as well. They are <u>piercing predators</u>, feeding on other small invertebrates. Adults of some species have up to four million tiny <u>hydrophobic</u> hairs per square mm that help hold a bubble of air (plastron) against the <u>ventral</u> <u>spiracles</u> while underwater. Some species also fan this plastron with their hind legs, to increase the current moving across it, and thus increase the diffusion of oxygen from the water."
  },
  {
    "id": 244,
    "description": null
  },
  {
    "id": 245,
    "description": null
  },
  {
    "id": 246,
    "description": null
  },
  {
    "id": 247,
    "description": null
  },
  {
    "id": 248,
    "description": "There are roughly 35 species in the family Veliidae. They are referred to as \"riffle bugs\" because they are often found on the surface of fast-flowing water. Members of this group are <u>piercing predators</u>. They wait at the surface and grab small living or dead invertebrates that swim or drift by. The <u>hydrophobic</u> (water-repelling) structure of the <u>tarsi</u> (last segment of each leg) helps them stay on the water surface. Most insects have their claws at the most <u>apical</u> tip of each leg; however, riffle bugs have the claws positioned before the <u>apex</u>. The claws are not <u>hydrophobic</u> and pierce the water surface, giving them \"grip\" for running on it."
  },
  {
    "id": 249,
    "description": null
  },
  {
    "id": 250,
    "description": "Usually when we think of striders, we picture insects skimming across the surface of still, open water. However, members of the genus <em>Rhagovelia </em>are different; they are sometimes nicknamed “Riffle Bugs” as they tend to show habitat preference towards surface water of stream riffles, or just downstream of them. There are about 10 species in North America. Members of this genus, like the rest of their family, are <u>piercing predators</u> and sometimes scavengers. They wait at the surface, feeding on dead or living small invertebrates that float or swim by."
  },
  {
    "id": 251,
    "description": "Most caterpillars in the family Crambidae are terrestrial; however, a few of these caterpillars are truly aquatic (about 740 species worldwide). They are holometabolous, meaning they have egg, <u>larva</u>, pupal, and adult stages. They can be found in a variety of habitats including <u>lentic</u> and <u>lotic</u> habitats. Most <u>larvae</u> feed on floating plants or algae on rock surfaces. Often, first instar <u>larvae</u> are <u>hydrophilic</u> (water-loving) and absorb oxygen directly from the water. As the <u>larvae</u> become larger they tend to be <u>hydrophobic</u> (water-resistant) with a layer of air held against the body. This is advantageous, as oxygen diffuses more rapidly through air than water. They often have a close relationship with a host plant on which they both live and feed; these plant feeders often cover themselves with pieces of leaf or they burrow in the stem. The algal-feeding species spin a silk tent from beneath which they graze on the algae. They pupate in or beneath the plant and silk material, and emerge as terrestrial snout moths."
  },
  {
    "id": 252,
    "description": "There are 7 North American species of this genus. <u>Larvae</u> of <em>Parapoynx </em>feed on pondweed (<em>Potamogeton</em>), watermilfoil (<em>Myriophyllum</em>), waterhyssop (<em>Bacopa</em>), eelgrass/tape grass (<em>Vallisneria</em>), and broadleaf plants such as yellow water-lily (<em>Nuphar</em>), water lily (<em>Nymphaea</em>), water-shield (<em>Brasenia</em>), floating-heart (<em>Nymphoides</em>), golden-club (<em>Orontium</em>), and other freshwater species. They often cut circular pieces from the edges of broadleaf species to cover themselves while feeding on the tops of the leaves, other times drilling from the top of the stem downward. Pupation occurs in a silk-lined chamber under the leaf patch or in the plant stem."
  },
  {
    "id": 253,
    "description": "The dragonfly family Aeshnidae includes 10 genera. <em>Aeshna </em>is the largest genus, including 20 out of 38 North American species in the family. Like most dragonfly <u>larvae</u>, members of this family are predators, feeding on invertebrates and even small fish by stalking their prey. They can be found <u>climbing</u> on aquatic plants or root masses, in still or slowly flowing water. They are sometimes used as models for tied flies for fly-fishing; usually larger species are imitated, and the hook made to sink and be teased along the bottom to mimic their behavior. The adults are <u>perchers</u>, meaning when flying they will frequently pause to rest on branches or other prominent objects for a few seconds before taking off again. Some species migrate, flying South in winter, and as far north as Canada in the summer."
  },
  {
    "id": 254,
    "description": "Two species of <em>Boyeria </em>occur in eastern North America. Unlike most genera of Aeshnidae, larvae of <em>Boyeria </em>are found in smaller, slowly flowing streams in woods, where they hide under rocks and heavy accumulations of leaves and sticks. <u>Larvae</u> are mostly dark except for banded legs and a conspicuous pale spot on the top of abdominal segment 8. Before molting to the adult stage, <u>larvae</u> crawl out of the water, about a foot (30 cm) above the water line, where they grasp the solid substrate, split their <u>larval</u> exoskeletons on the <u>dorsal</u> midline, and slowly emerge as adults."
  },
  {
    "id": 255,
    "description": "The family Calopterygidae belongs in Zygoptera, or damselflies, and is not a true dragonfly (Anisoptera). Members of this group live in <u>lotic-erosional</u> and <u>depositional</u> habitats and tend to be found along the margins of streams, in areas of moderate or slower flow, where there is detritus. They are stiff-looking <u>climbers</u> on roots, plant stems, and debris at edges of slowly flowing streams. They are <u>engulfing predators</u> that actively stalk their prey then snatch it up with their <u>labial mask</u>, an arm-like extremity that extends from below the face. The adults of this group are often dark winged with slender iridescent green-blue bodies."
  },
  {
    "id": 256,
    "description": "<em>Calopteryx</em>, with 5 North American species, is the most common and widespread genus in the Calopterygidae. Members of this genus live along the margins of <u>lotic-erosional</u> and <u>depositional</u> habitats, in areas of moderate or slower flow, where they <u>climb</u> slowly on plants or detritus. Like other members of the Odonata, they are <u>engulfing predators</u>."
  },
  {
    "id": 257,
    "description": "This is the largest damselfly family, including roughly 90 North American species in 15 genera. Most genera are found in <u>lentic</u> habitats, except <em>Argia</em>, which is usually found in streams among rocks and plants. <u>Nymphs</u> are <u>climbers</u> and stalking predators among plants and roots. Some of the <u>nymphs</u> in this group can be used for fly-fishing, but usually are only useful in slowly moving water. Unlike most damselfly adults, which tend to rest from flight on plants, members of the Coenagrionidae tend to rest on rocks or other exposed surfaces. Interestingly, adult males and females of the same species tend to differ in color."
  },
  {
    "id": 258,
    "description": "About 31 North American species are known in <em>Argia</em>. <u>Larvae</u> are relatively short and stocky and somewhat flattened (depressed) dorsoventrally. Head relatively longer than in other genera of Coenagrionidae."
  },
  {
    "id": 259,
    "description": null
  },
  {
    "id": 260,
    "description": null
  },
  {
    "id": 261,
    "description": null
  },
  {
    "id": 262,
    "description": null
  },
  {
    "id": 263,
    "description": "This dragonfly family includes roughly 7 North American genera and 50 species, and unlike most dragonfly familes, tends to have more species found in the North than the South. They can be found in varying habitats including streams, as well as <u>lentic</u> habitats such as lakes, ponds, and wetlands. They are <u>sprawlers</u> along the <u>benthos</u> and <u>climbers</u> on plants. <u>Nymphs</u> can be easily confused with those of the family Libellulidae (Common Skimmers) but can be identified with close attention to the presence of a longitudinal groove on the base of the <u>ventral</u> surface of the <u>labial mask</u>. They molt into adults at roughly the same time as burrowing mayflies, one of their favorite foods."
  },
  {
    "id": 264,
    "description": "Ten species of Epitheca occur in North America. <u>Larvae</u> live on stalks of rooted plants and among plant detritus of small, woodland streams, ponds, lakes, and sometimes (in northern areas) in sphagnum bogs. They are <u>climbers</u> and <u>sprawlers</u> in these habitats, stalking their prey. Some are easily captured from stalks of rooted plants. Others are not easily dislodged from debris by ordinary methods--in order to capture most specimens, debris must be lifted from the water and specimens removed by hand."
  },
  {
    "id": 265,
    "description": "This family includes approximately 16 genera and more than 80 North American species. This is a fairly common and widespread group, found among debris or <u>burrowing</u> in both <u>lentic</u> and <u>lotic</u> habitats. <u>Nymphs</u> are easily identified by their rather thick antennae. Like other dragonflies, the adults and <u>nymphs</u> are predators. <u>Nymphs</u> bury in the sediment, partially hiding themselves to wait for prey to pass by, and then snatch them up with their arm-like <u>labral</u> mask. The adults typically fly low to the ground and only in bright sun."
  },
  {
    "id": 266,
    "description": null
  },
  {
    "id": 267,
    "description": null
  },
  {
    "id": 268,
    "description": null
  },
  {
    "id": 269,
    "description": null
  },
  {
    "id": 270,
    "description": "This is a group of 90 North American species, the most of any dragonfly family. <u>Nymphs</u> can be found in a variety of <u>lentic</u> habitats including wetlands, ponds, and ditches, as well as along the margins of slow-flowing <u>lotic</u> habitats. They can be found <u>sprawling</u> on the <u>benthos</u> or <u>climbing</u> plants and woody debris. Some species are extremely tolerant of low oxygen concentrations in the water as well as high alkalinity, and <u>brackish</u> water habitats. <u>Nymphs</u> can sometimes be used for fly-fishing in still water habitats. The adults seem to fly in rather unpredictable flight trajectories and tend to have wings patterned with pigment."
  },
  {
    "id": 271,
    "description": "There are 14 North American species of <em>Libellula</em>. <u>Larvae</u> are unusually hairy and generally covered with silt. They are <u>sprawlers</u> or shallow <u>burrowers</u> in silty bottoms of ponds and of pools at margins of streams, usually in warmer water than many other dragonflies."
  },
  {
    "id": 272,
    "description": null
  },
  {
    "id": 273,
    "description": null
  },
  {
    "id": 274,
    "description": null
  },
  {
    "id": 275,
    "description": null
  },
  {
    "id": 276,
    "description": null
  },
  {
    "id": 277,
    "description": null
  },
  {
    "id": 278,
    "description": null
  },
  {
    "id": 279,
    "description": null
  },
  {
    "id": 280,
    "description": null
  },
  {
    "id": 281,
    "description": "This family includes 6 genera with over 40 species in North America. Although the family is relatively widespread, the species tend to have very localized distributions. <u>Larvae</u> prefer fast, rocky-bottomed riffles and streams. <u>Larvae</u> are long and slender, allowing them to slither through leaf packs. They are <u>shredding detritivores</u>, eating decaying leaves in the water; however, most of the nutrients they receive from this meal come from the <u>periphyton</u> growing on the leaves and not the leaves themselves. The adults have wings that appear to roll around the body, giving them the common name Rolled-Winged Stoneflies."
  },
  {
    "id": 282,
    "description": "Not much is known about the life history of these larvae. Only 9 of the 26 species in North America are well described by science. Most are <u>detritivorous shredders</u>, like other shredders it is thought that they don’t get nutrients directly from the decaying leaves they eat, but from the <u>periphyton</u> and fungi growing on the leaves. Some may also be facultative <u>collector-gatherers</u>. They can be found in <u>lotic-erosional</u> and <u>depositional</u> habitats, usually preferring riffles. Typically, when found in small streams they are semivoltine (completing less than one generation per year), and in large warm streams they are univoltine (completing one generation per year). Generally, species of <em>Leuctra </em>are intolerant of pollution, but some species can tolerate low pH (very acid) conditions."
  },
  {
    "id": 283,
    "description": "There are 12 North American genera with roughly 60 species. This group is often referred to as “spring stoneflies,” however, adults of different species emerge at different times of year. The <u>larvae</u> tend to prefer small rivers, streams, and springs. They are often found in <u>leaf packs</u>, wood, or other coarse sediments. This makes sense as most of them are <u>shredding detritivores</u>, though some are <u>collector-gatherers</u>. These <u>larvae</u> can be easily confused with Taeniopterygidae as they both have <u>wing pads</u> divergent (not parallel with the body axis) but can be distinguished because the second tarsal segment of each leg of Nemouridae is much shorter in length than the first. These tend to be hairy <u>larvae</u> with <u>hind legs</u> longer than the abdomen."
  },
  {
    "id": 284,
    "description": "There are 16 North American species in this genus. Mature <u>larvae</u> are 5-8 mm in length. It is believed that all eastern species have a univoltine life cycle, having only one generation per year. Eggs often go through a diapause for up to 6 months. <u>Larvae</u> grow slowly during the cold part of the year, and faster when it is warm. <u>Larvae</u> emerge as adults in the Spring or Fall depending on the species. There has been little study on <u>larval</u> feeding habits, although they are thought to be mostly <u>shredding detritivores</u>. They are usually found in <u>lotic-erosional</u> and <u>depositional</u> habitats in detritus. They can be separated from other Nemourid genera by their paired cervical gills with 5 or more branches, arising from the base, each filament subequal in length."
  },
  {
    "id": 285,
    "description": null
  },
  {
    "id": 286,
    "description": null
  },
  {
    "id": 287,
    "description": "This family includes 130 North American species and about 300 worldwide. This members of this family have a patterned head and thorax and often longitudinal black-and-yellow stripes on the abdomen, giving the <u>nymphs</u> the common name \"Stripetails.\" Similar to other predators, the <u>larvae</u> of this group have <u>paraglossae</u> that are much longer than the <u>glossae</u>; however, some species in this group are also facultative shredders or <u>collector-gatherers</u>. They are often found <u>clinging</u> to the substrate, plants, or other materials in the stream. "
  },
  {
    "id": 288,
    "description": null
  },
  {
    "id": 289,
    "description": null
  },
  {
    "id": 290,
    "description": "The genus <em>Isoperla </em>contains over 57 species, making it one of the largest stonefly genera. <u>Larvae</u> prey on Chironomidae and Simuliidae (Diptera), Ephemeroptera, and Plecoptera; some feed as <u>collectors-gatherers</u>, especially when young. Members of this genus are mostly univoltine, meaning that they only have one generation per year. Emergence can occur throughout the spring and summer. To emerge, the <u>larvae</u> crawl out of the stream onto rocks or logs before molting to an adult. They are an important food source for trout in eastern streams. Fly fishermen often know them as the Light Stonefly, Light Brown Stonefly, or Little Yellow Stonefly, and often try to mimic the look of the <u>larvae</u> in their tied flies."
  },
  {
    "id": 291,
    "description": null
  },
  {
    "id": 292,
    "description": null
  },
  {
    "id": 293,
    "description": null
  },
  {
    "id": 294,
    "description": null
  },
  {
    "id": 295,
    "description": null
  },
  {
    "id": 296,
    "description": "The genus <em>Hydropsyche </em>is the largest in the Hydropsychidae family, including 80 species in America North of Mexico. <u>Larvae</u> build stationary retreats of silk, detritus, and rock fragments. A part of the entrance of the retreat often has a circular silken net woven to its upstream end, protruding across the current to filter bits of suspended food from the water. This how they earned their common name, “net spinners.” A <u>larva</u> defends its territory by making warning sounds as it scrapes its front <u>femora</u> against washboard-like files on the underside of the head."
  },
  {
    "id": 297,
    "description": null
  },
  {
    "id": 298,
    "description": null
  },
  {
    "id": 299,
    "description": null
  },
  {
    "id": 300,
    "description": null
  },
  {
    "id": 301,
    "description": null
  },
  {
    "id": 302,
    "description": null
  },
  {
    "id": 303,
    "description": null
  },
  {
    "id": 304,
    "description": null
  },
  {
    "id": 305,
    "description": null
  },
  {
    "id": 306,
    "description": "<em>Phylocentropus</em> is the only genus in the family Dipseudopsidae in North America. <u>Larvae</u> <u>burrow</u> in sand or soft sediment and stabilize the walls of their burrow by shoring them with silk extruded from a long, movable <u>spinneret</u>. The tips of the branching burrow protrude above the sediment, looking like little sticks. A side branch of the retreat is enlarged and contains a silken net used to <u>filter</u> tiny bits of organic matter for food. They tend to live in pools or along the edges of slow-moving water. They are found throughout the eastern and central United States. Characters unique to this group include a large hump between membranous <u>meso</u><u>-</u> and <u>metanota</u>, the especially long <u>spinneret</u>, and flattened <u>tarsi</u> longer than the <u>tibiae</u>."
  },
  {
    "id": 307,
    "description": "<em>Phylocentropus </em>is the only genus in the family Dipseudopsidae in North America, with 5 species occurring here. <u>Larvae</u> make branching tube-like retreats buried in sand or soft sediment, the tips of the branches poke above the sediment. They tend to live in pools or along the edges of slow-moving water. They are found throughout the eastern and central United States. A large, movable <u>spinneret</u> is used to produce silk and shore up the sides of the retreat. Characters unique to this group include a large hump between membranous <u>meso</u><u>-</u> and <u>metanota</u>, and flattened <u>tarsi</u> longer than their <u>tibiae</u>."
  },
  {
    "id": 308,
    "description": "Members of the family Glossosomatidae are often known as Saddle-case Makers. The cases are unique from those of other caddisflies in that they are domed like a turtle shell with a <u>transverse</u> strap of finer stones across the bottom, leaving the underside open on both ends. They tend to prefer rocky bottomed riffles. <u>Larvae</u> gather small rocks from the bottom of the stream and glue them together with silk from their mouths to form their cases. During feeding, a <u>larva</u> attaches a strand of silk to a large rock and to the upstream end of the case as a tether. The openings of the underside of the case are interchangeable so that the <u>larva</u> then turns around in the case to point its head through the downstream opening. It then slows swings upstream on the top of the rock, pivoting on its tethered thread, <u>scraping</u> and eating the algae and biofilm from the rock as it moves. Once the untethered end faces directly upstream, it anchors that end with silk, reverses itself within its case, cuts the thread from the original tether (which is now downstream), and repeats the swiveling and feeding process from the now-freed end of its case, progressing into the current by alternating the two ends of the case like a pair of mountain climbers ascending a rock face."
  },
  {
    "id": 309,
    "description": null
  },
  {
    "id": 310,
    "description": null
  },
  {
    "id": 311,
    "description": null
  },
  {
    "id": 312,
    "description": null
  },
  {
    "id": 313,
    "description": null
  },
  {
    "id": 314,
    "description": null
  },
  {
    "id": 315,
    "description": null
  },
  {
    "id": 316,
    "description": "Over 60 North American species from two genera are recognized in this family. Members of this group are most commonly found in mountainous regions in small streams or along the edges of lakes and large rivers. They are <u>shredding detritivores</u>, feeding on decaying plant matter in the water; they also have been reported scavenging salmon carcasses. The <u>larvae</u> construct cases of varying materials and shapes, however, a four-sided case constructed of square pieces of leaves is most commonly found. This family is easily identifiable, as these are the only caddisflies with the small antennae situated directly next to the eyes."
  },
  {
    "id": 317,
    "description": "There are about 75 North American species in this commonly encountered genus. <u>Larvae</u> can be up to 12.5 mm long. Cases are usually made of plant materials, often four-sided, made of rectangular strips of bark or leaves; however sometimes of sand or plant stems; young <u>larvae</u> often build cases of sand, then transition to leaves as they grow. They prefer small or intermittent headwater streams and springs. They are primarily <u>shredding detritivores</u>."
  },
  {
    "id": 318,
    "description": "This is the only group of caddisflies with “long” antennae. In <u>larvae</u>, the antennae are “6 times as long as wide”, meaning they are small, thread-like antennae, as compared to most <u>larval</u> caddisfly antennae which are barely visible as small nubs. As adults, the antennae are extremely long, much longer than the animal, especially in males. This is also one of the few families with bright colors on the wings, thought to be mainly day fliers. These traits may be due to sexual selection, much like a male peacock with his showy feathers. The <u>larvae</u> are relatively <u>larvae</u> when mature, only ranging 7–15 mm. Representatives of this family can be found in any still or flowing water habitats, and create widely varying cases of plant or mineral materials or even pure silk, have varying habits (<u>climbers</u>, <u>sprawlers</u>, <u>clingers</u>, <u>swimmers</u>), and eat nearly every type of food, all of which are more particular at the genus and species levels of taxonomic refinement."
  },
  {
    "id": 319,
    "description": "Formerly <em>Athripsodes </em>(in part). There are about 36 North American species. The <u>larvae</u> tend to be rather short and wide, especially at the first abdominal segment, and this is reflected in the shapes of their cases as well. The case is made of fine sand grains or plant materials and tends to be wide at the opening and narrower at the posterior end. It sometimes has flanges or wing-like expansions at the sides and over the head, allowing the case to sit on top of loose sand without sinking, much like how snowshoes prevent sinking into deep snow, or to present a low profile on rocks in fast current. Some species are predators of freshwater sponges; these species have silken cases embedded with sponge spicules. Others are herbivores and detritivores. These <u>larvae</u> can be found in <u>lentic</u> or <u>lotic</u> habitats depending on the species. <u>Larvae</u> of this group can be identified by a distinctive pair of dark, reverse-parenthesis-like bars on the <u>mesonotum</u> (<u>concave</u> <u>laterally</u>)."
  },
  {
    "id": 320,
    "description": null
  },
  {
    "id": 321,
    "description": null
  },
  {
    "id": 322,
    "description": null
  },
  {
    "id": 323,
    "description": null
  },
  {
    "id": 324,
    "description": null
  },
  {
    "id": 325,
    "description": null
  },
  {
    "id": 326,
    "description": null
  },
  {
    "id": 327,
    "description": "This family includes 1,484 species globally and 76 species in North American. Their preferred habitat is riffles, where their nets can be found on the undersides of rocks. The <u>larvae</u> spin wind-sock like nets with ultrafine mesh that are held open by the current, which they use to filter feed on very small bits of detritus, algae, and even small animals. These nets are positioned beneath the rocks and have the smallest mesh size known of all the net-spinning caddisflies. When removed from water, the nets collapse and look like brown slime. This group is unique in that it is the only group with a membranous <u>labrum</u> that is expanded along the <u>distal</u> edge, giving it a T-shape. However, sometimes when placed in ethanol or other preservatives, this soft <u>labrum</u> gets sucked into the mouth where it cannot be seen. The most common species, <em>Dolophilodes distincta</em>, can emerge as adults year-round; however, females that emerge during the winter have very short stubby wings and are flightless."
  },
  {
    "id": 328,
    "description": "The <u>larvae</u> of this species are usually yellow or light orange in color, but turn white when preserved in ethanol. They live in warmer rivers where the <u>larvae</u> spin net-like retreats, used to filter detritus from the water for food. Sometimes the mesh is uniformly spaced, like other net spinners, but usually the mesh of these retreats is dense and irregular. The nets also tend to be clustered in groups of 5 or 6, and are found in crevices on the undersides of rocks, where the water can channel through. Fly-fishing enthusiasts sometimes tie their flies to mimic these <u>larvae</u>; they refer to them as yellow or orange caddisworms. The <u>larvae</u> can be distinguished from other genera in the family by the very asymmetrical, large notch at the anterior margin of the <u>frontoclypeus</u>. "
  },
  {
    "id": 329,
    "description": null
  },
  {
    "id": 330,
    "description": null
  },
  {
    "id": 331,
    "description": null
  },
  {
    "id": 332,
    "description": null
  },
  {
    "id": 333,
    "description": null
  },
  {
    "id": 334,
    "description": null
  },
  {
    "id": 335,
    "description": "This family includes 5 North American genera with 17 species. The <u>larvae</u> often build tubular retreats, the tops of the structures are camouflaged with silk and pieces of detritus and pieces of substrate. They use the retreat to collect and gather food. As they add to the length of the tube to extend their grazing space, they occasionally harvest the old portion where they have cultivated <u>periphyton</u>. The <u>larvae</u> can be distinguished from other similar looking groups (such as the Philopotamidae) because the Psycomyiidae are the only caddisfly larvae with the <u>foretrochantins</u> (pair of hard projections between fore<u>coxae</u> and head) hatchet-shaped."
  },
  {
    "id": 336,
    "description": null
  },
  {
    "id": 337,
    "description": "Psychomyia is represented by 3 North American species. <u>Larvae</u> live usually in cool streams on rocks and logs, where they build meandering silken tubes much longer than the <u>larva</u>. These tubes are covered with sand and fine detritus. They scrape and gather diatoms and other fine organic matter from the substrate around the openings of their tubes and sometimes <u>larvae</u> of other insects. Occasionally they harvest fungi and bacteria cultivated in the older end of the tube."
  },
  {
    "id": 338,
    "description": "The <u>larvae</u> of Rhyacophilidae exhibit a variety of feeding strategies as young instars, feeding as <u>collector-gatherers</u>, <u>scaper-grazers</u>, or <u>shredder-herbivores</u>, but mature <u>larvae</u> are mainly free-ranging, <u>engulfing predators</u>. <u>Larvae</u> are free-living, meaning that they do not live in a case or retreat, but simply move throughout the environment, <u>clinging</u> to the substrate and chasing prey. Before pupation, a rock shelter is built and a semipermeable cocoon is spun inside. <u>Larvae</u> are often green in color, and often have well-defined segments, giving the body a beaded appearance. "
  },
  {
    "id": 339,
    "description": "<em>Rhyacophila </em>is the only genus from the family Rhyacophilidae in the United States east of the Rocky Mountains; it is widespread except less common in the Great Plains (absent from southern Great Plains). The <u>larvae</u> exhibit a variety of feeding strategies, they may be <u>engulfing predators</u>, especially as mature <u>larvae</u>, but also <u>collector-gatherers</u>, <u>scraper-grazers</u>, or <u>shredder-herbivores</u>. <u>Larvae</u> are free-living, meaning that they do not live in a case or retreat, but simply move throughout the environment, <u>clinging</u> to the substrate and pursuing prey. Before pupation, they build a rock shelter and spin a semipermeable cocoon inside it. <u>Larvae</u> are often, but not always, green in color, and often have well-defined segments, giving the body a beaded appearance. They can be readily identified using the following characters: <u>sclerotized</u> <u>pronotum</u>, membranous <u>meso</u><u>-</u> and <u>metanota</u>, abdominal <u>tergum</u> IX with a <u>sclerite</u>, and <u>anal prolegs</u> free, not closely fused to segment IX."
  },
  {
    "id": 340,
    "description": null
  },
  {
    "id": 341,
    "description": null
  },
  {
    "id": 342,
    "description": "Previously Uenodiae, the family was split into two families Thremmatidae and Uenoidae, with uenoids all western. Of the North American Thremmatidae, there are only two genera, <em>Neophylax </em>(widespread except for in the Southwest) and <em>Oligophlebodes </em>(Western and Northcentral States). The <u>larvae</u> create robust rock cases; eastern species add large <u>lateral</u> ballast stones, similar to cases of Goeridae. Eastern species typically feed by <u>scraping</u> <u>periphyton</u> from rocks. They prefer <u>lotic-erosional</u> habitats and tend to be found clinging to rocks and other substrates. The adults tend to emerge in the fall, and their yellow and brown colors often help them to blend with the autumn foliage."
  },
  {
    "id": 343,
    "description": "<em>Neophylax </em>is the only genus of Thremmatidae occurring in the East. The genus includes 29 species in North America, most of them in the East. <u>Larvae</u> are obligate <u>scrapers</u> of diatoms, feeding mainly on the tops of stones in fast water. They are somewhat protected from fish predation by their stout stone cases with ballast stones added <u>laterally</u> to help prevent being swept downstream in the current. When preparing to pupate, they often aggregate on the undersides of larger rocks, each fastening the case to the rock and sealing each end of its case with a small stone. Many species prepare their cases for pupation in spring, but undergo diapause until fall before they actually pupate."
  },
  {
    "id": 344,
    "description": null
  },
  {
    "id": 345,
    "description": null
  },
  {
    "id": 346,
    "description": "<em>Lanthus </em>includes only 2 North American species. <u>Larvae</u> live in sandy or silty pools of rocky spring-fed brooks, <u>burrowing</u> shallowly to wait for prey to wander near and be snatched by the retractile <u>labium</u>. When removed from the water, they feign death for several minutes and are apt to be missed by the careless investigator."
  },
  {
    "id": 347,
    "description": null
  },
  {
    "id": 348,
    "description": "This is the largest North American family of aquatic beetles, including over 400 from about 35 genera. Both adults and larvae can be found in almost any aquatic habitat, even in brackish water; however they are most often found lentic freshwater systems. The larvae tend to be climbers on rooted plants and swimmers; adults are swimmers and divers. Both larvae and adults are engulfing predators of small invertebrates and fish, and are sometimes cannibalistic. Larvae have a channel along their mandibles to help them take in fluids from their prey. Their bite is quite painful. Despite living directly in the water adults and larvae of most species must regularly resurface for air."
  },
  {
    "id": 349,
    "description": "This is a large family, including 24 genera and close to 100 species. They are known as riffle beetles, due to their common occurrence in habitats with fast flowing water and high oxygen levels. Both larvae and adults are slow-moving clingers, and feed by scraping or collecting and gathering periphyton and detritus from rocks and other substrate. The larvae get their oxygen directly from gills that can be retracted into the abdomen. Adults have an effective plastron and usually do not need to surface for air. Elmid larvae are unusual in that they have up to 8 instars, whereas most beetle larvae only shed 3 times."
  },
  {
    "id": 350,
    "description": "Adult members of the family Gyrinidae are very unique in that their compound eyes are divided into separate dorsal and ventral segments, giving them a \"four eyed\" appearance. This allows them to see both above and below the water at the same time. Their nickname, “whirligig beetles” was given to the adult beetles due to their behavior of zipping around in swirling motions along the surface of the water, although they are also good divers. Both the larvae and adults of this family are aquatic, are typically found in quiet water of lentic or lotic habitats. The pupae are terrestrial. Both adults and larvae are engulfing predators, adults typically feeding on small invertebrates at or near the surface of the water."
  },
  {
    "id": 351,
    "description": "This family includes over 70 North American Species. Both the larvae and adults of this family are aquatic, they can be found in lentic-littoral habitats, but some species can be found in lotic-depositional habitats as well. They are good climbers among the rooted plants found in their habitats, adults can be strong swimmers as well. Both life stages have similar feeding habits, they tend to be shredding or piercing herbivores, but some are engulfing predators. The larvae sometimes overwinter in moist soil before molting into adults. The adults must frequently resurface for air, however the larvae get all of their oxygen from the water."
  },
  {
    "id": 352,
    "description": "Hydrophilidae is the second largest family of North American aquatic beetles, including roughly 200 species. The larvae and adults are aquatic or semiaquatic; the pupae are terrestrial. They prefer lentic waters such as ponds and shallow lakes, or sometimes in pools at edges of streams. Unlike most beetles, the adults of this family tend to swim by alternating strokes with their hind legs, rather than moving them in unison. Also atypical, they have a habit of surfacing for air head first. The adults have a well-developed plastron to hold air underwater, in well oxygenated water it serves as a gill. Larvae frequently surface to take in air from the end of the abdomen. Larvae are usually predators of other invertebrates, and can even break snail shells with their strong jaws. However, only a small number of adults are predators, most are omnivores or detritivores."
  },
  {
    "id": 354,
    "description": "Large spinneret, half as long as head. "
  },
  {
    "id": 468,
    "description": "Larvae and adult with needle-like or straw-like beak (except for Corixidae which has sieve-like mouth parts)."
  },
  {
    "id": 472,
    "description": "Adults with hemelytra (forewings typically leathery or hard basally and translucent and flexible apically)."
  },
  {
    "id": 473,
    "description": "Similar in appearence to Belostomatidae (giant water bugs) except that margins of eyes are contiguous with anterior margin of head in Naucoridae; i.e. the eyes are right against the edge of the head."
  },
  {
    "id": 474,
    "description": "Forelegs are raptorial, suitable for use in predation, with broad femora, and weakly convex dorsally."
  },
  {
    "id": 475,
    "description": "Larvae and adult with needle-like or straw-like beak (except for corixidae)."
  },
  {
    "id": 476,
    "description": "Adults with hemielytra (forewings typically leathery or hard basally and translucent and flexible apically)."
  },
  {
    "id": 477,
    "description": "Similar in appearence to Belostomatidae (giant water bugs) except that margins of eyes are contiguous with anterior margin of head in Naucoridae; i.e. the eyes are right against the edge of the head."
  },
  {
    "id": 478,
    "description": "Forelegs are raptorial, suitable for use in predation, with broad femora, and weakly convex dorsally."
  },
  {
    "id": 479,
    "description": "Similar in appearence to Belostomatidae (giant water bugs) except that margins of eyes are contiguous with anterior margin of head in Naucoridae; i.e. the eyes are right against the edge of the head."
  },
  {
    "id": 480,
    "description": "Head and body dorsoventrally flattened (flattend from top to bottom). "
  },
  {
    "id": 481,
    "description": "Lateral margins of head visible beside the eyes."
  },
  {
    "id": 482,
    "description": "Head and body dorsoventrally flattened (flattend from top to bottom). "
  },
  {
    "id": 483,
    "description": "Lateral margins of head visible beside the eyes."
  },
  {
    "id": 484,
    "description": "Usually with three tails (two cerci and one caudal filament) but sometimes with only 2 (without  caudal filament)."
  },
  {
    "id": 485,
    "description": "Always with only one tarsal claw per leg."
  },
  {
    "id": 486,
    "description": "Always with only one tarsal claw per leg."
  },
  {
    "id": 487,
    "description": "Usually with three tails (two cerci and one caudal filament), but sometimes only two tails (without caudal filament)."
  },
  {
    "id": 488,
    "description": "Gills on abdominal segments 1–6 have truncate distal ends; the ends are often blunt or squared off, but always with at least part of apical edge straight."
  },
  {
    "id": 489,
    "description": "Gills on abdominal segment 7 are reduced to slender filaments, much skinnier than gills on preceeding segments."
  },
  {
    "id": 490,
    "description": "Gills on abdominal segments 1–6 have truncate distal ends; the ends are often blunt or squared off, but always with at least part of apical edge straight."
  },
  {
    "id": 491,
    "description": "Gills on abdominal segment 7 are reduced to slender filaments, much skinnier than gills on preceeding segments."
  },
  {
    "id": 492,
    "description": "Gills on abdominal segments 1–6 have truncate distal ends; the ends are often blunt or squared off, but always with at least part of apical edge straight."
  },
  {
    "id": 493,
    "description": "Gills on abdominal segment 7 are reduced to slender filaments, much skinnier than gills on preceeding segments."
  },
  {
    "id": 494,
    "description": "Femora (thighs) and tibia (shins) of forelegs have long setae along the inner margins. "
  },
  {
    "id": 495,
    "description": "Larvae with streamlined, minnow-like body shape."
  },
  {
    "id": 496,
    "description": "Always with only one tarsal claw per leg."
  },
  {
    "id": 497,
    "description": "Usually with three tails (two cerci and one caudal filament,) but sometimes only 2 (without caudal filament)."
  },
  {
    "id": 498,
    "description": "Femora and tibia of forelegs have long setae along the inner margins. "
  },
  {
    "id": 499,
    "description": "Larvae with streamlined, minnow-like body shape."
  },
  {
    "id": 500,
    "description": "Usually with three tails (two cerci and one caudal filament,) but sometimes only 2 (without caudal filament)."
  },
  {
    "id": 501,
    "description": "Always with only one tarsal claw per leg."
  },
  {
    "id": 502,
    "description": "Femora and tibia of forelegs have long setae along the inner margins. "
  },
  {
    "id": 504,
    "description": "Larvae with pair of anal prolegs (fleshy nubs), each with single hook, located on last abdominal segment."
  },
  {
    "id": 505,
    "description": "Caddisfly (Trichoptera) larvae can be free-living, in fixed retreats, or in cases made of sand, rocks, or plant material. Larae of this caddisfly family, Hydropsychidae, are found in fixed retreats."
  },
  {
    "id": 506,
    "description": "Pro-, meso-, and metanota entirely covered by sclerites."
  },
  {
    "id": 507,
    "description": "Abdomen with rows of branched gills ventrally."
  },
  {
    "id": 508,
    "description": "Conspicuous tuft or fan of long hairs at base of each anal proleg (fleshy nubs at posterior end of body)."
  },
  {
    "id": 509,
    "description": "Larvae build stationary retreats of silk, detritus and rock fragments, often used for filter feeding."
  },
  {
    "id": 510,
    "description": "Frontoclypeus is usually notched, and usually with a scalloped appearance. In the rare case that the frontoclypeus is not notched, the intersegmental sclerites will be small. "
  },
  {
    "id": 511,
    "description": "These sclerites are usually small in this genus. In the rare case that they are large, the frontoclypeus will be notched. Look for the pair of intersegmental sclerites underneath the intersegmental fold (“fat roll” between segments) on the ventral side between the first two sets of legs. Try gently arching the specimen’s back, and they should “pop” out. "
  },
  {
    "id": 512,
    "description": "Abdominal segment 9 (the last segment) with either one tail or pair of anal prolegs (fleshy nubs), each with two hooks."
  },
  {
    "id": 513,
    "description": "Seven or eight pairs of filaments or gills laterally on abdomen (slender conical appendages on sides of abdomen)."
  },
  {
    "id": 514,
    "description": "Abdominal segments 1–8 with paired, 2-segemented, lateral filaments (slender conical appendages on sides of abdomen)"
  },
  {
    "id": 515,
    "description": "End of abdomen has a pair of anal prolegs (fleshy nubs at the end of the abdomen), each bearing a 2 claws. "
  },
  {
    "id": 516,
    "description": "Abdominal ventral gill tufts absent. "
  },
  {
    "id": 517,
    "description": "Respiratory tubes much shorter than anal prolegs."
  },
  {
    "id": 537,
    "description": "There are at least 72 genera with 464 species of shore and brine flies occurring in North America. Usually they live in lentic-littoral habitats among vascular hydrophytes or floating algal mats, but they are also found on marine shores or on lotic margins, sometimes in puddles, and sometimes in extreme habitats such as thermal springs, high salinity lakes, or pools of crude or waste petroleum. Typically they are burrowers or sprawlers, but sometimes climbers or planktonic. They feed as collectors-gatherers (often of dung or decomposing snails or other carrion), leaf-mining shredders-herbivores, scrapers, or engulfing predators."
  },
  {
    "id": 727,
    "description": "Beetles are the most diverse group of plants or animals on earth, with over 300,000 species. More than 16,000 of these species live in water for at least part of their lives. Beetles have egg, <u>larval</u>, pupal, and adult life stages. For different species, one or all of egg, <u>larval</u>, or adult life stages live in the water, but usually the pupae are terrestrial. Some <u>larvae</u> have slender gills for breathing underwater, others simply take oxygen through the soft cuticle or pierce stems or roots of aquatic plants. Adults do not have gills, but have various other strategies--Some hold an air bubble against breathing holes on the sides of their bodies and replenish the bubble periodically at the water surface; others maintain a thin layer of permanently trapped air over those breathing holes. Aquatic beetles can be found in water that is either flowing or still, and some even thrive in brackish environments."
  },
  {
    "id": 728,
    "description": "This is the largest North American family of aquatic beetles, including over 400 species in about 35 genera. Both adults and <u>larvae</u> can be found in almost any aquatic habitat, even in <u>brackish</u> water; however, they are most often found in <u>lentic</u> freshwater systems. The <u>larvae</u> tend to be <u>climbers</u> on rooted plants and <u>swimmers</u>; adults are <u>swimmers</u> and <u>divers</u>. Both <u>larvae</u> and adults are <u>engulfing predators</u> of small invertebrates and fish, and are sometimes cannibalistic. Some <u>larvae</u> have a channel along the inner margin of each mandible to help them ingest fluids from their prey. Their bite is quite painful. Despite living in the water, adults and <u>larvae</u> of most species must regularly resurface for air."
  },
  {
    "id": 729,
    "description": "This large genus includes 106 species in North America. Adults and <u>larvae</u> inhabit both fast and slow streams and <u>littoral</u> zones of <u>lentic</u> habitats. They are <u>piercing predators</u>."
  },
  {
    "id": 732,
    "description": "This is a large family, including 24 genera and close to 100 species. They are known as riffle beetles, due to their common occurrence in habitats with fast-flowing water and high oxygen levels. Both <u>larvae</u> and adults are slow-moving <u>clingers</u> that feed by <u>scraping</u> or <u>collecting and gathering</u> <u>periphyton</u> and detritus from surfaces of rocks and other substrates. The <u>larvae</u> get their oxygen directly from gills that can be retracted into the end of the abdomen. Adults have an effective plastron and usually do not need to surface for air. Elmid <u>larvae</u> are unusual in that they have up to 8 instars, whereas most beetle <u>larvae</u> molt only 3 times."
  },
  {
    "id": 733,
    "description": "This is a widespread genus with 13 North American species. <u>Larvae</u> and adults live in fast and slow portions of streams, <u>clinging</u> to substrate. <u>Larvae</u> are scrapers of <u>periphyton</u> on rock surfaces."
  },
  {
    "id": 739,
    "description": "Adult members of the family Gyrinidae are unique in that their <u>compound eyes</u> are divided into separate <u>dorsal</u> and <u>ventral</u> portions, giving them a \"four-eyed\" appearance. This allows them to see both above and below the water at the same time. Their nickname, “whirligig beetles” was given to the adult beetles due to their behavior of zipping around in swirling motions along the surface of the water, although they are also good <u>divers</u>. Both the <u>larvae</u> and adults of this family are aquatic, typically found in quiet water of <u>lentic</u> or <u>lotic</u> habitats. The pupae are terrestrial. Both adults and <u>larvae</u> are <u>engulfing predators</u> of small invertebrates, but the adults may also be surface film scavengers. <u>Larvae</u> live and feed on the bottom or climb on rooted plants."
  },
  {
    "id": 740,
    "description": "This genus includes about 41 species in North America North of Mexico, and is widespread across eastern Noth America. <em>Gyrinus</em> includes most of the smaller species in the Gyrinidae family, while <em>Dineutus</em> contains the larger species. In order to deter predators, members of the genus <em>Gyrinus</em> often give off a foul smell and taste when disturbed. Adults and <u>larvae</u> prefer <u>lotic-depositional</u> habitats along the margins and pools of flowing water. Both <u>larvae</u> and adults are <u>engulfing predators</u>, and scavengers of small organisms, however, unlike the <u>larvae</u>, the adults usually hunt at the water’s surface."
  },
  {
    "id": 743,
    "description": "This family includes over 70 North American species. Both the <u>larvae</u> and adults of this family are aquatic. They can be found in <u>lentic</u>-<u>littoral</u> or <u>lotic-depositional</u> habitats. They are good <u>climbers</u> among the rooted plants found in their habitats. Adults can be strong swimmers as well. Both life stages have similar feeding habits; they tend to be <u>shredding</u> or <u>piercing herbivores</u>, but some are <u>engulfing predators</u>. The <u>larvae</u> sometimes overwinter in moist soil before molting into pupae and then adults. The adults must frequently resurface for air; however, the <u>larvae</u> get all of their oxygen from the water."
  },
  {
    "id": 744,
    "description": "At least 18 species of this widespread genus occur in different regions of North America. <u>Larvae</u> and adults are <u>piercing</u> and <u>shredding herbivores</u> and <u>predators</u>, living mostly in <u>lentic</u> habitats, <u>clinging</u> and <u>climbing</u> on rooted plants, occasionally in fast-flowing water."
  },
  {
    "id": 745,
    "description": "Hydrophilidae is the second largest family of North American aquatic beetles, including more than 250 species. The <u>larvae</u> and adults are aquatic or semiaquatic; the pupae are terrestrial. They prefer <u>lentic</u> waters such as ponds and shallow lakes, or sometimes pools at edges of streams. Unlike most beetles, the adults of this family tend to swim by alternating strokes with their <u>hind legs</u>, rather than moving them in unison. Also atypical, they have a habit of surfacing for air head first, breaking the water surface tension and accessing air with their specially formed antennae. The adults have a well-developed plastron to hold air underwater; in well-oxygenated water this thin layer of air serves as a gill. <u>Larvae</u> frequently surface to take in air from the end of the abdomen. <u>Larvae</u> are usually predators of other invertebrates, and can even break snail shells with their strong jaws. However, only a small number of adults are predators, most are omnivores or detritivores. "
  },
  {
    "id": 746,
    "description": "The North American fauna includes at least 14 species of this widespread genus. <u>Larvae</u> are predators climbing among rooted plants in <u>lentic</u> habitats and slow-flowing streams."
  },
  {
    "id": 747,
    "description": "In North America North of Mexico this family includes 6 genera and about 16 species. Adults and pupae of this family are terrestrial, except for females enter the water to lay eggs. The <u>larvae</u>, however are fully aquatic. They are very distinctive, flat, shield-shaped larvae, almost trilobite-like in appearance, with the legs only visible from the <u>ventral</u> side. They are almost always found stuck (suction cup-like) to the sides and tops of rocks, where they feed by <u>scraping</u> <u>periphyton</u> and other food off of the substrate."
  },
  {
    "id": 748,
    "description": "The <u>larvae</u> of this genus are aquatic. They are almost always found stuck (suction-cup-like) to the sides and tops of rocks, where they feed by <u>scraping</u> <u>periphyton</u> and other food off the substrate. They are very distinctive, flat, shield-shaped <u>larvae</u>, almost trilobite-like in appearance, with the legs only visible from the <u>ventral</u> side <em>Psephenus </em>and <em>Ectopria </em>are the two most common genera in Psephenidae, and can be easily confused, however, they can be readily separated by the presence of abdominal gills <u>ventrally</u> on <em>Psephenus</em>."
  },
  {
    "id": 751,
    "description": null
  },
  {
    "id": 752,
    "description": null
  },
  {
    "id": 753,
    "description": null
  },
  {
    "id": 754,
    "description": null
  },
  {
    "id": 755,
    "description": null
  },
  {
    "id": 756,
    "description": null
  },
  {
    "id": 757,
    "description": null
  },
  {
    "id": 758,
    "description": "<u>Larvae</u> and adults occur in slow-moving streams and among rooted plants of <u>lentic</u> habitats; both life stages are <u>piercing predators</u>."
  },
  {
    "id": 761,
    "description": null
  },
  {
    "id": 764,
    "description": null
  },
  {
    "id": 767,
    "description": null
  },
  {
    "id": 770,
    "description": null
  },
  {
    "id": 773,
    "description": null
  },
  {
    "id": 776,
    "description": null
  },
  {
    "id": 779,
    "description": null
  },
  {
    "id": 782,
    "description": null
  },
  {
    "id": 783,
    "description": null
  },
  {
    "id": 784,
    "description": null
  },
  {
    "id": 787,
    "description": null
  },
  {
    "id": 790,
    "description": "Usually used to describe a small secondary structure. For example an accessory flagellum refers to a small flagellum attached to the antenna, or an accessory hook often refers to a small hook protruding from a larger anal hook."
  },
  {
    "id": 791,
    "description": "Proleg bearing hooks and located on the last segment of the abdomen, usually paired"
  },
  {
    "id": 792,
    "description": "before the apex, ie. anteapical claws have the claw inserted basal to the tip of the tarsus."
  },
  {
    "id": 793,
    "description": "the most distal point of an object. Plural form is apices."
  },
  {
    "id": 794,
    "description": "toward the apex and toward the side."
  },
  {
    "id": 795,
    "description": "the part of an appendage that is near the body."
  },
  {
    "id": 796,
    "description": "with two openings."
  },
  {
    "id": 797,
    "description": "fungus, algae, and bacteria that forms a slippery, inconspicuous film over rocks and other substrates."
  },
  {
    "id": 798,
    "description": "bent or curved."
  },
  {
    "id": 799,
    "description": "refers to slightly salty water, such as in an estuary or salt marsh."
  },
  {
    "id": 800,
    "description": "a ridge, or keel. Plural form is carinae."
  },
  {
    "id": 801,
    "description": "pertaining to the posterior end of the abdomen."
  },
  {
    "id": 802,
    "description": "in Hemiptera, a large furrow on the forewing separating the clavas (posterior when the wings are spread) and the ebolium (anterior when the wings are spread)."
  },
  {
    "id": 803,
    "description": "club-like, enlarged at the distal end."
  },
  {
    "id": 804,
    "description": "in Hempiptera, when the wings are spread, it is the part of the wing posterior to the claval furrow; the wing minus the ebolium. "
  },
  {
    "id": 805,
    "description": "neck, posterior-most portion of the head in beetle larvae."
  },
  {
    "id": 806,
    "description": "curved inward, caved in."
  },
  {
    "id": 807,
    "description": "easily visible."
  },
  {
    "id": 808,
    "description": "curved outward, rounded."
  },
  {
    "id": 809,
    "description": "the leg segment nearest the body. Plural form is coxae."
  },
  {
    "id": 810,
    "description": "rounded projection."
  },
  {
    "id": 811,
    "description": "scalloped, having a margin with repeated indentations and rounded projections."
  },
  {
    "id": 812,
    "description": "small tooth."
  },
  {
    "id": 813,
    "description": "finger-like."
  },
  {
    "id": 814,
    "description": "the part of an appendage that is furthest away from the body."
  },
  {
    "id": 815,
    "description": "enlarged, widely opened."
  },
  {
    "id": 816,
    "description": "common name for a subimago mayfly."
  },
  {
    "id": 817,
    "description": "any line where sclerites of the exoskeleton will separate during the molting process. These are found mostly on the midline of the top or underside of the head and on the midline of the top of the thorax."
  },
  {
    "id": 818,
    "description": "when a larva hatches from an egg."
  },
  {
    "id": 819,
    "description": "hardened shell-like forewings of a beetle that cover the hind wings. Plural form is elytra."
  },
  {
    "id": 820,
    "description": "in Hemiptera, when the wings are spread, it is the part of the wing anterior to the claval furrow. If the wings are closed, it is the part of the wings nearest the lateral margin, not including the clavus. "
  },
  {
    "id": 821,
    "description": "the thigh. This is the second most basal leg segment, after the coxa."
  },
  {
    "id": 822,
    "description": "thread-like."
  },
  {
    "id": 823,
    "description": "thread-like protuberances."
  },
  {
    "id": 824,
    "description": "with thread-like filaments."
  },
  {
    "id": 825,
    "description": "insects that feed by sifting suspended organic matter (including detritus, diatoms, algae, and sometimes meiofauna), from the water."
  },
  {
    "id": 826,
    "description": "a part of a propleuron of a caddisfly that projects forward from the base of a foreleg."
  },
  {
    "id": 827,
    "description": "punctate, or pitted, with evenly distributed indentations."
  },
  {
    "id": 828,
    "description": "In mayflies of the family Ephemeridae, when looking dorsally, a cuticular lobe projecting forward from the anteriormost margin of the face."
  },
  {
    "id": 829,
    "description": "the face or front middle region of the head, usually defined by a pair of curved lines extending forward from the anterior end of the median dorsal ecdysial line."
  },
  {
    "id": 830,
    "description": "spindle-shaped or football-shaped, tapered at both ends."
  },
  {
    "id": 831,
    "description": "cheek. Plural form is genae."
  },
  {
    "id": 832,
    "description": "without hair/setae."
  },
  {
    "id": 833,
    "description": "part of the mouth parts/ labrum, pair of lobes used much like a tongue. Smaller, and just inside of glossae. See image."
  },
  {
    "id": 834,
    "description": "a type of insect where the life cycle includes egg, larval, and adult stages, but lacks a pupal stage."
  },
  {
    "id": 835,
    "description": "an adult insect."
  },
  {
    "id": 836,
    "description": "difficult to see."
  },
  {
    "id": 837,
    "description": "looking at a Simuliid larva, this refers to the small teeth between the larger teeth on the hypostoma"
  },
  {
    "id": 838,
    "description": "between segments."
  },
  {
    "id": 839,
    "description": "where the membranous tissue bubbles up to fill the space between segments. In some caddisfly larvae this looks like a “fat roll.”"
  },
  {
    "id": 840,
    "description": "a ridge, or carina."
  },
  {
    "id": 841,
    "description": "extendable mask-like mouth part of a dragonfly or damselfly nymph, used to capture prey. "
  },
  {
    "id": 842,
    "description": "lower lip."
  },
  {
    "id": 843,
    "description": "inside edge of maxilla."
  },
  {
    "id": 844,
    "description": "a flat, plate-like structure. Plural form is lamellae."
  },
  {
    "id": 845,
    "description": "plate-like or flap-like."
  },
  {
    "id": 846,
    "description": "lance-like or long and skinny."
  },
  {
    "id": 847,
    "description": "immature feeding stage of an insect. Plural form is larvae. Latin=terrifying mask."
  },
  {
    "id": 848,
    "description": "describes an animal that lives in still, low oxygenated water."
  },
  {
    "id": 849,
    "description": "describes an animal that lives in flowing, highly oxygenated water."
  },
  {
    "id": 850,
    "description": "second pair of jaws. Plural form is maxillae."
  },
  {
    "id": 851,
    "description": "in the middle, centered."
  },
  {
    "id": 852,
    "description": "small animals, usually small invertebrates."
  },
  {
    "id": 853,
    "description": " part of the base of the labium, also referred to as the anterior ventral apotome."
  },
  {
    "id": 854,
    "description": "prefix referring to a structure on the second thoracic segment behind the head."
  },
  {
    "id": 855,
    "description": "dorsal side of the second thoracic segment."
  },
  {
    "id": 856,
    "description": "the lateral portion of the middle thoracic segment."
  },
  {
    "id": 857,
    "description": "prefix referring to a structure on the third thoracic segment behind the head."
  },
  {
    "id": 858,
    "description": "fused frons, clypeus, and labrum; anteriormost margin of the face in beetle larvae."
  },
  {
    "id": 859,
    "description": "small organisms that live in the surface layers of water."
  },
  {
    "id": 860,
    "description": "dorsal (top) side of a given thoracic segment. Plural form is nota."
  },
  {
    "id": 861,
    "description": "larval or immature feeding stage of an insect, usually of non-holometabolous insects."
  },
  {
    "id": 862,
    "description": "a gill that covers the gill(s) on the next segment(s); usually these types of gills are flat and positioned on the dorsal (top) side of the abdomen."
  },
  {
    "id": 863,
    "description": "The paired and segmented appendages around the mouth arising from maxillae (one palp on each maxilla) and the labium (one pair); maxillary palps are the larger pair. Plural form is palps. See also palpus."
  },
  {
    "id": 864,
    "description": "The paired and segmented appendages around the mouth arising from maxillae (one palpus on each maxilla) and the labium (one pair); maxillary palpi are the larger pair. Plural form is palpi. See also palp."
  },
  {
    "id": 865,
    "description": "part of the mouth parts/ labrum, pair of lobes used much like a tongue. Larger and just outside of glossae. See image."
  },
  {
    "id": 866,
    "description": "looking at a Simuliid larva, as you move away from the center of the hypostoma, paralateral teeth refers to any smaller teeth just beyond the large lateral teeth."
  },
  {
    "id": 867,
    "description": "this is the knee, the leg segment found between the femora and tibia in some insects, but is usually absent."
  },
  {
    "id": 868,
    "description": "comb-like."
  },
  {
    "id": 869,
    "description": "style of flight seen in some Odonates, where the dragonfly frequently lands and rests (perches) during flight. "
  },
  {
    "id": 870,
    "description": "fungus, algae, and bacteria that forms a slippery, inconspicuous film over rocks and other substrates."
  },
  {
    "id": 871,
    "description": "stalk-like, narrow, long and skinny."
  },
  {
    "id": 872,
    "description": "fine long hairs."
  },
  {
    "id": 873,
    "description": "side of a thoracic or abdominal segment. Plural form is pleura."
  },
  {
    "id": 874,
    "description": "plume-like or feather-like."
  },
  {
    "id": 875,
    "description": "prefix referring to a structure on the first thoracic segment behind the head."
  },
  {
    "id": 876,
    "description": "fleshy unsegmented nub, often paired, used for movement (e.g., on the abdomen of most caterpillars and some flies; on the thorax of some fly larvae)."
  },
  {
    "id": 877,
    "description": "beak, or elongate mouth part as in Coleoptera: Curculionidae (Weevels) or Hemiptera (true bugs)."
  },
  {
    "id": 878,
    "description": "sa = setal area of a thoracic or abdominal segment, often marked by a sclerite or patch of setae--See image."
  },
  {
    "id": 879,
    "description": "crenulated, having a margin with repeated indentations and rounded projections."
  },
  {
    "id": 880,
    "description": "hardened plate, usually looks shiny."
  },
  {
    "id": 881,
    "description": "hardened and usually darkened."
  },
  {
    "id": 882,
    "description": "refers to insects that graze on attatched biofilm/periphyton on rocks and other substrate."
  },
  {
    "id": 883,
    "description": "below the mentum."
  },
  {
    "id": 884,
    "description": "a gill that only partially covers the gill(s) on the next segment(s)."
  },
  {
    "id": 885,
    "description": "hair. Plural form is setae."
  },
  {
    "id": 886,
    "description": "hairy; with setae."
  },
  {
    "id": 887,
    "description": "a style of flight seen in some Odonates where the dragonfly skims along the surface of the water, or more generally, they don't land frequently and seem to constantly be in flight while hunting."
  },
  {
    "id": 888,
    "description": "broad at the end, like a spatula."
  },
  {
    "id": 889,
    "description": "common name for an adult mayfly (Ephemeroptera); imago."
  },
  {
    "id": 890,
    "description": "also known as a dun (common name). A life stage unique to the Ephemeroptera; a developmental stage between larval and adult stages in which the wings have developed but the genitalia have not. In this stage the wings appear clouded (unlike the glossy appearance in the adults). The mayflies leave the water as subimagos, fly to a safe location, and then molt one more time to become an adult."
  },
  {
    "id": 891,
    "description": "groove with purely functional origin; i.e., any other groove on the body that is not a suture, such as those used for ecdysis or muscle attachment. Plural form is sulci."
  },
  {
    "id": 892,
    "description": "groove marking the line of fusion of 2 formerly distinct plates."
  },
  {
    "id": 893,
    "description": "the number of tarsal segments of each leg pair listed in order; ie. # of tarsal segments of foreleg, middle leg, hind leg."
  },
  {
    "id": 894,
    "description": "fused tarsus and claw."
  },
  {
    "id": 895,
    "description": "foot, most distal leg region (last part of a leg before the claw), often divided into subsegments."
  },
  {
    "id": 896,
    "description": "dorsal side of a given abdominal segment. Plural form is terga."
  },
  {
    "id": 897,
    "description": "tibia, shin or calf - not counting the claw, this is the second-most distal segment of the leg, proximal to the tarsus. Plural form is tibiae."
  },
  {
    "id": 898,
    "description": "internal tubes filled with air that the insect uses for breathing. Sometimes visible through the gills of aquatic insects, vein-like in appearance. "
  },
  {
    "id": 899,
    "description": "rounded projections."
  },
  {
    "id": 900,
    "description": "the underside of the animal, opposite of dorsal."
  },
  {
    "id": 901,
    "description": "triangular or rectangular sclerite between the genae on the ventral side of the head capsule of some caddisflies; sometimes divided by a single ventral ecdysal line where the genae meet in the middle, creating two smaller apotomes on either end of the suture, the anterior and posterior apotomes."
  },
  {
    "id": 902,
    "description": "severall small spines, spine-like processes, or hairs."
  },
  {
    "id": 903,
    "description": "severall small spines, spine-like processes, or hairs"
  },
  {
    "id": 904,
    "description": "having or divided into 2 plates."
  },
  {
    "id": 905,
    "description": "the front part of an insect's head below the frons to which the labrum is attached anteriorly."
  },
  {
    "id": 906,
    "description": "falling off at certain periods. For example, this term is used to describe the gills of nymphs in the family Heptageniidae (Ephemeroptera), which fall off easily when handled."
  },
  {
    "id": 907,
    "description": "on or of the upper surface."
  },
  {
    "id": 908,
    "description": "having the head vertical and the mouth facing downward. "
  },
  {
    "id": 909,
    "description": "region of the lower genae (cheeks) behind the mandible."
  },
  {
    "id": 910,
    "description": "between the eyes."
  },
  {
    "id": 911,
    "description": "upper lip, touching the clypeus in front of the mouth."
  },
  {
    "id": 912,
    "description": "pertaining to, or attached to, the side."
  },
  {
    "id": 913,
    "description": "top side of the third thoracic segment."
  },
  {
    "id": 914,
    "description": "in adult insects, a simple eye consisting of a single beadlike lens; in holometabolous larvae, simple eyes that make up the lateral eye-groups (also referred to as stemma). Plural form is ocelli."
  },
  {
    "id": 915,
    "description": "simple eyes that make up the lateral eye-groups in holometabolous larvae. Plural form is stemmata. Similar to ocelli, but in clusters of more than 3; usually present in larvae of holomotabolus insects."
  },
  {
    "id": 916,
    "description": "like the palm of the hand with processes stemming from a singular point, used in reference to gill venation."
  },
  {
    "id": 917,
    "description": "feathered; plumed; winged.  Used in reference to gill venation that appears feather-like."
  },
  {
    "id": 918,
    "description": "the top part of the first thoracic segment."
  },
  {
    "id": 919,
    "description": "clothed with soft, fine hairs."
  },
  {
    "id": 920,
    "description": "adapted for grabbing prey."
  },
  {
    "id": 921,
    "description": "in Hemiptera, the triangular part of the mesothorax placed between the bases of the hemelytra, but in some groups partially or fully overlapping them."
  },
  {
    "id": 922,
    "description": "small spine. Plural form is spinules."
  },
  {
    "id": 923,
    "description": "external opening of the tracheal system; can look like a small pore on an insect's body."
  },
  {
    "id": 924,
    "description": "a fine impressed line running lengthwise over the elytra of adult Coleoptera. Plural form is striae."
  },
  {
    "id": 925,
    "description": "in larval Coleoptera, paired processes extending from the end of the ninth abdominal tergum that are either jointed and moveable with muscles, or unjointed and immovable. Plural form is urogomphi."
  },
  {
    "id": 926,
    "description": "In amphipneustic and metapneustic Diptera larvae, disclike area with respiratory openings on the last segment."
  },
  {
    "id": 927,
    "description": "in prognathous insects, the fused lower ends of the postocciput forming a plate on the underside of the insect's head."
  },
  {
    "id": 933,
    "description": "Nymphs with mask-like labium (lower lip) covering the chewing mouth parts. This is an extendable arm-like appendage used to capture prey. It is always visible ventrally, but may be visible dorsally if it is extended."
  },
  {
    "id": 934,
    "description": null
  },
  {
    "id": 935,
    "description": "simple eyes, similar to ocelli, but in clusters of more than 3; usually present in larvae of holomotabolus insects."
  },
  {
    "id": 936,
    "description": "roughened grinding area at base of each mandible of some insects."
  },
  {
    "id": 937,
    "description": "life that needs to live on a thin film of water."
  },
  {
    "id": 938,
    "description": "water repelling."
  },
  {
    "id": 939,
    "description": "bottom side of the third thoracic segment."
  },
  {
    "id": 940,
    "description": "bottom side of the second thoracic segment. "
  },
  {
    "id": 941,
    "description": null
  },
  {
    "id": 942,
    "description": "Underside of abdomen with several pairs of prolegs (fleshy nubs) with tiny hooks."
  },
  {
    "id": 943,
    "description": " Short segmented legs present on thorax, not as long as abdomen. "
  },
  {
    "id": 944,
    "description": "Segmented legs absent from thorax, but sometimes with prolegs (fleshy nubs used for movement)."
  },
  {
    "id": 945,
    "description": "Adults with elytra (hardened forewings covering the membranous hind wings)."
  },
  {
    "id": 946,
    "description": "Usually without lateral abdominal gills, except for Gyrinidae (4 hooks clustered on segment 10)."
  },
  {
    "id": 947,
    "description": "Thoracic legs usually with 4 or 5 segments and with 1 or 2 claws; if without legs, head distinctly sclerotized (hardened) and posterior body (thorax and abdomen) simple, without gills, hair brushes, suckers, or breathing tube. "
  },
  {
    "id": 948,
    "description": "Eye spots usually present, but compound eyes absent."
  },
  {
    "id": 949,
    "description": "Head usually partially contracted into thorax. "
  },
  {
    "id": 950,
    "description": "Each antenna 11-segmented, usually with enlarged basal segment and expanded 2nd segment covering remaining antennal segments."
  },
  {
    "id": 951,
    "description": "Forelegs (1st pair of legs) have the coxae (leg segment nearest the body) transverse (not round as in Elmidae)."
  },
  {
    "id": 952,
    "description": "Trochantins visible, unlike Elmidae. This is a small sclerite near where the leg connects with the body."
  },
  {
    "id": 953,
    "description": " Compound eyes divided into separate dorsal and ventral portions ( \"4-eyed\" appearance)."
  },
  {
    "id": 954,
    "description": "Each hind coxa (first segment of the last leg) expanded into a broad, flat, plate, ventrally covering the first 2 or 3 abdominal segments and most of hind femora."
  },
  {
    "id": 955,
    "description": "pertaining to the bottom of a permanent body of water."
  },
  {
    "id": 956,
    "description": "an organism that lives in the sediments of streams and lakes."
  },
  {
    "id": 957,
    "description": "pincer-like."
  },
  {
    "id": 958,
    "description": "an organism that lives on plants or debris underwater with adaptations for moving along stems and roots."
  },
  {
    "id": 959,
    "description": "An organism that attaches to surfaces in stream riffles; typically has adaptations (such as claws) or behaviors (like retreat construction) to live in these habitats."
  },
  {
    "id": 960,
    "description": "organisms that filter out particles suspended in water to eat."
  },
  {
    "id": 961,
    "description": "organisms that feed on deposited sediments."
  },
  {
    "id": 962,
    "description": "an organism that swims by rowing with its hind legs in lentic and lotic habitats; typically comes to surface of water for oxygen."
  },
  {
    "id": 963,
    "description": "an organism that attacks and eats whole animals or parts."
  },
  {
    "id": 964,
    "description": "prothoracic leg; a leg on the first thoracic segment."
  },
  {
    "id": 965,
    "description": "metathoracic leg; a leg on the third thoracic segment."
  },
  {
    "id": 966,
    "description": "water-repelling hairs."
  },
  {
    "id": 967,
    "description": "depression on the lower genae (cheeks) behind the mandible."
  },
  {
    "id": 968,
    "description": "accumulations of leaves and other coarse particulate matter in front of or behind obstructions in the water flow, such as logs."
  },
  {
    "id": 969,
    "description": "zone of a standing body of water where fine sediments from shallower parts of the lake mix with organic matter from deeper reaches of the lake."
  },
  {
    "id": 970,
    "description": "the shore of a body of water."
  },
  {
    "id": 971,
    "description": "running-water pools and margins with fine sediments, some vascular plants growing in those sediments, and leaf litter forming the majority of detritus."
  },
  {
    "id": 972,
    "description": "running-water riffles with coarse sediments, some plants growing in those coarse sediments, and leaf packs and woody debris serving as the majority of detritus. "
  },
  {
    "id": 973,
    "description": "the part of the top of the head that is closest to the body."
  },
  {
    "id": 974,
    "description": "organism that pierces through vegetation and sucks plant fluids."
  },
  {
    "id": 975,
    "description": "Organism that consumes prey by piercing through its tissues and sucking fluids."
  },
  {
    "id": 976,
    "description": "organisms drifting or swimming with water movement."
  },
  {
    "id": 977,
    "description": "hairs on the head, thorax, or abdomen."
  },
  {
    "id": 978,
    "description": "the bottom part of the first thoracic segment."
  },
  {
    "id": 979,
    "description": "organism that feeds on algae attached to organic and mineral surfaces."
  },
  {
    "id": 980,
    "description": "randomly occurring hairs."
  },
  {
    "id": 981,
    "description": "organism that eats by chewing coarse particulate organic matter."
  },
  {
    "id": 982,
    "description": "organism that eats by digging through wood."
  },
  {
    "id": 983,
    "description": "organism that eats living aquatic plants and algae by chewing and mining."
  },
  {
    "id": 984,
    "description": "small spines."
  },
  {
    "id": 985,
    "description": "live on the surface of submerged objects or sediment; adapted to keep sediment off of themselves and remain on top of the substrate."
  },
  {
    "id": 986,
    "description": "organisms that are adapted to fishlike swimming; often cling to submerged objects and plants between bursts of swimming."
  },
  {
    "id": 987,
    "description": "short, wooly, rough hair."
  },
  {
    "id": 988,
    "description": "Hind coxae (basal most leg segment) each with median portion extending in posterior direction, dividing abdominal segment 1 into lateral sclerites, but not expanding into broad plates. "
  },
  {
    "id": 989,
    "description": "Without large spur on end of each front tibia (shin). "
  },
  {
    "id": 990,
    "description": "Broad wedge-like hind coxal plate absent. "
  },
  {
    "id": 991,
    "description": "Scutellum (triangular sclerite between the elytra) usually visible, if hidden, then front and middle tarsi apparently 4-segmented and hind tarsi each with 1 claw."
  },
  {
    "id": 992,
    "description": "Antennae slender, thread-like"
  },
  {
    "id": 993,
    "description": "Each leg with 5 tarsal segments."
  },
  {
    "id": 994,
    "description": "Last tarsal segment about as long as other segments "
  },
  {
    "id": 995,
    "description": "Big Claws"
  },
  {
    "id": 996,
    "description": "Maxillary palpi usually longer than antennae. "
  },
  {
    "id": 997,
    "description": "Antennae about as long head"
  },
  {
    "id": 998,
    "description": "2nd antennal segment attached at apex of 1st (basal-most) segment "
  },
  {
    "id": 999,
    "description": "Antennal segments 7–9 clubbed."
  },
  {
    "id": 1000,
    "description": "Antenna ually with 5 segments before cupule (cup-shaped, hairless, segment 6)"
  },
  {
    "id": 1001,
    "description": "Sickle-shaped mandibles without mola (grinding surface). "
  },
  {
    "id": 1002,
    "description": "Long, slender swimming legs 5-segmented, excluding 2 claws. "
  },
  {
    "id": 1003,
    "description": "Abdomen with 8 sements."
  },
  {
    "id": 1004,
    "description": "Segment 9 (posterior-most segment) with ventral lid-like flap (operculum) concealing thread-like gills and pair of hooks"
  },
  {
    "id": 1005,
    "description": "Body strongly sclerotized (hardened), dark brown or red-brown, roughly cylindrical or spindle-shaped,"
  },
  {
    "id": 1006,
    "description": "Legs 5-segmented plus 2 tarsal claws. "
  },
  {
    "id": 1007,
    "description": "Abdominal segments 1–9 with lateral gills. "
  },
  {
    "id": 1008,
    "description": "Abdominal segment 10 (posterior-most segment) with 4 stout hooks."
  },
  {
    "id": 1009,
    "description": "Legs 5-segmented and each with single claw. "
  },
  {
    "id": 1010,
    "description": "Mature larvae usually with long, slender, stiff, needle-like dorsal projections from thoracic and abdominal segments"
  },
  {
    "id": 1011,
    "description": "The labrum (upper lip) usually has a median notch. The labrum or upper-lip is a flap-like structure covring the mouthparts. You are looking for an indentation or dip along the far edge."
  },
  {
    "id": 1012,
    "description": "The antennae are usually long, two or three times or more width of the head"
  },
  {
    "id": 1013,
    "description": "Large Tusks for are located anterioly on the head. "
  },
  {
    "id": 1014,
    "description": "The Foretibiae (the shins of the first pair of legs), are expanded/enlarged, and used for burrowing in sediment."
  },
  {
    "id": 1015,
    "description": "Ventral apex of each hind tibia acutely pointed (i.e. the shins of the last pair of legs each have a point at the end)."
  },
  {
    "id": 1016,
    "description": " Abdominal gills on segments 2–7 are conspicuous dorsaly, forked and elongate-lancolate, with fringed margins, giving the animal a fluffy appearance."
  },
  {
    "id": 1017,
    "description": "The gills on abdominal segment 2 are operculate or semioperculate. (i.e. the gills on this segment at least partially cover the gills on the preceeding segment). The gills are and roughly triangular or oval."
  },
  {
    "id": 1018,
    "description": "First antennal segment (segment nearest the head) long, subequal to length of rest of antenna."
  },
  {
    "id": 1019,
    "description": "Hind wing pads more or less parallel with body axis, and typically longer than wide."
  },
  {
    "id": 1020,
    "description": "When extended, hind legs do not reach end abdomen."
  },
  {
    "id": 1021,
    "description": "Paraglossae and glossae about same length, suitable for shredding."
  },
  {
    "id": 1022,
    "description": "Hind wing pads (2nd pair of wing pads) conspicuously divergent from body axis"
  },
  {
    "id": 1023,
    "description": "When extended hind legs reach about to end of abdomen."
  },
  {
    "id": 1024,
    "description": "Glossae much shorter than the paraglossae. "
  },
  {
    "id": 1025,
    "description": "Multi-branched, thread-like gills present laterally and ventrally on thorax, but not on abdomen."
  },
  {
    "id": 1026,
    "description": "Gills absent from thoracic and abdominal segments."
  },
  {
    "id": 1027,
    "description": "Cerci (tails) are about the same length as the abdomen."
  },
  {
    "id": 1028,
    "description": " Unlike Peltoperlidae, gills, if present, not conical, and thoracic sterna not overlapping. "
  },
  {
    "id": 1029,
    "description": "The antenna are small and are always situated directly next to the eye. This is the only caddisfly family with antenna in this location."
  },
  {
    "id": 1030,
    "description": "This is the only caddisfly family where the larvae usually have “long” antenna. By long antenna we mean that they aren’t tiny little nubs we usually see on caddisflies, but more like short threads, easily visible in profile."
  },
  {
    "id": 1031,
    "description": "Labrum (upper lip) membranous and T-shaped. If you don't see the labrum it's becuase in preserved specimens it’s often sucked into mouth and hidden from view. All other families have a sclerotized easily visible labrum."
  },
  {
    "id": 1032,
    "description": "The foretrochantin is a projecting sclerite (hard plate) at the base of each foreleg. This is the only family where the foretrochantin is hatched-shaped. Look from the ventral side, you may see the shape more clearly if the specimen is a bit tilted."
  },
  {
    "id": 1033,
    "description": "Pro- and mesonota are sclerotized, but the metanotum mostly membranous, with some small sclerites (i.e. the dorsal sides of the 1st two thoracic segments are hardened, but the 3rd is membranous)."
  },
  {
    "id": 1034,
    "description": "Mesonotum notched medially along the anterior margin. I.e. the middle thorasic segment has a 2 small incisions along the edge nearest the head."
  },
  {
    "id": 1035,
    "description": " Maxillae (second pair of jaws) each with row of conspicuous pectinate (comb-like) spines. "
  },
  {
    "id": 1036,
    "description": "There is only one genus in this family! If you've identified the family, you know the genus too."
  },
  {
    "id": 1037,
    "description": "Large spinneret, half as long as head. This is a needle-like structure near the mouth, where the silk is extruded."
  },
  {
    "id": 1038,
    "description": "The Meso- and metanota (2nd and 3rd dorsal thorasic segments) are membranous (not hardened) with a large hump between them. "
  },
  {
    "id": 1039,
    "description": "Tarsi (toes- distal most leg region) flattened and tibiae (shins) shorter than tarsi"
  },
  {
    "id": 1040,
    "description": "Larvae make branching tube-like retreats buried in sand or soft sediment, except tips of branches sticking above sediment. You can find these by using a seave in soft sandy sediment, look for branching sandy tubes, often with a bulbus end on one of the branches, carfully pull it apart to find the larva."
  },
  {
    "id": 1041,
    "description": "Meso- and metanota membranous. I.e. Dorsally, only the first thorasic segment is sclerotized (hardened), the rest of the thorax is membranous."
  },
  {
    "id": 1042,
    "description": "The dorsal side of abdominal segment 9 has a sclerite (hardened plate or patch). Segment 9 is the last abdominal segment, at the end of the body."
  },
  {
    "id": 1043,
    "description": "Anal prolegs (fleshy nubs at the end of th body with hooks on them) are free, not closely fused to the abdomen."
  },
  {
    "id": 1044,
    "description": "Larvae are free-living (do not build a case or retreat) until pupation."
  },
  {
    "id": 1054,
    "description": "water-loving; attracted to water."
  },
  {
    "id": 1055,
    "description": "water-repelling."
  },
  {
    "id": 1056,
    "description": "the combination of the glossae and paraglossae, used like a tongue."
  },
  {
    "id": 1057,
    "description": "the hairless, cup-shaped sixth segment of a water scavenger beetle's antennae."
  },
  {
    "id": 1058,
    "description": "thin and more or less transparent."
  },
  {
    "id": 1059,
    "description": "a lid or cover. Plural form is opercula."
  },
  {
    "id": 1060,
    "description": "the last abdominal \"segment\" in larval Diptera (that actually consists of several segments)."
  },
  {
    "id": 1061,
    "description": "of or relating to the habit of living in the surface layers of water."
  },
  {
    "id": 1062,
    "description": "split located behind the cheeks (genae)."
  },
  {
    "id": 1063,
    "description": "small tube-shaped appendage that exudes silk threads, especially seen in spiders and larval Trichoptera and Lepidoptera. In larvae, this is typically located on the labium (lower lip) of an individual."
  },
  {
    "id": 1064,
    "description": "belonging to the thorax."
  },
  {
    "id": 1065,
    "description": "broader than long, extending across something."
  },
  {
    "id": 1066,
    "description": "undeveloped and encased wings located behind the thorax of hemimetabolous insect nymphs, including mayflies, stoneflies, true bugs, and dragonflies. "
  },
  {
    "id": 1067,
    "description": "aquatic plants with tissues that can conduct water and other nutrients."
  },
  {
    "id": 1068,
    "description": "an eye composed of several visual units, called ommatidia."
  },
  {
    "id": 1069,
    "description": "the second segment of the maxillae (second set of jaws). The lacinia, galea, and maxillary palps arise from the stipes."
  },
  {
    "id": 1070,
    "description": null
  },
  {
    "id": 1071,
    "description": null
  },
  {
    "id": 1072,
    "description": null
  },
  {
    "id": 1073,
    "description": null
  },
  {
    "id": 1074,
    "description": null
  },
  {
    "id": 1075,
    "description": null
  },
  {
    "id": 1076,
    "description": null
  },
  {
    "id": 1077,
    "description": null
  },
  {
    "id": 1078,
    "description": null
  },
  {
    "id": 1079,
    "description": null
  },
  {
    "id": 1080,
    "description": null
  },
  {
    "id": 1081,
    "description": null
  },
  {
    "id": 1082,
    "description": null
  },
  {
    "id": 1083,
    "description": null
  },
  {
    "id": 1084,
    "description": null
  },
  {
    "id": 1085,
    "description": null
  },
  {
    "id": 1086,
    "description": null
  },
  {
    "id": 1087,
    "description": null
  },
  {
    "id": 1088,
    "description": null
  },
  {
    "id": 1089,
    "description": null
  },
  {
    "id": 1090,
    "description": null
  },
  {
    "id": 1091,
    "description": null
  },
  {
    "id": 1092,
    "description": null
  },
  {
    "id": 1093,
    "description": null
  },
  {
    "id": 1094,
    "description": null
  },
  {
    "id": 1095,
    "description": null
  },
  {
    "id": 1096,
    "description": null
  },
  {
    "id": 1097,
    "description": null
  },
  {
    "id": 1098,
    "description": null
  },
  {
    "id": 1099,
    "description": null
  },
  {
    "id": 1100,
    "description": null
  },
  {
    "id": 1101,
    "description": null
  },
  {
    "id": 1102,
    "description": null
  },
  {
    "id": 1103,
    "description": null
  },
  {
    "id": 1104,
    "description": null
  },
  {
    "id": 1105,
    "description": null
  },
  {
    "id": 1106,
    "description": null
  },
  {
    "id": 1107,
    "description": null
  },
  {
    "id": 1108,
    "description": null
  },
  {
    "id": 1109,
    "description": null
  },
  {
    "id": 1110,
    "description": null
  },
  {
    "id": 1111,
    "description": null
  },
  {
    "id": 1112,
    "description": null
  },
  {
    "id": 1113,
    "description": null
  },
  {
    "id": 1114,
    "description": null
  },
  {
    "id": 1115,
    "description": null
  },
  {
    "id": 1116,
    "description": null
  },
  {
    "id": 1117,
    "description": null
  },
  {
    "id": 1118,
    "description": "Unlike most mayflies (which have 3 easily visible tails), species in the family Baetidae have a very short central tail, giving the appearance of only 2 tails."
  },
  {
    "id": 1119,
    "description": "Unlike most mayflies (which have 3 easily visible tails), species in the family Baetidae have a very short central tail, giving the appearance of only 2 tails."
  },
  {
    "id": 1120,
    "description": "Unlike most mayflies (which have 3 tails), species of the genus <em>Epeorus </em>only have two tails."
  },
  {
    "id": 1121,
    "description": "Unlike most mayflies (which have 3 easily visible tails), species in the family Baetidae have a very short central tail, giving the appearance of only 2 tails."
  },
  {
    "id": 1122,
    "description": " Postmentum large, covering bases of maxillae"
  },
  {
    "id": 1123,
    "description": "The body is dorsoventrally flattened (flat like a hamburger, not like a taco). "
  },
  {
    "id": 1124,
    "description": "The thoracic and abdominal tergites (dorsal hardened segmental plates) are expanded laterally as a thin shield covering the head and legs from above. This can make the animals resemble trilobites. This shape also helps them stick to rocks almost like a suction cup. "
  },
  {
    "id": 1125,
    "description": "Head complete and fully exposed. The head is not drawn into the thorax."
  },
  {
    "id": 1126,
    "description": "Prolegs (fleshy nubs) can be present or absent on the prothorax (1st thoracic segment). Like in the specimen imaged here (<em>Probezzia</em>), if prolegs are absent the body is usually smooth, shiny, and cream colored, usually without any surface features except a few hairs especially posteriorly, and sometimes a single retractile anal proleg bearing a few hooks. Alternatively, if there is a pair of ventral prolegs on the prothorax, then the prothoracic and anal prolegs are usually paired (even if divison slight and only at apex) and there are distinct dorsal fleshy projections and/or setae along body."
  },
  {
    "id": 1127,
    "description": "Paired hook-bearing prolegs (fleshy nubs used for movement) are present on the prothorax and at the posterior end of the body. At first glance these may appear as a single proleg, but they are paired, the division may be slight and only at the apex of the proleg."
  },
  {
    "id": 1128,
    "description": "The hardened head capsule is not visible from the outside, it is always deeply retracted inside thorax, and can only be viewed with dissection. "
  },
  {
    "id": 1129,
    "description": "The posterior spiracles are rimmed by 2–7 (usually 5) lobes often fringed with hair."
  },
  {
    "id": 1130,
    "description": "Head capsule usually with pair of conspicuous fans."
  },
  {
    "id": 1131,
    "description": "Abdominal segments 5–8 are swollen, appearing ballooned or bowling-pin-like. Often these balooned posterior ends are attached to the substrate. "
  },
  {
    "id": 1132,
    "description": "Paired gills on abdominal segment 2 are nearly square, and meeting or almost meeting medially (but NOT fused). These gills on segment 2 are at least partially covering the succeeding pairs (semioperculate)."
  },
  {
    "id": 1133,
    "description": "This is the only mayfly family with gills absent on abdominal segment 2."
  },
  {
    "id": 1134,
    "description": "The gills on abdominal segments 2–7 are double-layered and lamellate (plate-like). The gills can be terminated in filaments or points and without fringe, or oval with fringe."
  },
  {
    "id": 1135,
    "description": "The antennae are longer than the head. They are positioned anterior to the eyes, clearly visible from the dorsal side."
  },
  {
    "id": 1136,
    "description": "At least front tarsus (last leg segment) with anteapical claws. These are claws that protrude from leg before the apex."
  },
  {
    "id": 1137,
    "description": "The hind femora are shorter than the abdomen, or just barely longer."
  },
  {
    "id": 1138,
    "description": null
  },
  {
    "id": 1139,
    "description": null
  },
  {
    "id": 1140,
    "description": null
  },
  {
    "id": 1141,
    "description": null
  },
  {
    "id": 1142,
    "description": null
  },
  {
    "id": 1143,
    "description": null
  },
  {
    "id": 1144,
    "description": null
  },
  {
    "id": 1145,
    "description": null
  },
  {
    "id": 1146,
    "description": null
  },
  {
    "id": 1147,
    "description": null
  },
  {
    "id": 1148,
    "description": null
  },
  {
    "id": 1149,
    "description": null
  },
  {
    "id": 1150,
    "description": null
  },
  {
    "id": 1151,
    "description": null
  },
  {
    "id": 1152,
    "description": null
  },
  {
    "id": 1153,
    "description": null
  },
  {
    "id": 1154,
    "description": null
  },
  {
    "id": 1155,
    "description": null
  },
  {
    "id": 1156,
    "description": null
  },
  {
    "id": 1157,
    "description": null
  },
  {
    "id": 1158,
    "description": null
  },
  {
    "id": 1159,
    "description": null
  },
  {
    "id": 1160,
    "description": null
  },
  {
    "id": 1161,
    "description": null
  },
  {
    "id": 1162,
    "description": null
  },
  {
    "id": 1163,
    "description": null
  },
  {
    "id": 1164,
    "description": null
  },
  {
    "id": 1165,
    "description": null
  },
  {
    "id": 1166,
    "description": null
  },
  {
    "id": 1167,
    "description": null
  },
  {
    "id": 1168,
    "description": null
  },
  {
    "id": 1169,
    "description": null
  },
  {
    "id": 1170,
    "description": null
  },
  {
    "id": 1171,
    "description": null
  },
  {
    "id": 1172,
    "description": null
  },
  {
    "id": 1173,
    "description": null
  },
  {
    "id": 1174,
    "description": null
  },
  {
    "id": 1175,
    "description": null
  },
  {
    "id": 1176,
    "description": null
  },
  {
    "id": 1177,
    "description": null
  },
  {
    "id": 1178,
    "description": null
  },
  {
    "id": 1179,
    "description": null
  },
  {
    "id": 1180,
    "description": null
  },
  {
    "id": 1181,
    "description": null
  },
  {
    "id": 1182,
    "description": null
  },
  {
    "id": 1183,
    "description": null
  },
  {
    "id": 1184,
    "description": null
  },
  {
    "id": 1185,
    "description": null
  },
  {
    "id": 1186,
    "description": null
  },
  {
    "id": 1187,
    "description": null
  },
  {
    "id": 1188,
    "description": null
  },
  {
    "id": 1189,
    "description": null
  },
  {
    "id": 1190,
    "description": null
  },
  {
    "id": 1191,
    "description": null
  },
  {
    "id": 1192,
    "description": null
  },
  {
    "id": 1193,
    "description": null
  },
  {
    "id": 1194,
    "description": null
  },
  {
    "id": 1195,
    "description": null
  },
  {
    "id": 1196,
    "description": null
  },
  {
    "id": 1197,
    "description": null
  },
  {
    "id": 1198,
    "description": null
  },
  {
    "id": 1199,
    "description": null
  },
  {
    "id": 1200,
    "description": null
  },
  {
    "id": 1201,
    "description": null
  },
  {
    "id": 1202,
    "description": null
  },
  {
    "id": 1203,
    "description": null
  },
  {
    "id": 1204,
    "description": null
  },
  {
    "id": 1205,
    "description": null
  },
  {
    "id": 1206,
    "description": null
  },
  {
    "id": 1207,
    "description": null
  },
  {
    "id": 1208,
    "description": null
  },
  {
    "id": 1209,
    "description": null
  },
  {
    "id": 1210,
    "description": null
  },
  {
    "id": 1211,
    "description": null
  },
  {
    "id": 1212,
    "description": null
  },
  {
    "id": 1213,
    "description": null
  },
  {
    "id": 1214,
    "description": null
  },
  {
    "id": 1215,
    "description": null
  },
  {
    "id": 1216,
    "description": null
  },
  {
    "id": 1217,
    "description": null
  },
  {
    "id": 1218,
    "description": null
  },
  {
    "id": 1219,
    "description": null
  },
  {
    "id": 1220,
    "description": null
  },
  {
    "id": 1221,
    "description": null
  },
  {
    "id": 1222,
    "description": null
  },
  {
    "id": 1223,
    "description": null
  },
  {
    "id": 1224,
    "description": null
  },
  {
    "id": 1225,
    "description": null
  },
  {
    "id": 1226,
    "description": null
  },
  {
    "id": 1227,
    "description": null
  },
  {
    "id": 1228,
    "description": null
  },
  {
    "id": 1229,
    "description": null
  },
  {
    "id": 1230,
    "description": null
  },
  {
    "id": 1231,
    "description": null
  },
  {
    "id": 1232,
    "description": null
  },
  {
    "id": 1233,
    "description": null
  },
  {
    "id": 1234,
    "description": null
  },
  {
    "id": 1235,
    "description": null
  },
  {
    "id": 1236,
    "description": null
  },
  {
    "id": 1237,
    "description": null
  },
  {
    "id": 1238,
    "description": null
  },
  {
    "id": 1239,
    "description": null
  },
  {
    "id": 1240,
    "description": null
  },
  {
    "id": 1241,
    "description": null
  },
  {
    "id": 1242,
    "description": null
  },
  {
    "id": 1243,
    "description": null
  },
  {
    "id": 1244,
    "description": null
  },
  {
    "id": 1245,
    "description": null
  },
  {
    "id": 1246,
    "description": null
  },
  {
    "id": 1247,
    "description": null
  },
  {
    "id": 1248,
    "description": null
  },
  {
    "id": 1249,
    "description": null
  },
  {
    "id": 1250,
    "description": null
  },
  {
    "id": 1251,
    "description": null
  },
  {
    "id": 1252,
    "description": null
  },
  {
    "id": 1253,
    "description": null
  },
  {
    "id": 1254,
    "description": null
  },
  {
    "id": 1255,
    "description": null
  },
  {
    "id": 1256,
    "description": null
  },
  {
    "id": 1257,
    "description": null
  },
  {
    "id": 1258,
    "description": null
  },
  {
    "id": 1259,
    "description": null
  },
  {
    "id": 1260,
    "description": null
  },
  {
    "id": 1261,
    "description": null
  },
  {
    "id": 1262,
    "description": null
  },
  {
    "id": 1263,
    "description": null
  },
  {
    "id": 1264,
    "description": null
  },
  {
    "id": 1265,
    "description": null
  },
  {
    "id": 1266,
    "description": null
  },
  {
    "id": 1267,
    "description": null
  },
  {
    "id": 1268,
    "description": null
  },
  {
    "id": 1269,
    "description": null
  },
  {
    "id": 1270,
    "description": null
  },
  {
    "id": 1271,
    "description": null
  },
  {
    "id": 1272,
    "description": null
  },
  {
    "id": 1273,
    "description": null
  },
  {
    "id": 1274,
    "description": null
  },
  {
    "id": 1275,
    "description": null
  },
  {
    "id": 1276,
    "description": null
  },
  {
    "id": 1277,
    "description": null
  },
  {
    "id": 1278,
    "description": null
  },
  {
    "id": 1279,
    "description": null
  },
  {
    "id": 1280,
    "description": null
  },
  {
    "id": 1281,
    "description": null
  },
  {
    "id": 1282,
    "description": null
  },
  {
    "id": 1283,
    "description": null
  },
  {
    "id": 1284,
    "description": null
  },
  {
    "id": 1285,
    "description": null
  },
  {
    "id": 1286,
    "description": null
  },
  {
    "id": 1287,
    "description": null
  },
  {
    "id": 1288,
    "description": null
  },
  {
    "id": 1289,
    "description": null
  },
  {
    "id": 1290,
    "description": null
  },
  {
    "id": 1291,
    "description": null
  },
  {
    "id": 1292,
    "description": null
  },
  {
    "id": 1293,
    "description": null
  },
  {
    "id": 1294,
    "description": null
  },
  {
    "id": 1295,
    "description": null
  },
  {
    "id": 1296,
    "description": null
  },
  {
    "id": 1297,
    "description": null
  },
  {
    "id": 1298,
    "description": null
  },
  {
    "id": 1299,
    "description": null
  },
  {
    "id": 1300,
    "description": null
  },
  {
    "id": 1301,
    "description": null
  },
  {
    "id": 1302,
    "description": null
  },
  {
    "id": 1303,
    "description": null
  },
  {
    "id": 1304,
    "description": null
  },
  {
    "id": 1305,
    "description": null
  },
  {
    "id": 1306,
    "description": null
  },
  {
    "id": 1307,
    "description": null
  },
  {
    "id": 1308,
    "description": null
  },
  {
    "id": 1309,
    "description": null
  },
  {
    "id": 1310,
    "description": null
  },
  {
    "id": 1311,
    "description": null
  },
  {
    "id": 1312,
    "description": null
  },
  {
    "id": 1313,
    "description": null
  },
  {
    "id": 1314,
    "description": null
  },
  {
    "id": 1315,
    "description": null
  },
  {
    "id": 1316,
    "description": null
  },
  {
    "id": 1317,
    "description": null
  },
  {
    "id": 1318,
    "description": null
  },
  {
    "id": 1319,
    "description": null
  },
  {
    "id": 1320,
    "description": null
  },
  {
    "id": 1321,
    "description": null
  },
  {
    "id": 1322,
    "description": null
  },
  {
    "id": 1323,
    "description": null
  },
  {
    "id": 1324,
    "description": null
  },
  {
    "id": 1325,
    "description": null
  },
  {
    "id": 1326,
    "description": null
  },
  {
    "id": 1327,
    "description": null
  },
  {
    "id": 1328,
    "description": null
  },
  {
    "id": 1329,
    "description": null
  },
  {
    "id": 1330,
    "description": null
  },
  {
    "id": 1331,
    "description": null
  },
  {
    "id": 1332,
    "description": null
  },
  {
    "id": 1333,
    "description": null
  },
  {
    "id": 1334,
    "description": null
  },
  {
    "id": 1335,
    "description": null
  },
  {
    "id": 1336,
    "description": null
  },
  {
    "id": 1337,
    "description": null
  },
  {
    "id": 1338,
    "description": null
  },
  {
    "id": 1339,
    "description": null
  },
  {
    "id": 1340,
    "description": null
  },
  {
    "id": 1341,
    "description": null
  },
  {
    "id": 1342,
    "description": null
  },
  {
    "id": 1343,
    "description": null
  },
  {
    "id": 1344,
    "description": null
  },
  {
    "id": 1345,
    "description": null
  },
  {
    "id": 1346,
    "description": null
  },
  {
    "id": 1347,
    "description": null
  },
  {
    "id": 1348,
    "description": null
  },
  {
    "id": 1349,
    "description": null
  },
  {
    "id": 1350,
    "description": null
  },
  {
    "id": 1351,
    "description": null
  },
  {
    "id": 1352,
    "description": null
  },
  {
    "id": 1353,
    "description": null
  },
  {
    "id": 1354,
    "description": null
  },
  {
    "id": 1355,
    "description": null
  },
  {
    "id": 1356,
    "description": null
  },
  {
    "id": 1357,
    "description": null
  },
  {
    "id": 1358,
    "description": null
  },
  {
    "id": 1359,
    "description": null
  },
  {
    "id": 1360,
    "description": null
  },
  {
    "id": 1361,
    "description": null
  },
  {
    "id": 1362,
    "description": null
  },
  {
    "id": 1363,
    "description": null
  },
  {
    "id": 1364,
    "description": null
  },
  {
    "id": 1365,
    "description": null
  },
  {
    "id": 1366,
    "description": null
  },
  {
    "id": 1367,
    "description": null
  },
  {
    "id": 1368,
    "description": null
  },
  {
    "id": 1369,
    "description": null
  },
  {
    "id": 1370,
    "description": null
  },
  {
    "id": 1371,
    "description": null
  },
  {
    "id": 1372,
    "description": null
  },
  {
    "id": 1373,
    "description": null
  },
  {
    "id": 1374,
    "description": null
  },
  {
    "id": 1375,
    "description": null
  },
  {
    "id": 1376,
    "description": null
  },
  {
    "id": 1377,
    "description": null
  },
  {
    "id": 1378,
    "description": null
  },
  {
    "id": 1379,
    "description": null
  },
  {
    "id": 1380,
    "description": null
  },
  {
    "id": 1381,
    "description": null
  },
  {
    "id": 1382,
    "description": null
  },
  {
    "id": 1383,
    "description": null
  },
  {
    "id": 1384,
    "description": null
  },
  {
    "id": 1385,
    "description": null
  },
  {
    "id": 1386,
    "description": null
  },
  {
    "id": 1387,
    "description": null
  },
  {
    "id": 1388,
    "description": null
  },
  {
    "id": 1389,
    "description": null
  },
  {
    "id": 1390,
    "description": null
  },
  {
    "id": 1391,
    "description": null
  },
  {
    "id": 1392,
    "description": null
  },
  {
    "id": 1393,
    "description": null
  },
  {
    "id": 1394,
    "description": null
  },
  {
    "id": 1395,
    "description": null
  },
  {
    "id": 1396,
    "description": null
  },
  {
    "id": 1397,
    "description": null
  },
  {
    "id": 1398,
    "description": null
  },
  {
    "id": 1399,
    "description": null
  },
  {
    "id": 1400,
    "description": null
  },
  {
    "id": 1401,
    "description": null
  },
  {
    "id": 1402,
    "description": null
  },
  {
    "id": 1403,
    "description": null
  },
  {
    "id": 1404,
    "description": null
  },
  {
    "id": 1405,
    "description": null
  },
  {
    "id": 1406,
    "description": null
  },
  {
    "id": 1407,
    "description": null
  },
  {
    "id": 1408,
    "description": null
  },
  {
    "id": 1409,
    "description": null
  },
  {
    "id": 1410,
    "description": null
  },
  {
    "id": 1411,
    "description": null
  },
  {
    "id": 1412,
    "description": null
  },
  {
    "id": 1413,
    "description": null
  },
  {
    "id": 1414,
    "description": null
  },
  {
    "id": 1415,
    "description": null
  },
  {
    "id": 1416,
    "description": null
  },
  {
    "id": 1417,
    "description": null
  },
  {
    "id": 1418,
    "description": null
  },
  {
    "id": 1419,
    "description": null
  },
  {
    "id": 1420,
    "description": null
  },
  {
    "id": 1421,
    "description": null
  },
  {
    "id": 1422,
    "description": null
  },
  {
    "id": 1423,
    "description": null
  },
  {
    "id": 1424,
    "description": null
  },
  {
    "id": 1425,
    "description": null
  },
  {
    "id": 1426,
    "description": null
  },
  {
    "id": 1427,
    "description": null
  },
  {
    "id": 1428,
    "description": null
  },
  {
    "id": 1429,
    "description": null
  },
  {
    "id": 1430,
    "description": null
  },
  {
    "id": 1431,
    "description": null
  },
  {
    "id": 1432,
    "description": null
  },
  {
    "id": 1433,
    "description": null
  },
  {
    "id": 1434,
    "description": null
  },
  {
    "id": 1435,
    "description": null
  },
  {
    "id": 1437,
    "description": null
  },
  {
    "id": 1438,
    "description": null
  },
  {
    "id": 1439,
    "description": null
  },
  {
    "id": 1440,
    "description": null
  },
  {
    "id": 1441,
    "description": null
  },
  {
    "id": 1442,
    "description": null
  },
  {
    "id": 1443,
    "description": null
  },
  {
    "id": 1444,
    "description": null
  },
  {
    "id": 1445,
    "description": null
  },
  {
    "id": 1446,
    "description": null
  },
  {
    "id": 1447,
    "description": null
  },
  {
    "id": 1448,
    "description": null
  },
  {
    "id": 1449,
    "description": null
  },
  {
    "id": 1452,
    "description": null
  },
  {
    "id": 1453,
    "description": null
  },
  {
    "id": 1454,
    "description": "Most aquatic beetle larvae usually lack lateral gills, but they are present in the genus <em>Berosus.</em>"
  },
  {
    "id": 1455,
    "description": null
  },
  {
    "id": 1456,
    "description": null
  },
  {
    "id": 1457,
    "description": null
  },
  {
    "id": 1458,
    "description": "Segmented legs absent from thorax, but prolegs (fleshy nubs) present along abdominal segments."
  },
  {
    "id": 1459,
    "description": null
  },
  {
    "id": 1460,
    "description": null
  },
  {
    "id": 1461,
    "description": null
  },
  {
    "id": 1462,
    "description": null
  },
  {
    "id": 1463,
    "description": null
  },
  {
    "id": 1464,
    "description": null
  },
  {
    "id": 1465,
    "description": null
  },
  {
    "id": 1466,
    "description": null
  },
  {
    "id": 1467,
    "description": null
  },
  {
    "id": 1468,
    "description": null
  },
  {
    "id": 1469,
    "description": null
  },
  {
    "id": 1470,
    "description": null
  },
  {
    "id": 1471,
    "description": null
  },
  {
    "id": 1472,
    "description": null
  },
  {
    "id": 1473,
    "description": null
  },
  {
    "id": 1474,
    "description": null
  },
  {
    "id": 1475,
    "description": null
  },
  {
    "id": 1476,
    "description": null
  },
  {
    "id": 1477,
    "description": null
  },
  {
    "id": 1478,
    "description": null
  },
  {
    "id": 1479,
    "description": null
  },
  {
    "id": 1480,
    "description": null
  },
  {
    "id": 1481,
    "description": null
  },
  {
    "id": 1482,
    "description": null
  },
  {
    "id": 1483,
    "description": null
  },
  {
    "id": 1484,
    "description": null
  },
  {
    "id": 1485,
    "description": null
  },
  {
    "id": 1486,
    "description": null
  },
  {
    "id": 1487,
    "description": null
  },
  {
    "id": 1488,
    "description": null
  },
  {
    "id": 1489,
    "description": null
  },
  {
    "id": 1490,
    "description": null
  },
  {
    "id": 1491,
    "description": null
  },
  {
    "id": 1492,
    "description": null
  },
  {
    "id": 1493,
    "description": null
  },
  {
    "id": 1494,
    "description": null
  },
  {
    "id": 1495,
    "description": null
  },
  {
    "id": 1496,
    "description": null
  },
  {
    "id": 1497,
    "description": null
  },
  {
    "id": 1498,
    "description": null
  },
  {
    "id": 1499,
    "description": null
  },
  {
    "id": 1500,
    "description": null
  },
  {
    "id": 1501,
    "description": null
  },
  {
    "id": 1502,
    "description": null
  },
  {
    "id": 1503,
    "description": null
  },
  {
    "id": 1504,
    "description": null
  },
  {
    "id": 1505,
    "description": null
  },
  {
    "id": 1506,
    "description": null
  },
  {
    "id": 1507,
    "description": null
  },
  {
    "id": 1508,
    "description": null
  },
  {
    "id": 1509,
    "description": null
  },
  {
    "id": 1510,
    "description": null
  },
  {
    "id": 1511,
    "description": null
  },
  {
    "id": 1512,
    "description": null
  },
  {
    "id": 1513,
    "description": null
  },
  {
    "id": 1514,
    "description": null
  },
  {
    "id": 1515,
    "description": null
  },
  {
    "id": 1516,
    "description": null
  },
  {
    "id": 1517,
    "description": null
  },
  {
    "id": 1518,
    "description": null
  },
  {
    "id": 1519,
    "description": null
  },
  {
    "id": 1520,
    "description": null
  },
  {
    "id": 1521,
    "description": null
  },
  {
    "id": 1522,
    "description": null
  },
  {
    "id": 1523,
    "description": null
  },
  {
    "id": 1524,
    "description": null
  },
  {
    "id": 1525,
    "description": null
  },
  {
    "id": 1526,
    "description": null
  },
  {
    "id": 1527,
    "description": null
  },
  {
    "id": 1528,
    "description": null
  },
  {
    "id": 1529,
    "description": null
  },
  {
    "id": 1530,
    "description": null
  },
  {
    "id": 1531,
    "description": null
  },
  {
    "id": 1532,
    "description": null
  },
  {
    "id": 1533,
    "description": null
  },
  {
    "id": 1534,
    "description": null
  },
  {
    "id": 1535,
    "description": null
  },
  {
    "id": 1536,
    "description": null
  },
  {
    "id": 1537,
    "description": "Antennal segment 1 much shorter than the rest of the antenna."
  },
  {
    "id": 1538,
    "description": "Ligula (distal part of palm of mask) usually without median cleft. The mask is roughly triangular or square (not stalked as in Lestidae)."
  },
  {
    "id": 1539,
    "description": "Labial mask spoon-shaped. This is a arm-like extremity that covers the mouth parts and is used for capturing prey."
  },
  {
    "id": 1540,
    "description": "Dorsal premental setae present. These are hairs located inside the mask, on the palm. If the mask is closed you will have to use forceps to gently open it."
  },
  {
    "id": 1541,
    "description": "Palpal Setae are present. These are hair along the margins of the palpal lobes (at end of mask)."
  },
  {
    "id": 1542,
    "description": "Ventrally, there is a median groove extending from the basal hinge of the mask to about 1/3 to 1/2 way to the distal margin of mask. It is often faint."
  },
  {
    "id": 1543,
    "description": "Labial mask flattened. This is a arm-like extremity that covers the mouth parts and is used for capturing prey."
  },
  {
    "id": 1544,
    "description": "The antennae are each 4-segmented, although the 4th segment is often small."
  },
  {
    "id": 1545,
    "description": "Unlike in Corduliidae, the prementum (basal hinge of the mask) is usually without a ventral basal medial groove."
  },
  {
    "id": 1546,
    "description": null
  },
  {
    "id": 1547,
    "description": null
  },
  {
    "id": 1548,
    "description": null
  },
  {
    "id": 1549,
    "description": null
  },
  {
    "id": 1550,
    "description": null
  },
  {
    "id": 1551,
    "description": null
  },
  {
    "id": 1552,
    "description": null
  },
  {
    "id": 1553,
    "description": null
  },
  {
    "id": 1554,
    "description": null
  },
  {
    "id": 1555,
    "description": null
  },
  {
    "id": 1556,
    "description": null
  },
  {
    "id": 1557,
    "description": null
  },
  {
    "id": 1558,
    "description": null
  },
  {
    "id": 1559,
    "description": null
  },
  {
    "id": 1560,
    "description": null
  },
  {
    "id": 1561,
    "description": null
  },
  {
    "id": 1562,
    "description": null
  },
  {
    "id": 1563,
    "description": null
  },
  {
    "id": 1564,
    "description": null
  },
  {
    "id": 1565,
    "description": null
  },
  {
    "id": 1566,
    "description": "Abdominal ventral gill tufts absent."
  },
  {
    "id": 1567,
    "description": "Respiratory tubes much shorter than anal prolegs."
  },
  {
    "id": 1568,
    "description": null
  },
  {
    "id": 1569,
    "description": null
  },
  {
    "id": 1570,
    "description": null
  }
]