[
  {
    "id": 277,
    "orderId": 3,
    "commonName": "Small Winter Stoneflies",
    "scientificName": "Capniidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 279,
    "orderId": 3,
    "commonName": "Green Stoneflies",
    "scientificName": "Chloroperlidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 281,
    "orderId": 3,
    "commonName": "Rolled-winged Stoneflies, Needleflies, Williowflies",
    "scientificName": "Leuctridae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "This family includes 6 genera with over 40 species in North America. Although the family is relatively widespread, the species tend to have very localized distributions. <u>Larvae</u> prefer fast, rocky-bottomed riffles and streams. <u>Larvae</u> are long and slender, allowing them to slither through leaf packs. They are <u>shredding detritivores</u>, eating decaying leaves in the water; however, most of the nutrients they receive from this meal come from the <u>periphyton</u> growing on the leaves and not the leaves themselves. The adults have wings that appear to roll around the body, giving them the common name Rolled-Winged Stoneflies.",
    "expandedCharacterList": "Body long and slender, abdomen roughly cylindrical. <u>Paraglossae</u> and <u>glossae</u> about same length, suitable for shredding. <strong>Postmentum large, covering bases of <u>maxillae</u>. Hind <u>wing pads</u> more or less parallel with body axis, and typically longer than wide</strong>. First tarsal segment of each leg much longer than second. <strong>When extended, <u>hind legs</u> not reaching end of abdomen</strong>. Membranous <u>pleural</u> folds occur on no more than abdominal segments 1–7."
  },
  {
    "id": 283,
    "orderId": 3,
    "commonName": "Spring Stoneflies, Forestflies",
    "scientificName": "Nemouridae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "There are 12 North American genera with roughly 60 species. This group is often referred to as “spring stoneflies,” however, adults of different species emerge at different times of year. The <u>larvae</u> tend to prefer small rivers, streams, and springs. They are often found in <u>leaf packs</u>, wood, or other coarse sediments. This makes sense as most of them are <u>shredding detritivores</u>, though some are <u>collector-gatherers</u>. These <u>larvae</u> can be easily confused with Taeniopterygidae as they both have <u>wing pads</u> divergent (not parallel with the body axis) but can be distinguished because the second tarsal segment of each leg of Nemouridae is much shorter in length than the first. These tend to be hairy <u>larvae</u> with <u>hind legs</u> longer than the abdomen.",
    "expandedCharacterList": "<u>Larvae</u> generally small (less than 12 mm long), robust, and hairy. <strong><u>Paraglossae</u> and <u>glossae</u> about same length</strong>, suitable for shredding. <strong>Hind <u>wing pads</u> conspicuously divergent from body axis</strong>. First tarsal segment of each leg much longer than second. <strong>When extended, <u>hind legs</u> reach beyond end of abdomen</strong>."
  },
  {
    "id": 285,
    "orderId": 3,
    "commonName": "Roach-like Stoneflies",
    "scientificName": "Peltoperlidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 4,
    "orderId": 3,
    "commonName": "Common Stoneflies",
    "scientificName": "Perlidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "This is the world's most species-rich stonefly family including 84 North America species and almost 1,000 worldwide. The generally black-and-yellow-striped <u>larvae</u> are often found <u>clinging</u> to substrate in riffles and other <u>lotic-erosional</u> habitats. Young <u>larvae</u> tend to <u>collect and gather</u> small amounts of food until they are large enough to <u>engulf</u> their prey, including caddisflies, midges, and other small invertebrates. Some of the <u>larvae</u> are territorial, swinging their <u>cerci</u> (tails) at other animals that get too close. If not enough oxygen is present in the water, they can be seen doing strange push-up-like movements in order to move more water across the gills. A life cycle can require from 1–3 years, depending on environmental conditions. They emerge as flying adults in spring and summer, and can often be drawn to lights at night.",
    "expandedCharacterList": "<strong><u>Glossae</u> much shorter than the <u>paraglossae</u>. Multi-branched, <u>filamentous</u> gills present <u>laterally</u> and <u>ventrally</u> on thorax, but not on abdomen.</strong>"
  },
  {
    "id": 287,
    "orderId": 3,
    "commonName": "Stripetails, Springflies, Yellow Stones",
    "scientificName": "Perlodidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "This family includes 130 North American species and about 300 worldwide. This members of this family have a patterned head and thorax and often longitudinal black-and-yellow stripes on the abdomen, giving the <u>nymphs</u> the common name \"Stripetails.\" Similar to other predators, the <u>larvae</u> of this group have <u>paraglossae</u> that are much longer than the <u>glossae</u>; however, some species in this group are also facultative shredders or <u>collector-gatherers</u>. They are often found <u>clinging</u> to the substrate, plants, or other materials in the stream. ",
    "expandedCharacterList": "<strong><u>Paraglossae</u> and <u>glossae</u> about same length</strong>. Second tarsal segment of each leg about same length as first. <u>Wing pads</u> divergent, not parallel with body.<strong> Gills absent from <u>thoracic</u> and abdominal segments </strong>of eastern species. <u>Hind legs</u> do not reach end of abdomen.<strong> Tails are subequal to the length of abdomen or longer.</strong> <u>Thoracic</u> <u>nota</u> usually with distinct pigment pattern."
  },
  {
    "id": 292,
    "orderId": 3,
    "commonName": "Giant Stoneflies",
    "scientificName": "Pteronarcyidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 6,
    "orderId": 3,
    "commonName": "Broadbacks, Winter Stoneflies",
    "scientificName": "Taeniopterygidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "<u>Larvae</u> are usually found in <u>lotic-erosional</u> habitats with coarse sediments, debris accumulations, <u>leaf packs</u>, and in quieter water at the edges of streams, and also are frequently found in large rivers. <u>Larvae</u> can be difficult to spot as they are often slow-moving and covered in debris. Similar to other shredders, these <u>larvae</u> have <u>paraglossae</u> and <u>glossae</u> about the same length. These <u>larvae</u> can be easily confused with Nemouridae as they both have <u>wing pads</u> divergent (not parallel with the body axis) but can be distinguished because the second tarsal segment of each leg of Taeniopterygidae is about the same length as the first.",
    "expandedCharacterList": "<strong><u>Paraglossae</u> and <u>glossae</u> about same length. Second tarsal segment of each leg about same length as first. <u>Wing pads</u> divergent, not parallel with body. </strong>Gills absent on abdominal segments. Unlike Peltoperlidae, gills, if present, not conical, and <u>thoracic</u> sterna not overlapping. Unlike Nemouridae <u>hind legs</u> not reaching end of the abdomen."
  },
  {
    "id": 300,
    "orderId": 14,
    "commonName": "Mountain Caddisflies, Little Mountain Casemakers, Early Smoky Wing Sedges",
    "scientificName": "Apataniidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 302,
    "orderId": 14,
    "commonName": "Humpless Caddisflies, Humpless Casemakers",
    "scientificName": "Brachycentridae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 305,
    "orderId": 14,
    "commonName": "Comb-lipped Caddisflies, Comb-lipped Casemakers",
    "scientificName": "Calamoceratidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 306,
    "orderId": 14,
    "commonName": "Pitot-tube Caddisflies",
    "scientificName": "Dipseudopsidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "<em>Phylocentropus</em> is the only genus in the family Dipseudopsidae in North America. <u>Larvae</u> <u>burrow</u> in sand or soft sediment and stabilize the walls of their burrow by shoring them with silk extruded from a long, movable <u>spinneret</u>. The tips of the branching burrow protrude above the sediment, looking like little sticks. A side branch of the retreat is enlarged and contains a silken net used to <u>filter</u> tiny bits of organic matter for food. They tend to live in pools or along the edges of slow-moving water. They are found throughout the eastern and central United States. Characters unique to this group include a large hump between membranous <u>meso</u><u>-</u> and <u>metanota</u>, the especially long <u>spinneret</u>, and flattened <u>tarsi</u> longer than the <u>tibiae</u>.",
    "expandedCharacterList": "<strong>Large <u>spinneret</u>, half as long as head</strong>. <u>Labrum</u> <u>sclerotized</u>, never withdrawn or T-shaped. Antenna tiny and inconspicuous. <u>Pronotum</u> without anterolateral lobes. <strong><u>Meso-</u> and <u>metanota</u> membranous with large hump between them</strong>. <strong><u>Tarsi</u> flattened and longer than <u>tibiae</u>.</strong> Abdominal <u>tergum</u> IX without <u>sclerite</u>. <u>Larvae</u> <strong>living in branching tube-like retreats</strong> buried in sand or soft sediment, except tips of branches sticking above sediment."
  },
  {
    "id": 308,
    "orderId": 14,
    "commonName": "Saddle-case Caddisflies, Saddle-case Makers, Little Black Caddisflies",
    "scientificName": "Glossosomatidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "Members of the family Glossosomatidae are often known as Saddle-case Makers. The cases are unique from those of other caddisflies in that they are domed like a turtle shell with a <u>transverse</u> strap of finer stones across the bottom, leaving the underside open on both ends. They tend to prefer rocky bottomed riffles. <u>Larvae</u> gather small rocks from the bottom of the stream and glue them together with silk from their mouths to form their cases. During feeding, a <u>larva</u> attaches a strand of silk to a large rock and to the upstream end of the case as a tether. The openings of the underside of the case are interchangeable so that the <u>larva</u> then turns around in the case to point its head through the downstream opening. It then slows swings upstream on the top of the rock, pivoting on its tethered thread, <u>scraping</u> and eating the algae and biofilm from the rock as it moves. Once the untethered end faces directly upstream, it anchors that end with silk, reverses itself within its case, cuts the thread from the original tether (which is now downstream), and repeats the swiveling and feeding process from the now-freed end of its case, progressing into the current by alternating the two ends of the case like a pair of mountain climbers ascending a rock face.",
    "expandedCharacterList": null
  },
  {
    "id": 310,
    "orderId": 14,
    "commonName": "Weighted-case Caddisflies, Weighted-case Makers",
    "scientificName": "Goeridae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 312,
    "orderId": 14,
    "commonName": "Snail-case Caddisflies, Snail-case Makers",
    "scientificName": "Helicopsychidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 18,
    "orderId": 14,
    "commonName": "Net-spinning Caddisflies, Common Netspinners, Seine-net Weavers",
    "scientificName": "Hydropsychidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "There are 47 genera in the family globally, with about 13 found in the US, including more than 155 species. <u>Larvae</u> build stationary retreats of silk, detritus and rock fragments. A part of the entrance of a retreat has a silken filter net protruding into the current to strain food from the water. This is how they earned the common name, “net spinners”. The mesh size of the filter net varies among hydropsychid species, corresponding with the current speed of their optimal habitat and the size of the food particles on which they specialize. They spend most of their life hiding in their retreats, waiting for food to get caught in their nets, mostly tiny bits of organic debris, but occasionally small animals; they sometimes also <u>scrape</u> algae from the surfaces of the rocks or other substrates to which their retreats are attached. Members of this family are often thought to be tolerant of pollution, but this is a misconception as tolerance varies greatly among the different species.",
    "expandedCharacterList": "<strong><u>Pro-</u>, <u>meso</u><u>-</u>, and <u>metanota</u> entirely covered by <u>sclerites</u>. <u>Ventral</u> side of abdomen with rows of branched gills. Conspicuous tuft or fan of long hairs on each <u>anal proleg</u>. </strong>Anal claw with stout <u>apical</u> hook. <u>Larvae</u> building stationary retreats of silk, detritus, and rock fragments and add a silken net for filter feeding."
  },
  {
    "id": 314,
    "orderId": 14,
    "commonName": "Microcaddisflies, Purse Casemakers",
    "scientificName": "Hydroptilidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 316,
    "orderId": 14,
    "commonName": "Bizarre Caddisflies, Scaly-mouth Caddisflies, Little Brown Sedges",
    "scientificName": "Lepidostomatidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "Over 60 North American species from two genera are recognized in this family. Members of this group are most commonly found in mountainous regions in small streams or along the edges of lakes and large rivers. They are <u>shredding detritivores</u>, feeding on decaying plant matter in the water; they also have been reported scavenging salmon carcasses. The <u>larvae</u> construct cases of varying materials and shapes, however, a four-sided case constructed of square pieces of leaves is most commonly found. This family is easily identifiable, as these are the only caddisflies with the small antennae situated directly next to the eyes.",
    "expandedCharacterList": "<u>Labrum</u> usually with only 6 <u>setae</u> arranged <u>transversely</u> across central area. <strong>Antennae small, always situated directly next to eyes</strong>. <u>Pronotum</u> and <u>mesonotum</u> <u>sclerotized</u>. <u>Pronotum</u> sometimes with distinct lobes at anterior corners. <u>Metanotum</u> mostly membranous; pair of anteromesal (<u>sa1</u>) <u>sclerites</u> <u>dorsally</u> with several <u>setae</u>, but each always with at least 1 <u>seta</u>. <u>Lateral</u> humps always present on abdominal segment I, but not always conspicuous. <strong><u>Median</u> <u>dorsal</u> hump absent from abdominal segment I.</strong> <u>Larval</u> cases varying in architecture and materials. "
  },
  {
    "id": 318,
    "orderId": 14,
    "commonName": "Long-horned Caddisflies",
    "scientificName": "Leptoceridae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "This is the only group of caddisflies with “long” antennae. In <u>larvae</u>, the antennae are “6 times as long as wide”, meaning they are small, thread-like antennae, as compared to most <u>larval</u> caddisfly antennae which are barely visible as small nubs. As adults, the antennae are extremely long, much longer than the animal, especially in males. This is also one of the few families with bright colors on the wings, thought to be mainly day fliers. These traits may be due to sexual selection, much like a male peacock with his showy feathers. The <u>larvae</u> are relatively <u>larvae</u> when mature, only ranging 7–15 mm. Representatives of this family can be found in any still or flowing water habitats, and create widely varying cases of plant or mineral materials or even pure silk, have varying habits (<u>climbers</u>, <u>sprawlers</u>, <u>clingers</u>, <u>swimmers</u>), and eat nearly every type of food, all of which are more particular at the genus and species levels of taxonomic refinement.",
    "expandedCharacterList": "<strong>Antennae usually long for caddisflies, at least 6 times as long as thick</strong>. <u>Mesonotum</u> light in color, <strong>except sometimes with pair of dark curved lines; these lines present in species with short antennae</strong>. <u>Metanotum</u> membranous. <u>Larvae</u> constructing portable tube-shaped cases of various materials and shapes."
  },
  {
    "id": 33,
    "orderId": 14,
    "commonName": "Northern Caddisflies, Northern Casemakers",
    "scientificName": "Limnephilidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "This is one of the more diverse familes in northern latitudes, including 252 species in 41 genera in North America. Only a few species of this group live in the Midwest and South, which is why they are often called \"Northern Caddisflies.\" They can be found in a variety of <u>lotic</u> and <u>lentic</u> habitats and have varying habits which become more specific at the genus and species levels of taxonomic refinement. Most are <u>shredding</u> or <u>scraping</u> herbivores or <u>detritivores</u>. This group is well known for their diversity in cases materials and architecture, which at the genus or species level can often be used to aid in identification.",
    "expandedCharacterList": "As in all families of superfamily Limnephiloidea, short, inconspicuous <strong>antennae are each located about midway between base of mandible and eye</strong>. <u>Prosternal</u> horn usually present. Chloride epithelia usually present on at least some abdominal segments. <strong>Otherwise distinguished from other Limnephiloidea families as follows</strong>: Mandibles usually toothed and <u>setae</u> usually absent between anterodorsal (<u>sa1</u>) <u>sclerites</u> or, if present then fewer than 25 <u>setae</u> (unlike Apataniidae). <u>Mesonotum</u> not notched along anterior margin (unlike Thremmatidae). <u>Mesopleura</u> not expanded as in Goeridae. <u>Larvae</u> usually large when mature and building tubular cases of varying materials, usually rocks or rough plant materials. Mature <u>larvae</u> 6–30 mm."
  },
  {
    "id": 323,
    "orderId": 14,
    "commonName": "Hood Caddisflies, Hooded-case Makers",
    "scientificName": "Molannidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 325,
    "orderId": 14,
    "commonName": "Mortarjoint Caddisflies, Mortarjoint Casemakers, Strong-case Makers",
    "scientificName": "Odontoceridae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 327,
    "orderId": 14,
    "commonName": "Finger-net Caddisflies",
    "scientificName": "Philopotamidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "This family includes 1,484 species globally and 76 species in North American. Their preferred habitat is riffles, where their nets can be found on the undersides of rocks. The <u>larvae</u> spin wind-sock like nets with ultrafine mesh that are held open by the current, which they use to filter feed on very small bits of detritus, algae, and even small animals. These nets are positioned beneath the rocks and have the smallest mesh size known of all the net-spinning caddisflies. When removed from water, the nets collapse and look like brown slime. This group is unique in that it is the only group with a membranous <u>labrum</u> that is expanded along the <u>distal</u> edge, giving it a T-shape. However, sometimes when placed in ethanol or other preservatives, this soft <u>labrum</u> gets sucked into the mouth where it cannot be seen. The most common species, <em>Dolophilodes distincta</em>, can emerge as adults year-round; however, females that emerge during the winter have very short stubby wings and are flightless.",
    "expandedCharacterList": "<strong><u>Labrum</u> membranous and T-shaped</strong>, in preserved specimens often sucked into mouth and hidden from view. Antennae small, nub-like, and inconspicuous. <u>Pronotum</u> <u>sclerotized</u>, but without anterolateral lobes. <u>Meso-</u> and <u>metanota</u> membranous. Abdominal <u>tergum</u> 9 entirely membranous. <u>Larvae</u> spinning stationary sac-shaped silken nets for filter feeding on undersides of rocks."
  },
  {
    "id": 330,
    "orderId": 14,
    "commonName": "Giant Caddisflies, Giant Casemakers",
    "scientificName": "Phryganeidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 332,
    "orderId": 14,
    "commonName": "Trumpet-net Caddisflies, Tube Maker Caddisflies",
    "scientificName": "Polycentropodidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 335,
    "orderId": 14,
    "commonName": "Net-tube Caddisflies",
    "scientificName": "Psychomyiidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "This family includes 5 North American genera with 17 species. The <u>larvae</u> often build tubular retreats, the tops of the structures are camouflaged with silk and pieces of detritus and pieces of substrate. They use the retreat to collect and gather food. As they add to the length of the tube to extend their grazing space, they occasionally harvest the old portion where they have cultivated <u>periphyton</u>. The <u>larvae</u> can be distinguished from other similar looking groups (such as the Philopotamidae) because the Psycomyiidae are the only caddisfly larvae with the <u>foretrochantins</u> (pair of hard projections between fore<u>coxae</u> and head) hatchet-shaped.",
    "expandedCharacterList": "Antennae small, nub-like, and inconspicuous.<strong> <u>Foretrochantin</u> broad and hatched-shaped. </strong><u>Meso-</u> and <u>metanota</u> membranous. Abdominal <u>tergum</u> IX membranous. <u>Larvae</u> creating stationary retreats composed of sand and detritus, usually built on rocks or large woody debris."
  },
  {
    "id": 338,
    "orderId": 14,
    "commonName": "Free-living Caddisflies/Green Caddisflies",
    "scientificName": "Rhyacophilidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "The <u>larvae</u> of Rhyacophilidae exhibit a variety of feeding strategies as young instars, feeding as <u>collector-gatherers</u>, <u>scaper-grazers</u>, or <u>shredder-herbivores</u>, but mature <u>larvae</u> are mainly free-ranging, <u>engulfing predators</u>. <u>Larvae</u> are free-living, meaning that they do not live in a case or retreat, but simply move throughout the environment, <u>clinging</u> to the substrate and chasing prey. Before pupation, a rock shelter is built and a semipermeable cocoon is spun inside. <u>Larvae</u> are often green in color, and often have well-defined segments, giving the body a beaded appearance. ",
    "expandedCharacterList": "Antenna small and inconspicuous. <u>Pronotum</u> without lobes in anterior corners.<strong> <u>Meso-</u> and <u>metanota</u> membranous. </strong><u>Metanotum</u> with <u>lateral</u> setal areas (<u>sa3</u>) each with only a single <u>seta</u>, with or without a <u>sclerite</u>. <strong>Abdominal <u>tergum</u> IX with a <u>sclerite</u>,</strong> sometimes inconspicuous or retracted under intersegmental fold of abdominal <u>tergum</u> VIII. <strong><u>Anal prolegs</u> free,</strong> not closely fused to segment IX. Anal claw without <u>dorsal</u> <u>accessory</u> hook; however, sometimes with a secondary <u>lateral</u> claw and sometimes with <u>ventral</u> teeth.<strong> <u>Larvae</u> are free-living until pupation.</strong>"
  },
  {
    "id": 340,
    "orderId": 14,
    "commonName": "Bush-tailed Caddisflies",
    "scientificName": "Sericostomatidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 342,
    "orderId": 14,
    "commonName": "Little Northeastern Casemakers",
    "scientificName": "Thremmatidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "Previously Uenodiae, the family was split into two families Thremmatidae and Uenoidae, with uenoids all western. Of the North American Thremmatidae, there are only two genera, <em>Neophylax </em>(widespread except for in the Southwest) and <em>Oligophlebodes </em>(Western and Northcentral States). The <u>larvae</u> create robust rock cases; eastern species add large <u>lateral</u> ballast stones, similar to cases of Goeridae. Eastern species typically feed by <u>scraping</u> <u>periphyton</u> from rocks. They prefer <u>lotic-erosional</u> habitats and tend to be found clinging to rocks and other substrates. The adults tend to emerge in the fall, and their yellow and brown colors often help them to blend with the autumn foliage.",
    "expandedCharacterList": "Antennae small, nub-like, and inconspicuous, positioned approximately equidistant between anterior margin of head and eyes.<strong> <u>Pro-</u> and <u>mesonota</u> <u>sclerotized</u>, but <u>metanotum</u> mostly membranous, with some small <u>sclerites</u>.</strong> <u>Pronotum</u> broadest at middle when viewed <u>dorsally</u>. <u>Prosternal</u> horn usually present, sometimes short. <strong><u>Mesonotum</u> with double notch <u>medially</u> along anterior margin</strong>. <u>Metanotal</u> anteromesal setal areas (<u>sa1</u>) each usually with tiny <u>sclerite</u> and 1 or 2 <u>setae</u>. First abdominal segment always with <u>lateral</u> humps and <u>median</u> <u>dorsal</u> hump. At least some abdominal segments with chloride epithelia (each evident as oval area surrounded by very fine dark line). <u>Larvae</u> building stout cases from pieces of rock, usually with small ballast stones arranged along sides. "
  },
  {
    "id": 195,
    "orderId": 20,
    "commonName": "Comb-mouthed Minnow Mayflies",
    "scientificName": "Ameletidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "<em>Ameletus </em>was previously included among genera of the Siphloneuridae, but is now the only genus in the family Ameletidae. There are 34 known species in North America, most from west of the Rocky Mountains. <u>Larvae</u> are <u>fusiform</u> or streamlined in body shape, making them strong swimmers and <u>clingers</u>. They are <u>collector-gatherers</u> or <u>scraper-grazers</u>, feeding on fine detritus and diatoms. They tend to be found in cold, fast-flowing mountain streams, especially along edges, undercut banks, and in root masses. The family can often be confused with Isonychiidae or Baetidae, but can be distinguished by its <u>maxillae</u>, each with a row of golden pectinate spines.",
    "expandedCharacterList": "Body not flat. <u>Labrum</u> without notched <u>distal</u> margin and <strong><u>maxillae</u> each with row of golden pectinate spines</strong>. Tusks absent. Antennae shorter than twice width of head. <u>Thoracic</u> <u>notum</u> not turtle-shell-shaped. Abdominal <u>terga</u> usually without paired <u>tubercles</u>. Abdominal segment 2 with gills similar to those on other segments but NOT <u>operculate</u>/semioperculate; with single <u>lamellae</u> more or less oval and with <u>sclerotized</u> band along <u>lateral</u> margin and usually with a similar <u>sclerotized</u> band on or near mesal margin; gills usually not fringed; never ending in filaments or points. <u>Forelegs</u> without long hairs. <u>Tibiae</u> and <u>tarsi</u> not bowed; claws usually not long and slender. Claws of all legs similar, usually sharply pointed, variable in length. Three tails of about equal length."
  },
  {
    "id": 197,
    "orderId": 20,
    "commonName": "Small Minnow Mayflies",
    "scientificName": "Baetidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "This family includes roughly 152 North American species. The <u>larvae</u> of this family are usually found in <u>lotic-erosional</u> or <u>lotic-depositional</u> habitats. They tend to be <u>clingers</u> and strong <u>swimmers</u> due to their streamlined, minnow-like body shape. They feed by <u>collecting and gathering</u> food, or by <u>scraping</u> algae and <u>periphyton</u> from rocks and detritus. Adults tend to swarm nearby in open areas after emergence. <u>Duns</u> and <u>spinners</u> of this group are frequently used as models for tied flies in the fly-fishing community. <u>Larvae</u> in this group can be tricky to identify and can be easily mistaken for other families such as the Siphlonuridae and Isonychidae; however, with careful attention to detail and patience, they can be separated.",
    "expandedCharacterList": "<strong><u>Labrum</u> usually with <u>median</u> notch and antennae usually long (at least two or three times the width of the head). </strong>If <u>median</u> notch absent, then antennae long; if antennae shorter, then <u>distal</u> margin of the <u>labrum</u> always notched. Claws of all legs similarly shaped, usually pointed, rarely broad at the <u>apex</u>; claws of varying lengths, if claws of middle and <u>hind legs</u> long and slender, they are usually shorter than <u>tibiae</u>, except for few rare genera. Abdominal gills roughly oval or heart-shaped. Gill <u>lamellae</u> either single, double, or triple folded; rarely with fringe on inner margins, never with terminal filaments or pointed ends. Mature <u>larvae</u> 3-12 mm long."
  },
  {
    "id": 202,
    "orderId": 20,
    "commonName": "Armored Mayflies",
    "scientificName": "Baetiscidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 204,
    "orderId": 20,
    "commonName": "Small Square-gilled Mayflies",
    "scientificName": "Caenidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "This family includes over 30 North American species in 4 genera. They prefer slow-moving or stagnant water where there is an abundance of silt and loose sediment and are often found sprawled on/in the silt or climbing among the plants. They tend to be slow-moving and often partially cover themselves in sediment, making them difficult to spot. They feed by <u>filtering</u> or <u>collecting and gathering</u> tiny bits of food or by <u>scraping</u> algae and <u>biofilm</u> from rocks and other substrate in their habitat. Several genera in this group can be useful to fly-fishermen, but due to the short life-span, it can be difficult to time your fishing trip just right or you will miss the \"hatch\" (<u>eclosion</u> or emergence as adults).  ",
    "expandedCharacterList": "<u>Mesonotum</u> without anterolateral lobes of Neoephemeridae. Hind <u>wing pads</u> absent. <strong>Paired gills on abdominal segment 2 nearly square, and meeting or almost meeting <u>medially</u> (but NOT fused), at least partially covering succeeding pairs (semi-<u>operculate</u>)</strong>. Plate-like gills on abdominal segments 3–6 with fringed borders. Mature <u>larvae</u> 2–8 mm long, not including tails."
  },
  {
    "id": 206,
    "orderId": 20,
    "commonName": "Spiny Crawler Mayflies",
    "scientificName": "Ephemerellidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "This common and widespread group includes roughly 80 North American species in 9 genera. <u>Larvae</u> can be readily identified, as this is the only mayfly group with gills absent on abdominal segment 2. They tend to be found in <u>lotic-erosional</u> or <u>depositional</u> habitats, often among the rooted aquatic plants, moss, root masses, or woody debris. They usually are poor <u>swimmers</u>, swimming with a floppy motion, and instead <u>sprawl</u> or <u>cling</u> to the plants or other substrates in their habitat. The family has a variety of feeding strategies, differing among species, including <u>collector-gatherers</u>, <u>scrapers</u>, some shredders of <u>detritus</u> or <u>algae</u>, and even one predator. When a <u>larva</u> is disturbed it sometimes raises its tail over its head like a scorpion, possibly as an adaptation to fend off predators; however, they cannot sting. After emergence, adults sometimes swarm atypically high, even above tree tops. This group is one of the most important for the fly-fishing community, with at least 30 different species being used as models for tied flies.",
    "expandedCharacterList": "Gills on abdominal segment 1 rudimentary or absent.<strong> Abdominal segment 2 without gills</strong>. Gills on abdominal segments 3 (if present) and 4–7 have two layers: a top layer that is oval and plate-like and a bottom layer that is multi-lobed; in preserved specimens these gills lying in paired <u>dorsal</u> depressions and camouflaged, not readily seen by novices. Abdominal <u>terga</u> often with paired <u>tubercles</u>. Mature <u>larvae</u> 5–15 mm long, not including tails."
  },
  {
    "id": 212,
    "orderId": 20,
    "commonName": "Common Burrowing Mayflies",
    "scientificName": "Ephemeridae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "<u>Larvae</u> of the mayfly family Ephemeridae have large, distinct mandibular tusks projecting forward from the head, used to help <u>burrow</u> in soft silty sand or marl along the edges of still-water habitats or along the quiet parts of streams. They react negatively to light and immediately <u>burrow</u> back into the sediment if removed. <u>Larvae</u> also have feathery gills along the abdomen, giving them a rather “fluffy” appearance from the <u>dorsal</u> side. They are able to undulate these gills in order to increase flow of water for oxygen intake, which is especially important in the burrows where there is little water flow. The adults of this group are popular for fly-fishing enthusiasts because they are relatively large, and the <u>duns</u> (flying subadults) emerge in large numbers. The <u>larvae</u> are also sometimes used as bait.",
    "expandedCharacterList": "<strong>Large tusks</strong> project forward anteriorly from the face and are visible <u>dorsally</u>, when viewed <u>laterally</u> they curve upward. <strong>Fore<u>tibiae</u> are fossorial </strong>(modified for burrowing: expanded or with <u>tubercles</u>). <strong><u>Ventral</u> <u>apex</u> of each hind <u>tibia</u> acutely pointed</strong>. <strong>Abdominal gills on segments 2–7 are conspicuous <u>dorsally</u>, forked and elongate-lancolate, with fringed margins</strong>, giving the animal a fluffy appearance."
  },
  {
    "id": 215,
    "orderId": 20,
    "commonName": "Flat-headed Mayflies, Cookie-Head Mayflies",
    "scientificName": "Heptageniidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "There are over 100 North American species in 11 genera in the mayfly family Heptageniidae. They are found in <u>lotic</u> or <u>lentic</u> erosional habitats, often among rocks. They are sometimes <u>collector-gatherers</u> of fine organic particles; however, they typically feed by <u>scraping</u> algae and <u>periphyton</u> from rocks and other substrates at the bottom of the stream. They have a flattened head and body, which allows them to <u>cling</u> to the tops of the rocks, even in fast flowing water, without being swept away, or to squeeze among rocks. This flat body shape makes them great at <u>clinging</u> to surfaces, but fairly poor, floppy <u>swimmers</u>. The emerging <u>duns</u> (sub-adults) are important in the fly-fishing community, with several genera in the family serving as models for tied flies.",
    "expandedCharacterList": "<strong>Head and body dorsoventrally flattened (depressed)</strong>. Eyes and antennae positioned <u>dorsally</u>. <strong><u>Lateral</u> margins of head visible beside the eyes</strong>. Mandibles not visible from <u>dorsal</u> side. Claws much shorter than <u>tarsi</u>. <u>Tibiae</u> and <u>tarsi</u> straight. Abdominal gills on segments 2–7 variably shaped depending on genus and species."
  },
  {
    "id": 31,
    "orderId": 20,
    "commonName": "Brush-legged Mayflies",
    "scientificName": "Isonychiidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "<em>Isonychia </em>is the only genus in the family Isonychiidae. There are about 15 known North American species. They have a widespread distribution east of the Rocky Mountains, and tend to be found <u>swimming</u> in fast-flowing water. They have a <u>fusiform</u>, minnow-like body shape, making them strong <u>swimmers</u> and <u>clingers</u>. Long <u>setae</u> (hair) on the inner margins of the <u>femora</u> and <u>tibia</u> of <u>forelegs</u> are used for filter feeding, a trait almost unique to this group of mayflies (also occurring in the rare family Oligoneuriidae). They are important in the trout and fly fishing community as \"Slate Drakes\" due to their frequent but periodic hatches (emergence of <u>subimagos</u> or \"<u>duns</u>\") and return to the water surface as spent adults (<u>imagoes</u> or \"<u>spinners</u>\") in June–October.",
    "expandedCharacterList": "<strong><u>Femora</u> and <u>tibia</u> of <u>forelegs</u> with double rows of long <u>setae</u> along inner margins</strong>. Abdominal segment 1 with dorsolateral gills, similar in appearance other gills, each consisting of longer <u>dorsal</u> <u>lamella</u> and shorter <u>fibrilliform</u> portion. <strong><u>Nymphs</u> with streamlined, minnow-like body shape</strong>. <em>Isonychia </em>is the only genus in the family. Widespread and common."
  },
  {
    "id": 222,
    "orderId": 20,
    "commonName": "Little Stout Crawler Mayflies",
    "scientificName": "Leptohyphidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "<u>Larval</u> members of this family tend to be found in small streams and rivers in areas of slow flow; however, they can be found in <u>lentic</u>-<u>littoral</u> habitats as well. They are often found <u>sprawling</u> on many different substrates, such as sand, silt, or even gravel, as well as <u>clinging</u> to root masses, woody debris, or among various plants. They usually <u>collect and gather</u> small bits of organic particles for food, or some taxa also filter feed. The <u>larvae</u> in this family have gills well-adapted to their environment; the gills on abdominal segment 2 are <u>operculate</u>, covering the rest of the abdominal gills to prevent them from getting damaged by sediment. <u>Larvae</u> also fan their gills in order to increase the flow of water across their surface area, increasing the amount of oxygen they can absorb. Adults and <u>duns</u> (sub-adults) in the genus <em>Trycorythodes </em>(Dark Brown Spinner, Pale Olive Dun, and Reverse Jenny Spinner) are especially important to the fly-fishing community due to their extremely large emergences.",
    "expandedCharacterList": "<strong>The gills on abdominal segment 2 are <u>operculate</u> or semioperculate, roughly triangular or oval,</strong> <strong>and not touching or fusing <u>medially</u></strong>. Abdominal segments 3–6 with <u>lamelliform</u> (plate-like) portion of gills simple or with two lobes, never with fringed margins."
  },
  {
    "id": 224,
    "orderId": 20,
    "commonName": "Prong-gilled Mayflies",
    "scientificName": "Leptophlebiidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "There are about 70 North American species in this family. <u>Larvae</u> tend to be found in gravel-bottomed streams, with woody debris, or among roots along banks; however, some can be found in <u>lentic</u> situations. Mature <u>larvae</u> are 4–15 mm long. They tend to be <u>clingers</u> and moderately fast <u>swimmers</u>. Most feed by <u>collecting and gathering</u> food, however, some <u>scrape</u> <u>periphyton</u> from rocks or gather particles of detritus, others filter particles from the water. The gills are often forked, giving them the name “Pronggills”. We like to refer to their gills as <u>deciduous</u>, because they are extremely fragile and fall off the insect readily, like autumn leaves. They have relatively flat bodies, and thus can be easily mistaken for Heptageniidae, however, they can be distinguished because the mandibles protrude at the side of the face making them visible <u>dorsally</u>.",
    "expandedCharacterList": "Mandibular tusks absent. Gills on abdominal segment 1 with single or double <u>lamellae</u> (plates) or forked. <strong>Gills on segments 2–7 double-layered lamellate (plate-like) and terminated in filaments or points and without fringe, or oval with fringe.</strong>"
  },
  {
    "id": 228,
    "orderId": 20,
    "commonName": "Cleft-footed Minnow Mayflies",
    "scientificName": "Metretopodidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 230,
    "orderId": 20,
    "commonName": "Pale Burrower Mayflies",
    "scientificName": "Polymitarcyidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 232,
    "orderId": 20,
    "commonName": "Hackle-gills",
    "scientificName": "Potamanthidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 234,
    "orderId": 20,
    "commonName": "Primitive Minnow Mayflies",
    "scientificName": "Siphlonuridae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 113,
    "orderId": 52,
    "commonName": "Long-toed Water Beetles",
    "scientificName": "Dryopidae",
    "lifeStageName": "adult",
    "lifeStagePrettyName": "Adult",
    "description": "This family is relatively small, with only 5 North American genera, including 13 species. Unlike most water beetles, the <u>larvae</u> of this family are terrestrial <u>burrowers</u> and only the adults are aquatic, usually found in riffles, although some less-common species can be <u>lentic</u> as well. They are <u>shredding herbivores</u> and <u>scrapers</u>. The long claws of the adults make them good clingers and climbers on woody debris and other substrates. Similar to the Elmidae, these adult beetles use a plastron (thin layer of air held against the spiracles) to obtain oxygen from the water and usually don’t need to surface for air. These adult beetles can have a fairly long life-span, with the life cycle taking up to two years in some cases.",
    "expandedCharacterList": "<strong>Head usually partially contracted into thorax</strong>. <strong>Each antenna 11-segmented, usually with enlarged <u>basal</u> segment and expanded 2nd segment covering remaining antennal segments folded beneath it</strong>. <u>Prosternum</u> expanded anteriorly as prominent lobe beneath head. <u>Elytra</u> concealing entire abdomen or exposing only part of one abdominal tergite. All <u>tarsi</u> 5-segmented. <strong>Forelegs with <u>transverse</u> <u>coxae</u> and visible trochantins, unlike Elmidae</strong>. Hind <u>coxae</u> not touching. Abdomen 5- or 6-segmented."
  },
  {
    "id": 115,
    "orderId": 52,
    "commonName": "Predaceous Diving Beetles",
    "scientificName": "Dytiscidae",
    "lifeStageName": "adult",
    "lifeStagePrettyName": "Adult",
    "description": "This is the largest North American family of aquatic beetles, including over 400 species in about 35 genera. Both adults and <u>larvae</u> can be found in almost any aquatic habitat, even in brackish water; however, they are most often found in <u>lentic</u> freshwater systems. The <u>larvae</u> tend to be climbers on rooted plants and swimmers; adults are swimmers and divers. Both <u>larvae</u> and adults are <u>engulfing predators</u> of small invertebrates and fish, and are sometimes cannibalistic. Some <u>larvae</u> have a channel along the inner margin of each mandible to help them ingest fluids from their prey. Their bite is quite painful. Despite living in the water, adults and <u>larvae</u> of most species must regularly resurface for air.",
    "expandedCharacterList": "<u>Ventrally</u>, <u>pronotum</u> with conspicuous curved lines near each <u>lateral</u> margin (notopleural <u>sutures</u>). <u>Metasternum</u> without <u>transverse</u> <u>sutures</u>. <u>Elytra</u> covering entire abdomen or exposing only part of 1 tergite.<strong> Hind <u>coxae</u> each with median portion extending in posterior direction, dividing abdominal segment 1 into <u>lateral</u> <u>sclerites</u>, but not expanding into broad plates. Without large spur on end of each front <u>tibia</u>. Dyticidae without broad wedge-like hind <u>coxal</u> plate. <u>Scutellum</u> usually visible; if hidden, then front and middle <u>tarsi</u> apparently 4-segmented and hind <u>tarsi</u> each with 1 claw. </strong>Hind <u>tarsi</u> and usually <u>tibiae</u> flattened, streamlined, and bearing long, stiff swimming bristles. Body usually 3–25 mm long."
  },
  {
    "id": 119,
    "orderId": 52,
    "commonName": "Riffle Beetles",
    "scientificName": "Elmidae",
    "lifeStageName": "adult",
    "lifeStagePrettyName": "Adult",
    "description": "This is a large family, including 24 genera and close to 100 species. They are known as riffle beetles, due to their common occurrence in habitats with fast-flowing water and high oxygen levels. Both <u>larvae</u> and adults are slow-moving <u>clingers</u> that feed by <u>scraping</u> or <u>collecting and gathering</u> <u>periphyton</u> and detritus from surfaces of rocks and other substrates. The <u>larvae</u> get their oxygen directly from gills that can be retracted into the end of the abdomen. Adults have an effective plastron and usually do not need to surface for air. Elmid <u>larvae</u> are unusual in that they have up to 8 instars, whereas most beetle <u>larvae</u> molt only 3 times.",
    "expandedCharacterList": "Terminal segment of each antenna no longer than combined length of 2 preceding segments; <strong>antennae thread-like.</strong> <u>Elytra</u> concealing entire abdomen or exposing only part of 1 tergite. <strong>Each leg with 5 tarsal segments, last tarsal segment about as long as other segments combined and with big claws</strong>. Abdomen with 5 visible segments."
  },
  {
    "id": 135,
    "orderId": 52,
    "commonName": "Whirligig Beetles",
    "scientificName": "Gyrinidae",
    "lifeStageName": "adult",
    "lifeStagePrettyName": "Adult",
    "description": "Adult members of the family Gyrinidae are unique in that their <u>compound eyes</u> are divided into separate <u>dorsal</u> and <u>ventral</u> portions, giving them a \"four-eyed\" appearance. This allows them to see both above and below the water at the same time. Their nickname, “whirligig beetles” was given to the adult beetles due to their behavior of zipping around in swirling motions along the surface of the water, although they are also good <u>divers</u>. Both the <u>larvae</u> and adults of this family are aquatic, typically found in quiet water of <u>lentic</u> or <u>lotic</u> habitats. The pupae are terrestrial. Both adults and <u>larvae</u> are <u>engulfing predators</u> of small invertebrates, but the adults may also be surface film scavengers. <u>Larvae</u> live and feed on the bottom or climb on rooted plants.",
    "expandedCharacterList": "Short antennae with clubbed <u>apices</u>. <strong><u>Compound eyes</u> divided into separate <u>dorsal</u> and <u>ventral</u> portions (\"4-eyed\" appearance). </strong>"
  },
  {
    "id": 140,
    "orderId": 52,
    "commonName": "Crawling Water Beetles",
    "scientificName": "Haliplidae",
    "lifeStageName": "adult",
    "lifeStagePrettyName": "Adult",
    "description": "This family includes over 70 North American species. Both the <u>larvae</u> and adults of this family are aquatic. They can be found in <u>lentic</u>-<u>littoral</u> or <u>lotic-depositional</u> habitats. They are good <u>climbers</u> among the rooted plants found in their habitats. Adults can be strong swimmers as well. Both life stages have similar feeding habits; they tend to be <u>shredding</u> or <u>piercing herbivores</u>, but some are <u>engulfing predators</u>. The <u>larvae</u> sometimes overwinter in moist soil before molting into pupae and then adults. The adults must frequently resurface for air; however, the <u>larvae</u> get all of their oxygen from the water.",
    "expandedCharacterList": "<u>Elytra</u> concealing entire abdomen. <strong>Hind <u>coxae</u> (first segment of the last leg) expanded into a broad, flat, plates, <u>ventrally</u> covering the first 2 or 3 abdominal segments and most of hind <u>femora</u></strong>. Adult beetles &gt; 3 mm long. "
  },
  {
    "id": 143,
    "orderId": 52,
    "commonName": "Water Scavenger Beetles",
    "scientificName": "Hydrophilidae",
    "lifeStageName": "adult",
    "lifeStagePrettyName": "Adult",
    "description": "Hydrophilidae is the second largest family of North American aquatic beetles, including roughly 200 species. The <u>larvae</u> and adults are aquatic or semiaquatic; the pupae are terrestrial. They prefer <u>lentic</u> waters such as ponds and shallow lakes, or sometimes in pools at edges of streams. Unlike most beetles, the adults of this family tend to swim by alternating strokes with their <u>hind legs</u>, rather than moving them in unison. Also atypical, they have a habit of surfacing for air head-first, breaking the water surface tension with a clubbed antenna, the <u>apical</u> segments of which are covered with dense water-repelling (<u>hydrophobic</u>) hairs. The adults have a well-developed plastron to hold air underwater; in well-oxygenated water, it serves as a gill. <u>Larvae</u> frequently surface to take in air from the end of the abdomen. <u>Larvae</u> are usually predators of other invertebrates, and can even break snail shells with their strong jaws. However, only a small number of adults are predators, most are omnivores or detritivores. ",
    "expandedCharacterList": "<strong><u>Maxillary</u> <u>palpi</u> usually longer than antennae. Antennae about as long as head, with 2nd segment attached at <u>apex</u> of 1st (<u>basal</u>-most) segment; usually with 5 segments before <u>cupule</u> (cup-shaped, hairless, segment 6); segments 7–9 clubbed</strong>. <u>Pronotum</u> usually not narrower than <u>elytra</u>; if narrower, then <u>scutellum</u> long and triangular. <u>Elytra</u> concealing entire abdomen or exposing only part of 1 segment. Hind <u>coxae</u> not extending in the posterior direction to divide abdominal sternite 1. <u>Metacoxae</u> nearly touching. <u>Ventrally</u>, longitudinal <u>keel</u> narrow between <u>coxae</u>. <u>Tarsal formula</u>: 5-5-5 or 5-4-4. <u>Ventrally</u>, abdomen with 5 visible segments."
  },
  {
    "id": 156,
    "orderId": 53,
    "commonName": "Watersnipe Flies",
    "scientificName": "Athericidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "The aquatic fly genus Atherix includes 3 North American species. Aquatic snipe flies usually prefer streams and rivers with lots of dissolved oxygen, such as in <u>lotic-erosional</u> or <u>depositional</u> habitats. They can be found <u>sprawling</u> or <u>burrowing</u> in the substrate. Though they might not look like it, the <u>larvae</u> are <u>piercing predators</u> with strong hooks in the narrow head. To the novice, a <u>larva</u> looks much like a caterpillar, with <u>ventral</u> <u>prolegs</u> and terminal appendages that appear to be antennae. However, those appendages are at the wrong end of the body: their “antennae” are actually long posterior <u>tubercles</u>, divergent terminal fringed processes that help with locomotion and serve as backend \"feelers.\"",
    "expandedCharacterList": null
  },
  {
    "id": 158,
    "orderId": 53,
    "commonName": "Net-winged Midges",
    "scientificName": "Blephariceridae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 160,
    "orderId": 53,
    "commonName": "Biting Midges, No-See-Ums, Punkies, Sand Flies",
    "scientificName": "Ceratopogonidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "This fly family includes approximately 34 North American genera, encompassing over 100 species; though not all are aquatic, most genera have at least a few aquatic species. Aquatic/semiaquatic larvae can be found <u>burrowing</u> in damp sand along beaches, <u>swimming</u> and <u>sprawling</u> among plants in both flowing and still water habitats, sometimes even in water-filled tree holes or pitcher plants. Feeding habits vary greatly depending on the species and maturity of the <u>larvae</u>, they are often predators of aquatic insect eggs, others are <u>collector-gatherers</u> or grazers on <u>periphyton</u> and detritus. Aquatic pupae do not make cocoons; they stay near the water surface and use snorkel-like structures that protrude from the thorax to breathe air. Many adult females bite and feed on blood; they need the protein to produce eggs. The bites of most species cause an annoying itch; some terrestrial species are considered pests and can transmit human filarial worms and diseases of other birds and mammals.",
    "expandedCharacterList": "Mandibles move against each other along a horizontal or oblique plane. <strong>Head complete and fully exposed.</strong> <u>Spiracles</u> absent (apneustic). <u>Thoracic</u> segments individually distinguishable. Thorax and abdomen similar in diameter or abdomen wider. <strong>If <u>pro</u>thorax without <u>prolegs</u>, body usually smooth, shiny, and cream-colored, usually without any surface features except few <u>setae</u>, especially posteriorly</strong>, and sometimes single retractile <u>anal proleg</u> bearing few hooks. <strong>If <u>pro</u>thorax with pair of <u>ventral</u> <u>prolegs</u>, then <u>pro</u>thoracic and <u>anal prolegs</u> usually paired (even if divison slight and only at <u>apex</u>) and distinct <u>dorsal</u> fleshy projections and/or <u>setae</u> along body</strong>. Mature <u>larvae</u> approximately 2–15 mm long. "
  },
  {
    "id": 162,
    "orderId": 53,
    "commonName": "Non-Biting Midges, Midges",
    "scientificName": "Chironomidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "This group is estimated to include up to 2,000 North American species. It is the most widespread and often most abundant aquatic insect family. The <u>larvae</u> and pupae can be found in almost any aquatic habitat. They live on the bottom, sometimes within slender tubes of silk and detritus. The <u>larvae</u> must be slide-mounted in order to be identified to genus. Different species vary greatly in pollution tolerance. Shed pupal skins can be collected from surface water and identified, sometimes more easily than for <u>larvae</u> or adults. <u>Larval</u> feeding strategies vary greatly, ranging from <u>collector-gatherers</u>, to predators. <u>Larvae</u> are often abundant and an important link of the food web, as most aquatic predatory species use them as a primary food resource at some point during their life cycle. The <u>larvae</u> pupate on the bottom, and then the pupae swim to the surface to emerge as adults, which usually survive for only a few days to mate and lay eggs.",
    "expandedCharacterList": "Mandibles move against each other along horizontal or oblique plane. <strong>Head complete and fully exposed</strong>. <strong>Hook-bearing <u>pro</u>thoracic and <u>anal prolegs</u> paired</strong>, though division may be slight and only at <u>apex</u>. <u>Spiracles</u> absent (apneustic). Body segments usually without conspicuous <u>dorsal</u> <u>tubercles</u> and <u>setae</u> as in some Ceratopogonidae."
  },
  {
    "id": 168,
    "orderId": 53,
    "commonName": "Mosquitoes",
    "scientificName": "Culicidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 170,
    "orderId": 53,
    "commonName": "Meniscus Midges",
    "scientificName": "Dixidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 172,
    "orderId": 53,
    "commonName": "Dance Flies",
    "scientificName": "Empididae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 174,
    "orderId": 53,
    "commonName": "Shore Flies",
    "scientificName": "Ephydridae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 175,
    "orderId": 53,
    "commonName": "Limoniid Crane Flies",
    "scientificName": "Limoniidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "Limoniidae, previously a subfamily of Tipulidae (Limoniinae), are now considered their own family. Both Limoniidae and Tipulidae are part of the larger group of crane flies, Tipulomorpha. Often these are relatively large, grey or white, soft-bodied, legless <u>larvae</u>. The head is inconspicuous, mostly retracted into the thorax and almost completely hidden from view. They are often sold in bait shops, or used as models for tied flies, especially for bass fishing. Usually, <u>larvae</u> are found <u>burrowing</u> in soft sediment of streams, often near algae or woody debris; but some <u>larvae</u> are terrestrial. They vary in feeding strategy, some are predators while others are <u>shredding detritivores</u> and <u>herbivores</u>. Most species have only 1 generation per year. Pupa usually are found in marginal habitats. Adults resemble giant mosquitoes, with long, delicate legs; however, they do not bite.",
    "expandedCharacterList": "Mandibles moving against one another along an horizontal or oblique plane. <strong>Hardened head capsule always deeply retracted inside thorax</strong>; often with length-wise incisions of varying depths beginning at posterior margin of head, and extending forward; in extreme cases head consisting of only several slender rods (visible only via disection of thorax). <u>Spiracles</u> absent (apneustic) or with 1 pair at posterior end of body (<u>meta</u>pneustic); <strong>posterior <u>spiracles</u> rimmed by 2–7 (usually 5) lobes</strong> often fringed with hair. Mature <u>larvae</u> usually 10–25 mm long. "
  },
  {
    "id": 178,
    "orderId": 53,
    "commonName": "House Flies",
    "scientificName": "Muscidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 180,
    "orderId": 53,
    "commonName": "Hairy-eyed Crane Flies",
    "scientificName": "Pediciidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 182,
    "orderId": 53,
    "commonName": "Moth Flies",
    "scientificName": "Psychodidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 184,
    "orderId": 53,
    "commonName": "Phantom Crane Flies",
    "scientificName": "Ptychopteridae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 186,
    "orderId": 53,
    "commonName": "Black Flies",
    "scientificName": "Simuliidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "There are over 255 North American species in this family. The genera <em>Simulium </em>and <em>Prosimulium </em>include most of these. <u>Larvae</u> spin a pad of silk and glue it it to the substrate, then use hooks on the posterior end to grasp the silk pad and suspend themselves in the current, where they feed. If a <u>larva</u> is disturbed by a predator it uses a strand of silk from their mouth that is tethered to the substrate to climb back to their rock once the predator has left. They use comb-like fanning structures on their head to filter food from the water. Generally, this group is considered tolerant to pollution, however, they can be found only in clean water as well, depending on the species. Adult black flies are terrestrial, and the females are biting pests. The bites can cause allergic reactions in some people, and in cases where the numbers are high can cause blood loss and become dangerous for some mammal species. In the tropics, flies in this family can transmit diseases such as river blindness. Fly fishermen often refer to members of this group as smuts, and sometimes use <u>larvae</u> or pupae in their fly patterns.",
    "expandedCharacterList": "Mandibles move against each other along a horizontal or oblique plane. <strong>Head complete, fully exposed</strong>, distinct from thorax, and usually without lengthwise incisions.<strong> Head capsule usually with pair of conspicuous fans</strong>. <u>Pro</u>thorax with single <u>proleg</u> <u>ventrally</u>. <u>Thoracic</u> segments usually individually distinguishable. <strong>Posterior abdominal segments 5–8 swollen,</strong> <strong>with ballooned or bowling-pin appearance</strong>. Last abdominal segment ringed with several radiating rows of small hooks. Mature <u>larvae</u> usually 3–8 mm long, or greater."
  },
  {
    "id": 189,
    "orderId": 53,
    "commonName": "Soldier Flies",
    "scientificName": "Stratiomyidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 191,
    "orderId": 53,
    "commonName": "Hover Flies",
    "scientificName": "Syrphidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 193,
    "orderId": 53,
    "commonName": "Large Crane Flies",
    "scientificName": "Tipulidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "Until recently, Tipulidae included all species of \"crane flies.\" As now more strictly defined, this widespread family includes at least 53 species in North America. <u>Larvae</u> of some species are terrestrial, but aquatic <u>larvae</u> inhabit quiet areas of streams and shores of lakes, <u>burrowing</u> in the soil, often among roots, <u>shredding</u> living and dead plant material.",
    "expandedCharacterList": "<u>Larvae</u> lacking fleshy projections on <u>thoracic</u> and abdominal segments.<strong> Posterior <u>spiracular disc</u> bordered by 6 (rarely 8) lobes (2 <u>dorsal</u>, 2 dorsolateral, 2 <u>ventral</u>)</strong>; lobes usually subconical, sometimes short and blunt. As for all crane flies, adults usually large, with long legs and V-shaped <u>sutures</u> on top of <u>meso</u>thorax, but terminal segment of each <u>maxillary</u> <u>palp</u> longer than previous 2 segments combined and antennae each 13-segmented."
  },
  {
    "id": 236,
    "orderId": 54,
    "commonName": "Giant Water Bugs",
    "scientificName": "Belostomatidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "The Belostomatidae, or giant water bugs, include 19 species in 4 genera in North America. Other common names include toe-biters, electric-light bugs (because they often fly to lights at night), or alligator ticks/fleas (in Florida). Some species are among the largest insects. Both <u>larvae</u> and adults live usually among rooted plants in quieter water such as ponds and slowly flowing streams. Both <u>larvae</u> and adults are <u>piercing predators</u>, either stalking or ambushing their prey. Once captured, the prey are injected with salivary secretions to dissolve soft tissue and then the resulting liquid is sucked back through their sharp beaks. Younger <u>larvae</u> and small adults eat mainly other macroinvertebrates, but larger species eat larger crustaceans and small fish and amphibians. There are reports of the largest species consuming baby turtles and water snakes. They are known to feign death, lying still while secreting a fluid from the anus. Even small specimens should be handled carefully because they can inflict a very painful bite; fortunately, the effects soon wear off with no lasting consequences. Males of many species tend the clutch of eggs laid by the female either on the male's back or on vegetation while the male stands guard nearby. Giant water bugs are eaten for food and are considered a delicacy especially by people in eastern and southern Asia.",
    "expandedCharacterList": "Depressed (flattened dorsoventrally), with elongate-oval shape in dorsal view. Eyes bulging from sides of head. Antennae shorter than head, usually hidden beneath eyes. Beak cylindrical and 3-segmented. Front legs <u>raptorial</u>, with <u>tibiae</u> and <u>femora</u> fitting tightly together to grasp prey. All legs flattened and equipped for <u>swimming</u>, mostly in short bursts. Pair of flat, retractile air straps in posterior end of abdomen for occasional respiration at water surface."
  },
  {
    "id": 238,
    "orderId": 54,
    "commonName": "Water Boatmen",
    "scientificName": "Corixidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "The Corixidae, or water boatmen, include about 130 species in 20 genera in North America, making it the most species-diverse family of freshwater Hemiptera. They are very efficient <u>swimmers</u>, moving quickly near the bottom of weedy, quieter water habitats (ponds and slowly flowing streams). They feed mostly on the sap of freshwater plants, but occasionally prey on small macroinvertebrates or even eat small particles of detritus. Eggs are laid on solid objects under water. The front <u>tarsi</u> of males are usually equipped with tiny pegs that can be rubbed across the triangular, grooved <u>rostrum</u> to make sound under water. Both males and females are often attracted to lights at night.",
    "expandedCharacterList": "Generally smaller bugs, nearly parallel-sided in <u>dorsal</u> view, slightly <u>convex</u> <u>dorsally</u>. <strong><u>Rostrum</u> (beak) uniquely triangular</strong> (not extended as slender needle). Antennae shorter than head and hidden in <u>dorsal</u> view."
  },
  {
    "id": 240,
    "orderId": 54,
    "commonName": "Water Striders",
    "scientificName": "Gerridae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "There are about 46 North American species of water striders in 9 genera. Using water-repelling hairs on their <u>tarsi</u> (feet) to stay on top of the water and water-surface-penetrating claws to gain purchase in the water-surface tension, these familiar insects skate rapidly on the surface of open water of <u>lentic</u> habitats and slowly flowing areas of streams. Their movements are clumsy on shore. Because adults often lack wings, distinguishing <u>nymphs</u> from adults requires careful examination of genital structures. Both <u>larvae</u> and adults feed on living and dead insects trapped on the water surface.",
    "expandedCharacterList": "Antennae longer than head and conspicuous in <u>dorsal</u> view. If wings present, membrane without distinct, similar cells defined by wing veins. <strong>Claws of at least front <u>tarsi</u> arising before tarsal <u>apices</u>. Hind <u>femora</u> much longer than abdomen.</strong>"
  },
  {
    "id": 242,
    "orderId": 54,
    "commonName": "Creeping Water Bugs",
    "scientificName": "Naucoridae",
    "lifeStageName": "adult",
    "lifeStagePrettyName": "Adult",
    "description": "The family Naucoridae includes 5 North American genera with roughly 20 species. However, <em>Pelocoris </em>is the only genus found in the eastern United States. <em>Pelocoris </em>typically inhabits weedy ponds or quiet water. They are generally <u>clingers</u>, but are good <u>swimmers</u> as well. They are <u>piercing predators</u>, with strong grasping <u>forelegs</u> to capture their prey (other small invertebrates). Be careful when handling them; their bite is painful! Fortunately, the pain soon dissipates and leaves no lasting consequences. Some adults in this family have up to four million tiny <u>hydrophobic</u> hairs per square mm that help hold a layer of air (plastron) against the ventrolateral <u>spiracles</u> while underwater so that they do not need to come to the water surface to breathe. Some species also fan this plastron with their hind legs, to increase the current moving across it, and thus increase the diffusion of oxygen from the water.",
    "expandedCharacterList": "<strong>Similar in appearence to Belostomatidae (giant water bugs) except that margins of eyes are contiguous with anterior margin of head and retractile breathing straps absent from end of abdomen</strong>. Beak cylindrical and 3- or 4-segmented. Antennae shorter than head and located beneath eyes, not readily visible <u>dorsally</u>. Middle and <u>hind legs</u> with fringe like hairs, useful for swimming. <strong>Legs are <u>raptorial</u> (suitable for use in predation) with broad <u>femora</u>, and weakly <u>convex</u> <u>dorsally</u>.</strong>"
  },
  {
    "id": 244,
    "orderId": 54,
    "commonName": "Waterscorpions",
    "scientificName": "Nepidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 246,
    "orderId": 54,
    "commonName": "Backswimmers",
    "scientificName": "Notonectidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 248,
    "orderId": 54,
    "commonName": "Broad-Shouldered Water Striders, Shortlegged Water Striders, Riffle Bugs",
    "scientificName": "Veliidae",
    "lifeStageName": "adult",
    "lifeStagePrettyName": "Adult",
    "description": "There are roughly 35 species in the family Veliidae. They are referred to as \"riffle bugs\" because they are often found on the surface of fast-flowing water. Members of this group are <u>piercing predators</u>. They wait at the surface and grab small living or dead invertebrates that swim or drift by. The <u>hydrophobic</u> (water-repelling) structure of the <u>tarsi</u> (last segment of each leg) helps them stay on the water surface. Most insects have their claws at the most <u>apical</u> tip of each leg; however, riffle bugs have the claws positioned before the <u>apex</u>. The claws are not <u>hydrophobic</u> and pierce the water surface, giving them \"grip\" for running on it.",
    "expandedCharacterList": "Head with visible <u>gula</u> (suborder Heteroptera). <strong>Antennae longer than head</strong>, positioned anterior to eyes, clearly visible from <u>dorsal</u> side. <u>Dorsum</u> of head typically with <u>median</u> longitudinal <u>sulcus</u> or smooth stripe. <strong>At least front <u>tarsi</u> with ante-<u>apical</u> claws (claws protruding from leg before <u>apex</u>)</strong>. <u>Meso</u>thoracic legs about equidistant between front and <u>hind legs</u>, if NOT, then middle <u>tarsi</u> with feather-like or blade-like structures. <strong>Hind <u>femora</u> short (shorter than abdomen, or just barely longer)</strong>. <u>Laterally</u>, <u>metasternum</u> with pair of scent grooves anterior to hind <u>coxae</u>."
  },
  {
    "id": 251,
    "orderId": 55,
    "commonName": "Aquatic Caterpillars, Snout Moths",
    "scientificName": "Crambidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "Most caterpillars in the family Crambidae are terrestrial; however, a few of these caterpillars are truly aquatic (about 740 species worldwide). They are holometabolous, meaning they have egg, <u>larva</u>, pupal, and adult stages. They can be found in a variety of habitats including <u>lentic</u> and <u>lotic</u> habitats. Most <u>larvae</u> feed on floating plants or algae on rock surfaces. Often, first instar <u>larvae</u> are <u>hydrophilic</u> (water-loving) and absorb oxygen directly from the water. As the <u>larvae</u> become larger they tend to be <u>hydrophobic</u> (water-resistant) with a layer of air held against the body. This is advantageous, as oxygen diffuses more rapidly through air than water. They often have a close relationship with a host plant on which they both live and feed; these plant feeders often cover themselves with pieces of leaf or they burrow in the stem. The algal-feeding species spin a silk tent from beneath which they graze on the algae. They pupate in or beneath the plant and silk material, and emerge as terrestrial snout moths.",
    "expandedCharacterList": "<u>Ventral</u> <u>prolegs</u> present on abdominal segments 3, 4, 5, 6, and 10. Segmented <u>thoracic</u> legs present. Gills sometimes present on sides of abdomen. <strong><u>Prolegs</u> with crochets (tiny hooks) in <u>transverse</u> ellipses or bands</strong>."
  },
  {
    "id": 109,
    "orderId": 56,
    "commonName": "Hellgrammites, Dobsonflies, Fishflies",
    "scientificName": "Corydalidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "There are 6 genera in this family including about 20 species. The <u>larvae</u> are <u>engulfing predators</u> actively search for food, mostly small invertebrates. Members of this family tend to be found in the fastest part of the riffle, among the rocks; however, some species can be found in still water as well. The <u>larvae</u> (hellgrammites) are often preferred as live bait by fishermen due to their high activity and long life on a hook, making them more likely to attract fish. Adults probably do not feed. Males of some species have very long sword-like mandibles used in mating rituals. (Females prefer males with large jaws.)",
    "expandedCharacterList": "<strong>Abdominal segments 1–8 with paired, 2-segemented, <u>lateral</u> filaments</strong>. Abdominal segment 10 has pair of 1-segemented filaments. <strong>End of abdomen with pair of <u>anal prolegs</u>, each bearing 2 claws</strong>. Mature <u>larvae</u> 30–65 mm long."
  },
  {
    "id": 111,
    "orderId": 56,
    "commonName": "Alderflies",
    "scientificName": "Sialidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 253,
    "orderId": 57,
    "commonName": "Darners",
    "scientificName": "Aeshnidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "The dragonfly family Aeshnidae includes 10 genera. <em>Aeshna </em>is the largest genus, including 20 out of 38 North American species in the family. Like most dragonfly <u>larvae</u>, members of this family are predators, feeding on invertebrates and even small fish by stalking their prey. They can be found <u>climbing</u> on aquatic plants or root masses, in still or slowly flowing water. They are sometimes used as models for tied flies for fly-fishing; usually larger species are imitated, and the hook made to sink and be teased along the bottom to mimic their behavior. The adults are <u>perchers</u>, meaning when flying they will frequently pause to rest on branches or other prominent objects for a few seconds before taking off again. Some species migrate, flying South in winter, and as far north as Canada in the summer.",
    "expandedCharacterList": "Suborder Anisoptera (i.e., dragonflies: with stout body shape, head more narrow than thorax and abdomen; end of abdomen with 5 short pointed projections, external gills absent).<strong> <u>Labial mask</u> (including its palm and pair of <u>apical</u> lobes) flat or nearly so.</strong> <u>Setae</u> absent from inside palm of <u>mask</u> (pre-mental <u>setae</u>). <u>Ligula</u> (<u>distal</u> margin of the <u>labial mask</u>) with <u>median</u> notch. <strong>Antennae usually slender or bristle-like, with 6- or 7-segments</strong>. <strong>Fore- and middle <u>tarsi</u> each 3-segmented</strong>. Mature <u>larvae</u> 31–50 mm long."
  },
  {
    "id": 255,
    "orderId": 57,
    "commonName": "Broad-winged Damselflies",
    "scientificName": "Calopterygidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "The family Calopterygidae belongs in Zygoptera, or damselflies, and is not a true dragonfly (Anisoptera). Members of this group live in <u>lotic-erosional</u> and <u>depositional</u> habitats and tend to be found along the margins of streams, in areas of moderate or slower flow, where there is detritus. They are stiff-looking <u>climbers</u> on roots, plant stems, and debris at edges of slowly flowing streams. They are <u>engulfing predators</u> that actively stalk their prey then snatch it up with their <u>labial mask</u>, an arm-like extremity that extends from below the face. The adults of this group are often dark winged with slender iridescent green-blue bodies.",
    "expandedCharacterList": "Suborder Zygoptera (i.e., damselflies: as shown by slender body shape, head wider than thorax and abdomen; 3 long feather-like gills present at posterior end of abdomen). <strong>First antennal segment long, each subequal to length of rest of its antenna.</strong> <u>Labial mask</u> with deep, open, diamond-shaped, <u>median</u> cleft at <u>apex</u>. <u>Lateral</u> gills at posterior end of abdomen triangular in cross section."
  },
  {
    "id": 257,
    "orderId": 57,
    "commonName": "Narrow-winged Damselflies",
    "scientificName": "Coenagrionidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "This is the largest damselfly family, including roughly 90 North American species in 15 genera. Most genera are found in <u>lentic</u> habitats, except <em>Argia</em>, which is usually found in streams among rocks and plants. <u>Nymphs</u> are <u>climbers</u> and stalking predators among plants and roots. Some of the <u>nymphs</u> in this group can be used for fly-fishing, but usually are only useful in slowly moving water. Unlike most damselfly adults, which tend to rest from flight on plants, members of the Coenagrionidae tend to rest on rocks or other exposed surfaces. Interestingly, adult males and females of the same species tend to differ in color.",
    "expandedCharacterList": "Zygoptera (slender body shape with head wider than thorax and abdomen, and with 3 long feather-like gills at posterior end). <strong>Antennal segment 1 much shorter than rest of its antenna</strong>. Pair of lobes at <u>distal</u> end of <u>labral</u> mask each with 0–6 setae, but attached moveable hook without <u>setae</u>.<strong> <u>Ligula</u> (<u>distal</u> part of palm of mask) usually without <u>median</u> cleft, mask roughly triangular or square</strong> (not stalked as in Lestidae). Each side of <u>median</u> line with either 0, 1, or 3–5, <u>dorsal</u> premental <u>setae</u> (hairs inside the palm of the mask). Mature <u>larvae</u> 13–25 mm long."
  },
  {
    "id": 261,
    "orderId": 57,
    "commonName": "Spiketails, Biddies",
    "scientificName": "Cordulegastridae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 263,
    "orderId": 57,
    "commonName": "Greeneyed Skimmer, Emeralds",
    "scientificName": "Corduliidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "This dragonfly family includes roughly 7 North American genera and 50 species, and unlike most dragonfly familes, tends to have more species found in the North than the South. They can be found in varying habitats including streams, as well as <u>lentic</u> habitats such as lakes, ponds, and wetlands. They are <u>sprawlers</u> along the <u>benthos</u> and <u>climbers</u> on plants. <u>Nymphs</u> can be easily confused with those of the family Libellulidae (Common Skimmers) but can be identified with close attention to the presence of a longitudinal groove on the base of the <u>ventral</u> surface of the <u>labial mask</u>. They molt into adults at roughly the same time as burrowing mayflies, one of their favorite foods.",
    "expandedCharacterList": "Suborder Anisoptera (i.e., dragonflies: with stout body shape, head more narrow than thorax and abdomen; end of abdomen with 5 short pointed projections, external gills absent). <strong><u>Labial mask</u> spoon-shaped, usually with hairs inside palm of mask (<u>dorsal</u> premental <u>setae</u>) and along margins of <u>palpal</u> lobes (at end of mask)</strong>. <strong><u>Ventrally</u>, <u>median</u> groove extending from <u>basal</u> hinge of mask to about 1/3 to 1/2 way to <u>distal</u> margin of mask, often faint.</strong> <u>Distal</u> margin of each <u>palpal</u> lobe scalloped, with each <u>crenulation</u> rounded and separated by deep notches, usually ¼ to ½ as high as long, each bearing at least 1 <u>seta</u>. Frontal horn usually absent. Paraprocts (ventrolateral pair of posterior spines) usually less than twice as long as <u>cerci</u> (dorsolateral pair of posterior spines). Mature <u>larvae</u> 13-28 mm long."
  },
  {
    "id": 265,
    "orderId": 57,
    "commonName": "Clubtails",
    "scientificName": "Gomphidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "This family includes approximately 16 genera and more than 80 North American species. This is a fairly common and widespread group, found among debris or <u>burrowing</u> in both <u>lentic</u> and <u>lotic</u> habitats. <u>Nymphs</u> are easily identified by their rather thick antennae. Like other dragonflies, the adults and <u>nymphs</u> are predators. <u>Nymphs</u> bury in the sediment, partially hiding themselves to wait for prey to pass by, and then snatch them up with their arm-like <u>labral</u> mask. The adults typically fly low to the ground and only in bright sun.",
    "expandedCharacterList": "Suborder Anisoptera (i.e., Dragonflies: stout body shape, head more narrow than thorax and abdomen, end of abdomen with 5 short pointed projections, external gills absent). <strong><u>Labial mask</u> flattened</strong>, without hair on palm of inside of mask (premental <u>setae</u>) or usually without <u>setae</u> along margins of <u>palpal</u> lobes at end of mask. <u>Ligula</u> (<u>distal</u> margin of <u>labial</u><u> mask</u>) without <u>median</u> cleft. <strong>Antennae each 4-segmented, although 4th segment usually small</strong>. Fore- and middle <u>tarsi</u> each 2 segmented. Mature <u>larvae</u> 23–40 mm long, rarely to 65 mm."
  },
  {
    "id": 268,
    "orderId": 57,
    "commonName": "Spreadwinged Damselflies",
    "scientificName": "Lestidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 270,
    "orderId": 57,
    "commonName": "Skimmers",
    "scientificName": "Libellulidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "This is a group of 90 North American species, the most of any dragonfly family. <u>Nymphs</u> can be found in a variety of <u>lentic</u> habitats including wetlands, ponds, and ditches, as well as along the margins of slow-flowing <u>lotic</u> habitats. They can be found <u>sprawling</u> on the <u>benthos</u> or <u>climbing</u> plants and woody debris. Some species are extremely tolerant of low oxygen concentrations in the water as well as high alkalinity, and <u>brackish</u> water habitats. <u>Nymphs</u> can sometimes be used for fly-fishing in still water habitats. The adults seem to fly in rather unpredictable flight trajectories and tend to have wings patterned with pigment.",
    "expandedCharacterList": "Suborder Anisoptera (i.e., Dragonflies: stout body shape, head more narrow than thorax and abdomen, end of abdomen with 5 short pointed projections, external gills absent). <strong><u>Labial mask</u> spoon-shaped</strong>, usually with hair inside palm of mask and along margins. <strong><u>Distal</u> margin of each <u>palpal</u> lobe regularly and finely scalloped, each scallop 1/10 to 1/6 as high as long</strong>, each bearing at least 1 <u>seta</u>, and usually separated by shallow notches.<strong> Prementum without <u>ventral</u> <u>medial</u> groove</strong> at base. Hind <u>femora</u> usually not extending to posterior margin of abdominal segment 8. Abdomen elongate in <u>dorsal</u> view. Paraprocts (ventrolateral pair of spines) usually more than twice as long as <u>cerci</u> (dorsolateral pair of spines). Mature <u>larvae</u> 8–28 mm long."
  },
  {
    "id": 78,
    "orderId": 60,
    "commonName": "",
    "scientificName": "Poduridae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 65,
    "orderId": 64,
    "commonName": "",
    "scientificName": "Unionidae",
    "lifeStageName": "adult",
    "lifeStagePrettyName": "Adult",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 68,
    "orderId": 67,
    "commonName": "Basket Clams",
    "scientificName": "Cyrenidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 70,
    "orderId": 67,
    "commonName": "Fingernail Clams, Pea Clams",
    "scientificName": "Sphaeriidae",
    "lifeStageName": "adult",
    "lifeStagePrettyName": "Adult",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 73,
    "orderId": 72,
    "commonName": "Water Mites",
    "scientificName": "Limnesiidae",
    "lifeStageName": "adult",
    "lifeStagePrettyName": "Adult",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 76,
    "orderId": 75,
    "commonName": "Scuds, Amphipods, Sideswimmers",
    "scientificName": "Gammaridae",
    "lifeStageName": "adult",
    "lifeStagePrettyName": "Adult",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 82,
    "orderId": 81,
    "commonName": "Bladder Snails",
    "scientificName": "Physidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 84,
    "orderId": 81,
    "commonName": "Ram's Horn Snails",
    "scientificName": "Planorbidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 344,
    "orderId": 86,
    "commonName": "Hydrobiid Snails",
    "scientificName": "Hydrobiidae",
    "lifeStageName": "adult",
    "lifeStagePrettyName": "Adult",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 92,
    "orderId": 91,
    "commonName": "",
    "scientificName": "Naididae",
    "lifeStageName": "adult",
    "lifeStagePrettyName": "Adult",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 96,
    "orderId": 95,
    "commonName": "Freshwater Jawless Leeches",
    "scientificName": "Glossiphoniidae",
    "lifeStageName": "adult",
    "lifeStagePrettyName": "Adult",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 101,
    "orderId": 100,
    "commonName": "Flatworms, Planarian",
    "scientificName": "Planariidae",
    "lifeStageName": "adult",
    "lifeStagePrettyName": "Adult",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 104,
    "orderId": 103,
    "commonName": "Aquatic Oligochaete Worm",
    "scientificName": "Lumbriculidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  },
  {
    "id": 107,
    "orderId": 106,
    "commonName": "Aquatic Sow Bugs",
    "scientificName": "Asellidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "Isopods are a type of non-insect arthropod, or crustacean. Most isopods live on land, however there are approximately 100 North American aquatic species, mostly belonging to the family Asellidae. They tend to be rather flat from top to bottom, not laterally. They often have mottled coloring. These are usually bottom dwelling sprawlers, found in shallow, freshwater habitats. Usually they are omnivores or detritivores. Asellus communis is sometimes used for fly fishing in slow water areas with lots of plant growth.",
    "expandedCharacterList": "The antennules (smaller of the two pairs of antennas) are well formed, not vestigial. Dorsal body segments 8–9 are small and inconspicuous, not well pronounced in as in Stenasellidae. The uropods (pair of forked, tail-like appendages) are present terminally not lateral or ventral. "
  },
  {
    "id": 728,
    "orderId": 727,
    "commonName": "Predatious Diving Beetle Larvae",
    "scientificName": "Dytiscidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "This is the largest North American family of aquatic beetles, including over 400 species in about 35 genera. Both adults and <u>larvae</u> can be found in almost any aquatic habitat, even in <u>brackish</u> water; however, they are most often found in <u>lentic</u> freshwater systems. The <u>larvae</u> tend to be <u>climbers</u> on rooted plants and <u>swimmers</u>; adults are <u>swimmers</u> and <u>divers</u>. Both <u>larvae</u> and adults are <u>engulfing predators</u> of small invertebrates and fish, and are sometimes cannibalistic. Some <u>larvae</u> have a channel along the inner margin of each mandible to help them ingest fluids from their prey. Their bite is quite painful. Despite living in the water, adults and <u>larvae</u> of most species must regularly resurface for air.",
    "expandedCharacterList": "<u>Larvae</u> approximately 5–70 mm long. <strong>Sickle-shaped mandibles</strong> without <u>mola</u> (grinding surface). Long, slender swimming legs <strong>5-segmented, excluding 2 claws</strong>.<strong> Abdomen 8-segmented</strong>, lacking hooks on terminal segment, usually without gills. Roughly cylindrical thorax and abdomen tapered to anterior and posterior ends. <u>Cerci</u> (<u>urogomphi</u>) usually 2-segmented, slender and longer than abdominal segment 1, but can be stout, short, inconspicuous, or absent. "
  },
  {
    "id": 732,
    "orderId": 727,
    "commonName": "Riffle Beetle Larvae",
    "scientificName": "Elmidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "This is a large family, including 24 genera and close to 100 species. They are known as riffle beetles, due to their common occurrence in habitats with fast-flowing water and high oxygen levels. Both <u>larvae</u> and adults are slow-moving <u>clingers</u> that feed by <u>scraping</u> or <u>collecting and gathering</u> <u>periphyton</u> and detritus from surfaces of rocks and other substrates. The <u>larvae</u> get their oxygen directly from gills that can be retracted into the end of the abdomen. Adults have an effective plastron and usually do not need to surface for air. Elmid <u>larvae</u> are unusual in that they have up to 8 instars, whereas most beetle <u>larvae</u> molt only 3 times.",
    "expandedCharacterList": "<u>Labrum</u> and <u>clypeus</u> separated by distinct <u>suture</u>. Antennae 2–3 segmented. Head with <u>ocelli</u> in groups of 5. Legs adapted for walking, sometimes small, each 3–4 segmented and with single claw. <u>Thoracic</u> tergites clearly defined. Abdomen 9-segmented, <u>ventral</u> gills absent from segments 1–8.<strong> Segment 9 (posterior-most segment) with <u>ventral</u> lid-like flap (<u>operculum</u>) concealing thread-like gills and pair of hooks</strong>. <strong>Body strongly <u>sclerotized</u> (hardened), dark brown or red-brown, roughly cylindrical or spindle-shaped,</strong> with head and legs visible in <u>dorsal</u> view."
  },
  {
    "id": 739,
    "orderId": 727,
    "commonName": "Whirligig Beetle Larvae",
    "scientificName": "Gyrinidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "Adult members of the family Gyrinidae are unique in that their <u>compound eyes</u> are divided into separate <u>dorsal</u> and <u>ventral</u> portions, giving them a \"four-eyed\" appearance. This allows them to see both above and below the water at the same time. Their nickname, “whirligig beetles” was given to the adult beetles due to their behavior of zipping around in swirling motions along the surface of the water, although they are also good <u>divers</u>. Both the <u>larvae</u> and adults of this family are aquatic, typically found in quiet water of <u>lentic</u> or <u>lotic</u> habitats. The pupae are terrestrial. Both adults and <u>larvae</u> are <u>engulfing predators</u> of small invertebrates, but the adults may also be surface film scavengers. <u>Larvae</u> live and feed on the bottom or climb on rooted plants.",
    "expandedCharacterList": "<strong>Legs 5-segmented plus 2 tarsal claws. Abdominal segments 1–9 with <u>lateral</u> gills. Abdominal segment 10 (posterior-most segment) with 4 stout hooks.</strong>"
  },
  {
    "id": 743,
    "orderId": 727,
    "commonName": "Crawling Water Beetle Larvae",
    "scientificName": "Haliplidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "This family includes over 70 North American species. Both the <u>larvae</u> and adults of this family are aquatic. They can be found in <u>lentic</u>-<u>littoral</u> or <u>lotic-depositional</u> habitats. They are good <u>climbers</u> among the rooted plants found in their habitats. Adults can be strong swimmers as well. Both life stages have similar feeding habits; they tend to be <u>shredding</u> or <u>piercing herbivores</u>, but some are <u>engulfing predators</u>. The <u>larvae</u> sometimes overwinter in moist soil before molting into pupae and then adults. The adults must frequently resurface for air; however, the <u>larvae</u> get all of their oxygen from the water.",
    "expandedCharacterList": "Mandibles with groove along the internal margin. <strong>Legs 5-segmented and with single claw</strong>. <strong>Mature <u>larvae</u> usually with long, slender, stiff, needle-like <u>dorsal</u> projections from <u>thoracic</u> and abdominal segments.</strong> Abdomen 9–10 segmented; hooks absent from terminal segments."
  },
  {
    "id": 745,
    "orderId": 727,
    "commonName": "Water Scavenger Beetle Larvae",
    "scientificName": "Hydrophilidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "Hydrophilidae is the second largest family of North American aquatic beetles, including more than 250 species. The <u>larvae</u> and adults are aquatic or semiaquatic; the pupae are terrestrial. They prefer <u>lentic</u> waters such as ponds and shallow lakes, or sometimes pools at edges of streams. Unlike most beetles, the adults of this family tend to swim by alternating strokes with their <u>hind legs</u>, rather than moving them in unison. Also atypical, they have a habit of surfacing for air head first, breaking the water surface tension and accessing air with their specially formed antennae. The adults have a well-developed plastron to hold air underwater; in well-oxygenated water this thin layer of air serves as a gill. <u>Larvae</u> frequently surface to take in air from the end of the abdomen. <u>Larvae</u> are usually predators of other invertebrates, and can even break snail shells with their strong jaws. However, only a small number of adults are predators, most are omnivores or detritivores. ",
    "expandedCharacterList": "Each mandible with 1 to 3 teeth along inner margin. <strong><u>Labrum</u> and <u>clypeus</u> not separated by distinct <u>suture</u></strong>. Antennae each 2- or 3-segmented. Head with simple-eyes in groups of 5. <strong>Legs each 3- or 4-segmented, with single claw</strong>; legs adapted for walking, sometimes small. <u>Thoracic</u> tergites clearly defined. Abdominal tergites without <u>dorsal</u> lobes. <strong>Abdomen usually 8-segmented</strong>. Body roughly cylindrical or spindle-shaped, not markedly thick. Head and legs visible in <u>dorsal</u> view."
  },
  {
    "id": 747,
    "orderId": 727,
    "commonName": "Water Pennies",
    "scientificName": "Psephenidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": "In North America North of Mexico this family includes 6 genera and about 16 species. Adults and pupae of this family are terrestrial, except for females enter the water to lay eggs. The <u>larvae</u>, however are fully aquatic. They are very distinctive, flat, shield-shaped larvae, almost trilobite-like in appearance, with the legs only visible from the <u>ventral</u> side. They are almost always found stuck (suction cup-like) to the sides and tops of rocks, where they feed by <u>scraping</u> <u>periphyton</u> and other food off of the substrate.",
    "expandedCharacterList": "Short 2–3 segmented antenna. <u>Labrum</u> and <u>clypeus</u> separated by <u>suture</u>. Legs (visible <u>ventrally</u>) 3–4 segmented with only single tarsal claw, suitable for walking. Abdomen 9-segmented. Abdominal tergites without <u>dorsal</u> lobes.<strong> Body dorsoventrally flattened, with <u>thoracic</u> and abdominal tergites expanded <u>laterally</u>, collectively forming thin shield covering head and legs from above</strong>."
  },
  {
    "id": 783,
    "orderId": 727,
    "commonName": "Toe-Winged Beetle Larvae",
    "scientificName": "Ptilodactylidae",
    "lifeStageName": "larva",
    "lifeStagePrettyName": "Larva",
    "description": null,
    "expandedCharacterList": null
  }
]